pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// bl602_demo_at_text_0007.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 23070384: Register Eq_2 pbuf_realloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_348280 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_348287) s5Out, Register out Eq_348288 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      get_dns_request
//      dhcp_option_trailer
//      ip4_input
//      tcp_oos_insert_segment
//      tcp_receive
//      tcp_split_unsent_seg
//      dhcp_server_recv
//      altcp_mbedtls_handle_rx_appldata
Eq_2 pbuf_realloc(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_348280 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, struct Eq_348287 & s5Out, union Eq_348288 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a5_5 = (word32) *((word32) a0 + 8);
	if (a1 >= a5_5)
	{
		s1Out = s1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_14 = a0;
		Eq_2 s1_15 = a1;
		up32 a5_16 = a1 - a5_5;
		while (true)
		{
			Eq_2 a1_19 = (word32) *((word32) s0_14 + 0x0A);
			if (a1_19 >= s1_15)
				break;
			a4 = (word32) *((word32) s0_14 + 8) + a5_16;
			((word32) s0_14 + 8)->u2 = (word16) a4;
			s1_15 = (word32) (word16) (s1_15 - a1_19);
			s0_14 = *s0_14;
		}
		ui32 a5_29 = (word32) *((word32) s0_14 + 0x0C);
		Eq_2 a5_164 = a5_29 & 0x0F;
		if ((a5_29 & 0x0F) == 0x00 && a1_19 != s1_15)
		{
			ui32 a5_31 = (word32) *((word32) s0_14 + 0x0D);
			a5_164 = a5_31 & 0x02;
			if ((a5_31 & 0x02) == 0x00)
			{
				Eq_2 s0_33 = *((word32) a1_19 + 4);
				s1_15 = mem_trim(s0_33, (word32) (word16) ((word32) s1_15 + (a1_19 - s0_33)), a3, a4, s2, s3, s4, mstatus, s0, dwArg14, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out a0, out a3, out a4, out a5_164, out s2, out s3, out s4, out s5, out s6, out s8);
			}
		}
		struct Eq_403926 * s0_115 = *a0;
		s0_115->w000A = (word16) s1_15;
		s0_115->w0008 = (word16) s1_15;
		if (a0 != 0x00)
		{
			word32 a0_251;
			word32 a1_252;
			word32 a2_253;
			word32 a7_254;
			ra = pbuf_free(ra, a0, a3, a4, s4, mstatus, dwArg0118, out s0_115, out s1_15, out a0_251, out a1_252, out a2_253, out a3, out a4, out a5_164, out a7_254, out s2, out s3, out s4, out s5, out s6, out s8, out mstatus);
		}
		s0_115->t0000.u0 = 0x00;
		s1Out = s1_15;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_164;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
}

// 230703FE: Register Eq_2 pbuf_free_header(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_385205) s2Out, Register out (ptr32 Eq_385206) s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_385208) s5Out, Register out Eq_385209 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_recv_tcp
//      httpc_tcp_recv
Eq_2 pbuf_free_header(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, struct Eq_385205 & s2Out, struct Eq_385206 & s3Out, ptr32 & s4Out, struct Eq_385208 & s5Out, union Eq_385209 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s0_11 = a0;
	while (a1 != 0x00 && s0_11 != 0x00)
	{
		if (a1 < (word32) (*((word32) s0_11 + 0x0A)))
		{
			word32 a5_154;
			word32 a4_153;
			word32 a1_152;
			pbuf_remove_header(s0_11, a1, a2, out a1_152, out a3, out a4_153, out a5_154);
			break;
		}
		Eq_2 s0_34 = *s1;
		*s0_34 = 0x00;
		word32 s0_155;
		word32 a0_156;
		word32 a2_157;
		word32 a5_158;
		word32 a7_159;
		word32 s8_160;
		ra = pbuf_free(ra, s0_34, a3, a4, s4, mstatus, dwArg0108, out s0_155, out s1, out a0_156, out a1, out a2_157, out a3, out a4, out a5_158, out a7_159, out s2, out s3, out s4, out s5, out s6, out s8_160, out mstatus);
		s0_11 = s1;
		a2 = dwArg44;
	}
	s0Out = s0_11;
	s1Out = s1;
	a0Out = s0_11;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s8Out = dwLoc1C;
	mstatusOut = mstatus;
	return ra;
}

// 23070440: Register Eq_2 pbuf_clen(Register Eq_2 a0)
// Called from:
//      tcp_free_acked_segments.isra.3
//      tcp_split_unsent_seg
//      tcp_send_fin
//      altcp_tcp_write
Eq_2 pbuf_clen(Eq_2 a0)
{
	Eq_2 a5_3 = 0x00;
	while (a0 != 0x00)
	{
		a5_3 = (word32) (word16) ((word32) a5_3 + 1);
		a0 = *a0;
	}
	return a5_3;
}

// 23070452: Register Eq_2 pbuf_ref(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      bl_output
//      etharp_query
//      pbuf_chain
//      tcp_seg_copy
Eq_2 pbuf_ref(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return a0;
	}
	else
	{
		word32 a2_41;
		word32 a4_42;
		Eq_2 a0_12 = sys_arch_protect(a4, mstatus, out a2_41, out a4_42);
		*((word32) a0 + 0x0E) = (byte) ((word32) *((word32) a0 + 0x0E) + 0x01);
		Eq_2 a4_24;
		ptr32 a5_25;
		a3Out = sys_arch_unprotect(a3, mstatus, out a4_24, out a5_25);
		a4Out = a4_24;
		a5Out = a5_25;
		return a0_12;
	}
}

