pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23070476: void pbuf_cat(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4)
// Called from:
//      tcpip_stack_input
//      pbuf_chain
//      tcp_receive
//      httpc_tcp_recv
//      altcp_mbedtls_handle_rx_appldata
//      altcp_mbedtls_lower_recv
void pbuf_cat(Eq_2 a0, Eq_2 a1, Eq_2 a4)
{
	if (a0 == 0x00)
		return;
	if (a1 == 0x00)
		return;
	while (true)
	{
		struct Eq_404103 * a0_11 = *a4;
		Mem15[a0_11 + 8:word16] = SLICE(CONVERT(CONVERT(Mem6[a0 + 8:uint16] + Mem6[a1 + 8:uint16], uint16, uint16), uint16, word32), word16, 0);
		if (a4 == 0x00)
			break;
		a0 = a4;
	}
	*a1 = a0_11;
}

// 23070498: void pbuf_chain(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      raw_send
//      udp_sendto
void pbuf_chain(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	pbuf_cat(a0, a1, a4);
	word32 a3_26;
	word32 a4_27;
	word32 a5_28;
	pbuf_ref(a1, a3, a4, mstatus, out a3_26, out a4_27, out a5_28);
}

// 230704B0: Register Eq_2 pbuf_copy(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_404145 a3Out, Register out (ptr32 Eq_2) a4Out, Register out Eq_2 s2Out, Register out Eq_404148 s3Out, Register out ptr32 s4Out)
// Called from:
//      pbuf_clone
//      icmp_input
//      dhcp_server_recv
Eq_2 pbuf_copy(Eq_2 a0, Eq_2 a1, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_404145 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_404148 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s0;
	}
	ptr32 a0_192;
	Eq_2 s1_111;
	Eq_2 s0_19 = a1;
	s1_111 = s1;
	if (a1 != 0x00)
	{
		a4 = (word32) *((word32) a0 + 8);
		s1_111 = a0;
		if (a4 >= (word32) (*((word32) a1 + 8)))
		{
			union Eq_2 * s4_118 = null;
			s3.u0 = 0x00;
			do
			{
				s2 = (word32) *((word32) s1_111 + 0x0A) - s3;
				Eq_2 a5_33 = (word32) *((word32) s0_19 + 0x0A) - s4_118;
				if (a5_33 < s2)
					s2 = a5_33;
				s0_19 = *((word32) a1 + 4);
				s1_111 = *((word32) a0 + 4);
				a0 += s3;
				word32 a7_311;
				word32 a6_310;
				word32 a5_309;
				word32 a2_307;
				word32 a4_308;
				memcpy(a0, a1 + s4_118, s2, out a1, out a2_307, out a3, out a4_308, out a5_309, out a6_310, out a7_311);
				a4 = (word32) *((word32) s0_19 + 0x0A);
				s4_118 += s2;
				s3 += s2;
				Eq_404148 a5_64 = (word32) *((word32) s1_111 + 0x0A);
				if (s4_118 >= a4)
				{
					s0_19 = *s0_19;
					s4_118 = null;
				}
				if (s3 == a5_64)
				{
					s1_111 = *s1_111;
					if (s1_111 == 0x00)
					{
						a0_192 = 0x00;
						if (s0_19 != 0x00)
							goto l2307051A;
						goto l2307051C;
					}
					s3.u0 = 0x00;
				}
				if (s0_19 != 0x00)
				{
					a4 = (word32) *((word32) s0_19 + 0x0A);
					union Eq_2 * a5_77 = (word32) *((word32) s0_19 + 8);
					if (a4 != a5_77)
						goto l23070540;
					s0_19 = *a5_77;
					if (a5_77 == null)
						goto l23070540;
					goto l23070556;
				}
l23070540:
				a4 = (word32) *((word32) s1_111 + 0x0A);
				union Eq_2 * a5_83 = (word32) *((word32) s1_111 + 8);
				if (a4 == a5_83)
				{
					s1_111 = *a5_83;
					if (a5_83 == null)
						goto l23070550;
l23070556:
					a0_192 = ~0x05;
					goto l2307051C;
				}
l23070550:
			} while (s0_19 != 0x00);
			a0_192 = 0x00;
l2307051C:
			s1Out = s1_111;
			a0Out = a0_192;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArg04;
			return s1;
		}
	}
l2307051A:
	a0_192 = ~0x0F;
	goto l2307051C;
}

// 2307055E: Register Eq_2 pbuf_copy_partial(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 s1Out, Register out (ptr32 Eq_347865) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_347869) a4Out, Register out (ptr32 Eq_347870) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_347872) s3Out, Register out (ptr32 Eq_347873) s4Out, Register out ptr32 s8Out)
// Called from:
//      get_dns_request
//      lwip_recv_tcp
//      lwip_recvfrom_udp_raw.isra.6
//      dns_recv
//      dhcp_recv
//      tcp_split_unsent_seg
//      tcp_zero_window_probe
//      sntp_recv
//      httpc_tcp_recv
//      altcp_mbedtls_bio_recv
Eq_2 pbuf_copy_partial(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_2 & s1Out, struct Eq_347865 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_347869 & a4Out, struct Eq_347870 & a5Out, union Eq_2 & s2Out, struct Eq_347872 & s3Out, struct Eq_347873 & s4Out, ptr32 & s8Out)
{
	Eq_2 s1_158;
	struct Eq_347865 * s0_101 = null;
	s1_158 = s1;
	if (a0 != 0x00)
	{
		s0_101 = null;
		s1_158 = s1;
		if (a1 != 0x00)
		{
			s2 = a0;
			s1_158 = a2;
			while (s1_158 != 0x00 && s2 != 0x00)
			{
				a1 = (word32) *((word32) s2 + 0x0A);
				if (a3 != 0x00 && a3 >= a1)
					a3 = (word32) (word16) (a3 - a1);
				else
				{
					Eq_2 a1_33 = (word32) (word16) (a1 - a3);
					Eq_2 s3_34 = a1_33;
					if (s1_158 < a1_33)
						s3_34 = s1_158;
					uint32 s3_43 = s3_34 << 16;
					word32 a2_194;
					word32 a3_195;
					word32 a6_196;
					word32 a7_197;
					memcpy(a1 + s0_101, Mem15[s2 + 4:int32] + a3, s3_43 >>u 0x10, out a1, out a2_194, out a3_195, out a4, out a5, out a6_196, out a7_197);
					s3 = s3_43 >> 0x10;
					s0_101 = (word32) (word16) (s0_101 + (s3_43 >> 0x10));
					s1_158 = (word32) (word16) (s1_158 - (s3_43 >> 0x10));
					a3.u0 = 0x00;
				}
				s2 = *s2;
			}
		}
	}
	s1Out = s1_158;
	a0Out = s0_101;
	a1Out = a1;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = s4;
	return s1;
}

// 230705DE: Register (ptr32 Eq_347740) pbuf_take(Register (ptr32 Eq_347740) a0, Register ptr32 a1, Register Eq_2 a2, Register out (ptr32 Eq_347740) s1Out, Register out Eq_348027 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      get_dns_request
//      dns_check_entry
//      pbuf_take_at
struct Eq_347740 * pbuf_take(struct Eq_347740 * a0, ptr32 a1, Eq_2 a2, struct Eq_347740 & s1Out, union Eq_348027 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	if (a0 == null)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return s0;
	}
	else
	{
		struct Eq_347740 * s1_126 = a0;
		if (a1 != 0x00)
		{
			Eq_2 s0_24 = a2;
			s3 = 0x00;
			if ((word32) a0->w0008 >= a2)
			{
				for (; s0_24 != 0x00; s0_24 -= s2)
				{
					s2 = (word32) s1_126->w000A;
					if (s0_24 < s2)
						s2 = s0_24;
					Eq_2 s1_35 = *(union Eq_2 *) 0x03;
					word32 a1_165;
					word32 a2_166;
					word32 a5_167;
					word32 a6_168;
					word32 a7_169;
					memcpy(~0x00, a1 + s3, s2, out a1_165, out a2_166, out a3, out a4, out a5_167, out a6_168, out a7_169);
					s1_126 = (struct Eq_347740 *) *s1_35;
					s3 = (word32) s2 + s3;
				}
			}
		}
		s1Out = s1_126;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s8Out = s4;
		return s1;
	}
}

// 2307063C: Register word32 pbuf_take_at(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_348073 s8Out)
// Called from:
//      get_dns_request
//      dns_check_entry
word32 pbuf_take_at(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_348073 & s8Out)
{
	pbuf_skip_const(a0, a3, fp + -0x0022);
	Eq_2 s3_11 = a1;
	if (a0 != 0x00)
	{
		a4 = (word32) wLoc22;
		a3 = (word32) *((word32) a0 + 8);
		s1 = a0;
		if (a3 >= (word32) a2 + a4)
		{
			s2 = a2;
			Eq_2 a5_30 = (word32) *((word32) a0 + 0x0A) - a4;
			if (a5_30 < a2)
				s2 = (word32) (word16) a5_30;
			s1 = *(union Eq_2 *) 0x03;
			word32 a1_148;
			word32 a2_149;
			word32 a5_150;
			word32 a6_151;
			word32 a7_152;
			memcpy(a4 + ~0x00, a1, s2, out a1_148, out a2_149, out a3, out a4, out a5_150, out a6_151, out a7_152);
			Eq_2 a2_58 = (word32) (word16) (a2 - s2);
			if (a2_58 != 0x00)
				pbuf_take(null, a1 + s2, a2_58, out s1, out a3, out a4, out s2, out s3_11, out s4, out s8);
		}
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3_11;
	s4Out = s4;
	s8Out = s8;
	return dwArgE4;
}

// 230706B4: Register Eq_2 pbuf_clone(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_347775 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_397057 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out Eq_397060 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_query
//      recv_raw
Eq_2 pbuf_clone(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_347775 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_397057 & a3Out, ptr32 & a4Out, ptr32 & s2Out, union Eq_397060 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a0_19;
	ptr32 mstatus_35;
	ptr32 s5_37;
	ptr32 s6_38;
	word32 s0_122;
	word32 a1_123;
	word32 a2_124;
	word32 a5_125;
	word32 a7_126;
	word32 s8_127;
	ptr32 a4_22;
	Eq_397057 a3_21;
	Eq_2 s1_25;
	ptr32 s2_100;
	Eq_397060 s3_101;
	ptr32 s4_102;
	Eq_2 ra_36 = pbuf_alloc(ra, s0, a2, a0, (word32) *((word32) a2 + 8), a1, a3, a4, mstatus, s0, dwArg34, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0148, out s0_122, out s1_25, out a0_19, out a1_123, out a2_124, out a3_21, out a4_22, out a5_125, out a7_126, out s2_100, out s3_101, out s4_102, out s5_37, out s6_38, out s8_127, out mstatus_35);
	Eq_2 s0_44 = a0_19;
	if (a0_19 != 0x00)
	{
		word32 a0_128;
		s0_44 = pbuf_copy(a0_19, s1_25, out s1_25, out a0_128, out a3_21, out a4_22, out s2_100, out s3_101, out s4_102);
	}
	s1Out = s1_25;
	a0Out = s0_44;
	a3Out = a3_21;
	a4Out = a4_22;
	s2Out = s2_100;
	s3Out = s3_101;
	s4Out = s4_102;
	s5Out = s5_37;
	s6Out = s6_38;
	mstatusOut = mstatus_35;
	return ra_36;
}

// 230706DE: Register Eq_2 pbuf_try_get_at(Register Eq_2 a0, Register Eq_2 a1, Register out (ptr32 Eq_389254) a3Out, Register out (ptr32 Eq_389254) a4Out, Register out Eq_2 a5Out)
// Called from:
//      dns_recv
//      pbuf_get_at
Eq_2 pbuf_try_get_at(Eq_2 a0, Eq_2 a1, struct Eq_388907 & a3Out, struct Eq_388907 & a4Out, union Eq_2 & a5Out)
{
	pbuf_skip_const(a0, a1, fp + ~0x11);
	Eq_2 a5_12 = ~0x00;
	if (a0 != 0x00)
	{
		a4 = (word32) wLoc12;
		a3 = (word32) *((word32) a0 + 0x0A);
		a5_12.u0 = ~0x00;
		if (a4 < a3)
			a5_12 = (word32) a4->tFFFFFFFF;
	}
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_12;
	return a5_12;
}

// 2307070C: Register Eq_2 pbuf_get_at(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a3Out, Register out Eq_404547 a4Out)
// Called from:
//      pbuf_memcmp
//      sntp_recv
//      httpc_tcp_recv
Eq_2 pbuf_get_at(Eq_2 a0, Eq_2 a1, ptr32 & a3Out, union Eq_404547 & a4Out)
{
	ptr32 a3_12;
	Eq_404547 a4_13;
	word32 a5_30;
	int32 a0_14 = pbuf_try_get_at(a0, a1, out a3_12, out a4_13, out a5_30);
	if (a0_14 < 0x00)
		a0_14 = 0x00;
	a3Out = a3_12;
	a4Out = a4_13;
	return a0_14 & 0x00FF;
}

