pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23070916: Register ui32 raw_bind_netif(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_setsockopt_callback
ui32 raw_bind_netif(Eq_2 a0, Eq_2 a1)
{
	ui32 a5_3 = 0x00;
	if (a1 != 0x00)
		a5_3 = (word32) *((word32) a1 + 0x0044) + 0x01 & 0x00FF;
	*((word32) a0 + 8) = (byte) a5_3;
	return a5_3;
}

// 2307092A: Register Eq_2 raw_connect(Register Eq_2 a0, Register (ptr32 Eq_392074) a1, Register Eq_2 a4, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      lwip_netconn_do_connect
Eq_2 raw_connect(Eq_2 a0, struct Eq_392074 * a1, Eq_2 a4, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a1 == null)
	{
		a4Out = a4;
		a5Out.u0 = <invalid>;
		return ~0x05;
	}
	else
	{
		*((word32) a4 + 4) = a0;
		ui32 a4_12 = (word32) *((word32) a0 + 0x0011);
		*((word32) a0 + 0x0011) = (byte) (a4_12 | 1);
		a4Out = a4_12 | 1;
		a5Out.u0 = <invalid>;
		return 0x00;
	}
}

// 23070948: void raw_recv(Register Eq_2 a0, Register (ptr32 Eq_404909) a1, Register Eq_404910 a2)
// Called from:
//      lwip_netconn_do_newconn
void raw_recv(Eq_2 a0, struct Eq_404909 * a1, Eq_404910 a2)
{
	a1->t0014 = a0;
	*((word32) a2 + 24) = a0;
}

// 2307094E: Register Eq_2 raw_sendto_if_src(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      raw_sendto
Eq_2 raw_sendto_if_src(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & a0Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	ptr32 s1_175;
	if (a0 == 0x00 || (a2 == 0x00 || a3 == 0x00))
	{
l23070A64:
		s1_175 = ~0x05;
		goto l230709B2;
	}
	Eq_2 s0_136 = a1;
	if (a4 == 0x00)
		goto l23070A64;
	if (((word32) *((word32) a0 + 0x0011) & 0x02) != 0x00)
	{
		a4 = (word32) *((word32) a1 + 0x0A);
		a5 = 0x13;
		if (a4 > 0x13)
		{
			word32 s6_445;
			word32 s8_447;
			word32 s4_443;
			word32 s3_442;
			word32 s5_444;
			ptr32 a0_244;
			Eq_2 a4_248;
			ptr32 a5_249;
			Eq_2 s0_253;
			word32 s7_446;
			word32 s9_448;
			word32 s2_441;
			word32 a7_440;
			word32 a3_439;
			word32 a1_438;
			word32 s1_437;
			ip4_output_if(ra, s1, s1, a1, a4, 0x00, 0x00, 0x00, 0x00, a3, dwArg04, s5, s6, s7, out s0_253, out s1_437, out a0_244, out a1_438, out a3_439, out a4_248, out a5_249, out a7_440, out s2_441, out s3_442, out s4_443, out s5_444, out s6_445, out s7_446, out s8_447, out s9_448);
			a0Out = a0_244;
			a4Out = a4_248;
			a5Out = a5_249;
			mstatusOut = mstatus;
			return s0_253;
		}
		goto l23070A64;
	}
	a4 = (word32) *((word32) a1 + 8);
	a5 = 0x0FFFFFEB;
	if (a4 > 0x0FFFFFEB)
	{
l230709B0:
		s1_175 = ~0x00;
		goto l230709B2;
	}
	Eq_2 s2_49;
	Eq_2 s4_123 = a4;
	Eq_2 s1_31 = a0;
	Eq_2 s5_115 = a3;
	Eq_2 s3_35 = a2;
	Eq_2 a2_38;
	Eq_2 a3_39;
	Eq_2 a4_40;
	word32 a1_449;
	word32 a5_450;
	if (pbuf_add_header(a1, 0x14, out a1_449, out a2_38, out a3_39, out a4_40, out a5_450) != 0x00)
	{
		Eq_2 a0_54;
		Eq_2 a3_56;
		word32 a1_451;
		word32 a2_452;
		word32 a7_453;
		word32 s2_454;
		word32 s8_455;
		ra = pbuf_alloc(ra, a1, a0, 0x00A2, 0x00, 640, a3_39, a4_40, mstatus, s4, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_136, out s1_31, out a0_54, out a1_451, out a2_452, out a3_56, out a4, out a5, out a7_453, out s2_454, out s3_35, out s4_123, out s5_115, out s6, out s8_455, out mstatus);
		s2_49 = a0_54;
		if (a0_54 == 0x00)
			goto l230709B0;
		if ((word32) *((word32) s0_136 + 8) != 0x00)
			pbuf_chain(a0_54, s0_136, a3_56, a4, mstatus);
	}
	else
	{
		word32 a1_477;
		word32 a3_478;
		if (pbuf_remove_header(a1, 0x14, a2_38, out a1_477, out a3_478, out a4, out a5) != 0x00)
			goto l230709B0;
		s2_49 = a1;
	}
	Eq_2 a3_107;
	if (((word32) *((word32) s1_31 + 0x0011) & 0x04) != 0x00)
	{
		if ((*s3_35 & 0x00F0) != 224)
			goto l23070A5E;
		*((word32) s2_49 + 0x0D) = (byte) ((word32) *((word32) s2_49 + 0x0D) | 4);
	}
	if ((*s3_35 & 0x00F0) == 224)
	{
		a3_107 = (word32) *((word32) s1_31 + 19);
		goto l23070A2E;
	}
l23070A5E:
	a3_107 = (word32) *((word32) s1_31 + 11);
l23070A2E:
	ptr32 a0_149;
	Eq_2 a3_152;
	Eq_2 s0_158;
	Eq_2 s2_160;
	Eq_2 s4_162;
	word32 s1_456;
	word32 a1_457;
	word32 a7_458;
	word32 s3_459;
	word32 s5_460;
	word32 s6_461;
	word32 s7_462;
	word32 s8_463;
	word32 s9_464;
	Eq_2 ra_157 = ip4_output_if(ra, s0_136, s1_31, s2_49, s4_123, s3_35, a3_107, (word32) *((word32) s1_31 + 0x0A), (word32) *((word32) s1_31 + 16), s5_115, s4_123, s5_115, s6, s7, out s0_158, out s1_456, out a0_149, out a1_457, out a3_152, out a4, out a5, out a7_458, out s2_160, out s3_459, out s4_162, out s5_460, out s6_461, out s7_462, out s8_463, out s9_464);
	s1_175 = a0_149;
	if (s0_158 != s2_160)
	{
		word32 s0_465;
		word32 a0_466;
		word32 a1_467;
		word32 a2_468;
		word32 a3_469;
		word32 a7_470;
		word32 s2_471;
		word32 s3_472;
		word32 s4_473;
		word32 s5_474;
		word32 s6_475;
		word32 s8_476;
		pbuf_free(ra_157, s2_160, a3_152, a4, s4_162, mstatus, dwArg0108, out s0_465, out s1_175, out a0_466, out a1_467, out a2_468, out a3_469, out a4, out a5, out a7_470, out s2_471, out s3_472, out s4_473, out s5_474, out s6_475, out s8_476, out mstatus);
	}
l230709B2:
	a0Out = s1_175;
	a4Out = a4;
	a5Out = a5;
	mstatusOut = mstatus;
	return s1;
}

// 23070A68: Register word32 raw_sendto(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack word32 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out Eq_405224 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      raw_send
//      lwip_netconn_do_send
word32 raw_sendto(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, word32 dwArg38, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & a0Out, union Eq_405224 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a2 == 0x00)
	{
		a0Out = ~0x05;
		a4Out = a4;
		a5Out = a5;
		mstatusOut = mstatus;
		return s0;
	}
	Eq_405224 a4_247;
	Eq_2 a0_25;
	Eq_2 a5_23;
	Eq_2 a0_16 = (word32) *((word32) a0 + 8);
	if (a0_16 != 0x00)
		a0_25 = netif_get_by_index(a0_16, out a4_247, out a5_23);
	else
	{
		Eq_2 a2_21 = *a5;
		a5_23 = a5 & 0x00F0;
		if ((a5 & 0x00F0) == 224)
		{
			word32 a4_336;
			a0_25 = netif_get_by_index((word32) *((word32) a0 + 18), out a4_336, out a5_23);
			if (a0_25 != 0x00)
			{
l23070AB6:
				Eq_2 a4_51;
				Eq_2 s0_46 = *a5_23;
				if (a5_23 != 0x00 && (a5_23 & 0x00F0) != 224)
					a4_51 = s0_46;
				else
					a4_51 = (word32) a0_25 + 4;
				0x00 = dwArg38;
				ptr32 a0_116;
				Eq_405224 a4_127;
				Eq_2 a5_128;
				ptr32 mstatus_142;
				word32 s0_119 = raw_sendto_if_src(ra, a2, s0_46, a1, a2, a0_25, a4_51, s4, s5, s6, s7, mstatus, dwArg04, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out a0_116, out a4_127, out a5_128, out mstatus_142);
				a0Out = a0_116;
				a4Out = a4_127;
				a5Out = a5_128;
				mstatusOut = mstatus_142;
				return s0_119;
			}
		}
		word32 a3_335;
		word32 a2_334;
		a0_25 = ip4_route(a2_21, a5_23, out a2_334, out a3_335, out a4_247, out a5_23);
	}
	if (a0_25 == 0x00)
	{
		0x00 = dwArg38;
		a0Out = ~0x03;
		a4Out = a4_247;
		a5Out = a5_23;
		mstatusOut = mstatus;
		return s0;
	}
	goto l23070AB6;
}

// 23070AE8: Register Eq_2 raw_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack word32 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out Eq_405329 a4Out, Register out (ptr32 Eq_405330) a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_send
Eq_2 raw_send(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a5, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, word32 dwArg38, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & a0Out, union Eq_405329 & a4Out, struct Eq_405330 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	Eq_405329 a4_18;
	struct Eq_405330 * a5_19;
	ptr32 mstatus_22;
	Eq_2 s0_24 = raw_sendto(ra, a0, a1, (word32) a0 + 4, a5, s4, s5, s6, s7, mstatus, dwArg04, dwArg24, dwArg38, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out a0_14, out a4_18, out a5_19, out mstatus_22);
	a0Out = a0_14;
	a4Out = a4_18;
	a5Out = a5_19;
	mstatusOut = mstatus_22;
	return s0_24;
}

