pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23070AF0: Register Eq_2 raw_remove(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a3Out, Register out (ptr32 byte) a4Out, Register out (ptr32 Eq_405352) a5Out)
// Called from:
//      lwip_netconn_do_delconn
Eq_2 raw_remove(Eq_2 a0, Eq_2 a3, Eq_2 a5, ptr32 mstatus, ptr32 & a3Out, byte & a4Out, struct Eq_405352 & a5Out)
{
	Eq_2 a4_6 = *a5;
	Eq_2 a1_15 = a0;
	if (a5 == a0)
		*a5 = a4_6;
	else
	{
		while (a5 != 0x00)
		{
			Eq_2 a5_12 = *((word32) a4_6 + 0x0C);
			if (a4_6 == 0x00)
				break;
			if (a4_6 == a0)
			{
				a1_15 = *((word32) a4_6 + 0x0C);
				*((word32) a4_6 + 0x0C) = a5_12;
				break;
			}
			a5 = a4_6;
		}
	}
	word32 a2_40;
	struct Eq_405352 * a5_28;
	Eq_2 a0_29;
	ptr32 a3_31;
	byte * a4_32;
	memp_free(0x00, a1_15, a3, a4_6, mstatus, out a0_29, out a2_40, out a3_31, out a4_32, out a5_28);
	a3Out = a3_31;
	a4Out = a4_32;
	a5Out = a5_28;
	return a0_29;
}

// 23070B1C: Register Eq_2 raw_new(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out (ptr32 Eq_405397) a4Out, Register out ptr32 a5Out)
// Called from:
//      raw_new_ip_type
Eq_2 raw_new(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, struct Eq_405397 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_16;
	word32 a2_73;
	word32 a3_74;
	struct Eq_405397 * a4_20;
	ptr32 a5_17;
	Eq_2 s1_21 = memp_malloc(a0, 0x00, a3, a4, mstatus, out a0_16, out a2_73, out a3_74, out a4_20, out a5_17);
	if (a0_16 != 0x00)
	{
		word32 t1_75;
		word32 a0_76;
		word32 a1_77;
		word32 a2_78;
		word32 a3_79;
		word32 a5_80;
		memset(ra, a0_16, 0x00, 0x1C, out t1_75, out a0_76, out a1_77, out a2_78, out a3_79, out a4_20, out a5_80);
		*((word32) a0_16 + 11) = ~0x00;
		*((word32) a0_16 + 19) = ~0x00;
		a5_17 = a4_20->ptr0000;
		*((word32) a0_16 + 16) = (byte) s1_21;
		*a0_16 = a5_17;
		a4_20->t000C = a0_16;
	}
	a2Out = dwArg10;
	a4Out = a4_20;
	a5Out = a5_17;
	return s1_21;
}

// 23070B60: Register word32 raw_new_ip_type(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out (ptr32 Eq_405463) a5Out)
// Called from:
//      lwip_netconn_do_newconn
word32 raw_new_ip_type(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a4Out, struct Eq_405463 & a5Out)
{
	ptr32 a2_9;
	ptr32 a4_11;
	struct Eq_405463 * a5_12;
	word32 s1_13 = raw_new(ra, a1, a3, a4, mstatus, out a2_9, out a4_11, out a5_12);
	a0Out = a1;
	a2Out = a2_9;
	a4Out = a4_11;
	a5Out = a5_12;
	return s1_13;
}

// 23070B66: void raw_netif_ip_addr_changed(Register word32 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5)
// Called from:
//      netif_do_set_ipaddr
//      netif_remove
void raw_netif_ip_addr_changed(word32 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, word32 a5)
{
	if (a0 != 0x00 && (a5 != 0x00 && (a1 != 0x00 && a5 != 0x00)))
	{
		struct Eq_399547 * a5_10 = g_ptr4200F65C;
		while (a5_10 != null)
		{
			struct Eq_405485 * a5_14 = *a3;
			if (a3 == a4)
				*a4 = a5_14;
			a5_10 = a5_14->ptr000C;
		}
	}
}

// 23070B8E: void stats_init()
// Called from:
//      lwip_init
void stats_init()
{
}

// 23070B90: Register word32 tcp_new_port(Register Eq_2 a2, Register out Eq_2 a3Out, Register out Eq_2 a5Out)
// Called from:
//      altcp_tcp_connect
//      altcp_tcp_bind
word32 tcp_new_port(Eq_2 a2, union Eq_2 & a3Out, union Eq_2 & a5Out)
{
	word32 a5_11 = (word32) g_w4200ECC0;
	word32 a0_34 = 0x04000000;
l23070BA6:
	a5_11 = (word32) (word16) (a5_11 + 0x01);
	if (a5_11 == 0x0FFFFFFF)
		a5_11 = 0x0C000000;
	do
	{
		Eq_2 a3_23 = *a2;
		a2 = *a2;
		while (a2 != 0x00)
		{
			if ((word32) *((word32) a2 + 22) == a5_11)
			{
				a0_34 = (word32) (word16) (a0_34 + ~0x00);
				if (a0_34 != 0x00)
					goto l23070BA6;
				g_w4200ECC0 = (word16) a5_11;
				a3Out = a3_23;
				a5Out.u0 = <invalid>;
				return a0_34;
			}
			a2 = *((word32) a2 + 0x0C);
		}
	} while (a3_23 != 0xDCF3C890);
	g_w4200ECC0 = (word16) a5_11;
	a3Out = (word32) a3_23 + 4;
	a5Out.u0 = <invalid>;
	return a5_11;
}

// 23070BE8: Register Eq_2 tcp_close_shutdown_fin(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out (ptr32 Eq_405573) a0Out, Register out (ptr32 Eq_405574) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_405577) a4Out, Register out (ptr32 Eq_405573) a5Out, Register out (ptr32 byte) s2Out, Register out (ptr32 Eq_405580) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_new_ip_type
//      tcp_close
//      tcp_fasttmr
Eq_2 tcp_close_shutdown_fin(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s1Out, struct Eq_405573 & a0Out, struct Eq_405574 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_405577 & a4Out, struct Eq_405573 & a5Out, byte & s2Out, struct Eq_405580 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a2_17;
	Eq_2 s0_29;
	word32 a5_42;
	struct Eq_405577 * a4_102 = (word32) *((word32) a0 + 20);
	struct Eq_405573 * a5_10 = (struct Eq_405573 *) 0x04;
	if (a4_102 != (struct Eq_405577 *) 0x04)
	{
		if (a4_102 == (struct Eq_405577 *) 0x07)
		{
			struct Eq_405573 * a0_16;
			ra = tcp_send_fin(ra, s1, a3, (struct Eq_405573 *) 0x07, mstatus, dwArg14, dwArg28, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_29, out s1, out a0_16, out a1, out a2_17, out a3, out s2, out s3, out s4, out s5, out s6, out s8, out mstatus);
			a5_10 = a0_16;
			if (a0_16 == null)
			{
				a5_42 = 0x09;
l23070C12:
				*((word32) s0_29 + 20) = (byte) a5_42;
				word32 s0_315;
				word32 a0_316;
				word32 a2_317;
				word32 a5_318;
				ra = tcp_output(ra, s1, s0_29, a2_17, s7, mstatus, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArgFC, dwArg0108, out s0_315, out s1, out a0_316, out a1, out a2_317, out a3, out a4_102, out a5_318, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
				goto l23070C1C;
			}
l23070C34:
			a4_102 = (struct Eq_405577 *) ~0x00;
			if (a5_10 != (struct Eq_405573 *) ~0x00)
				goto l23070C1E;
			*((word32) s0_29 + 26) = (word16) ((word32) *((word32) s0_29 + 26) | 8);
l23070C1C:
			a5_10 = null;
l23070C1E:
			s1Out = s1;
			a0Out = a5_10;
			a1Out = a1;
			a2Out = dwArg10;
			a3Out = a3;
			a4Out = a4_102;
			a5Out = a5_10;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
		a3.u0 = 0x03;
		a5_10 = null;
		if (a4_102 != (struct Eq_405577 *) 0x03)
			goto l23070C1E;
	}
	struct Eq_405573 * a0_52;
	ra = tcp_send_fin(ra, s1, a3, a5_10, mstatus, dwArg14, dwArg28, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_29, out s1, out a0_52, out a1, out a2_17, out a3, out s2, out s3, out s4, out s5, out s6, out s8, out mstatus);
	a5_10 = a0_52;
	if (a0_52 == null)
	{
		a5_42 = 0x05;
		goto l23070C12;
	}
	goto l23070C34;
}

// 23070C48: Register Eq_2 tcp_init(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_64398) a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      lwip_init
Eq_2 tcp_init(Eq_2 ra, Eq_2 a0, struct Eq_64398 * a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out)
{
	word32 a0_8;
	Eq_2 a3_10;
	word32 a1_63;
	word32 a2_64;
	word32 a4_65;
	word32 a5_66;
	word32 s4_67;
	word32 s8_68;
	bl_rand(a0, a2, out a0_8, out a1_63, out a2_64, out a3_10, out a4_65, out a5_66, out s4_67, out s8_68);
	g_w4200FCC0 = (word16) (word32) (word16) ((word32) (word14) a0_8 + 0xFC000000);
	ptr32 a0_31;
	ptr32 a3_36;
	ptr32 s1_40;
	word32 a1_69;
	word32 a2_70;
	word32 a4_71;
	word32 a5_72;
	word32 a7_73;
	word32 s2_74;
	word32 s3_75;
	word32 s4_76;
	word32 s5_77;
	word32 s6_78;
	word32 s7_79;
	word32 s8_80;
	word32 s9_81;
	word32 s10_82;
	word32 s11_83;
	word32 t4_84;
	Eq_2 ra_39 = printf(ra, &g_t230C3734, a3_10, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_40, out a0_31, out a1_69, out a2_70, out a3_36, out a4_71, out a5_72, out a7_73, out s2_74, out s3_75, out s4_76, out s5_77, out s6_78, out s7_79, out s8_80, out s9_81, out s10_82, out s11_83, out t4_84);
	s1Out = s1_40;
	a0Out = a0_31;
	a3Out = a3_36;
	return ra_39;
}

// 23070C76: Register Eq_2 tcp_free(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_405844) a0Out, Register out Eq_2 a1Out, Register out Eq_405846 a2Out, Register out Eq_405847 a3Out, Register out Eq_405848 a4Out, Register out ptr32 a5Out)
// Called from:
//      tcp_listen_with_backlog_and_err
//      tcp_abort
//      tcp_close
//      tcp_tmr
//      tcp_input_delayed_close
//      tcp_input
Eq_2 tcp_free(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_405733 & a0Out, union Eq_2 & a1Out, union Eq_405846 & a2Out, union Eq_405847 & a3Out, union Eq_405847 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_9;
	struct Eq_405733 * a0_10;
	Eq_405846 a2_11;
	Eq_405847 a3_12;
	Eq_405848 a4_13;
	Eq_2 s1_14 = memp_free(0x02, a0, a3, a4, mstatus, out a0_10, out a2_11, out a3_12, out a4_13, out a5_9);
	a0Out = a0_10;
	a1Out = a0;
	a2Out = a2_11;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_9;
	return s1_14;
}

// 23070C7E: Register Eq_2 tcp_bind(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44, Register out Eq_2 a4Out)
// Called from:
//      lwip_netconn_do_bind
//      altcp_tcp_bind
Eq_2 tcp_bind(Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg44, union Eq_2 & a4Out)
{
	if (a1 == 0x00)
		a1.u0 = 588036828;
	Eq_2 a0_128 = ~0x0F;
	if (a0 != 0x00)
	{
		a4 = (word32) *((word32) a0 + 20);
		a0_128.u0 = ~0x05;
		if (a4 != 0x00)
			goto l23070CB8;
		ui32 a3_18 = (word32) *((word32) a0 + 9);
		Eq_2 a3_110 = a3_18 & 0x04;
		word32 a6_20 = (word32) ((a3_18 & 0x04) < 1);
		if (a2 == 0x00)
		{
			tcp_new_port(a2, out a3_110, out a5);
			a2 = dwArg44;
			a0_128.u0 = ~0x01;
			if (dwArg44 == 0x00)
				goto l23070CB8;
		}
		else
		{
			word32 a0_26 = 0x00;
			do
			{
				a4 = *a5;
				a5 = *a5;
				while (a5 != 0x00)
				{
					if ((word32) *((word32) a5 + 22) == a2 && ((a3_18 & 0x04) == 0x00 || ((word32) (*((word32) a5 + 9)) & 4) == 0x00))
					{
						Eq_2 t1_40 = *a5;
						if (t1_40 != 0x00)
						{
							Eq_2 a7_43 = *a1.u0;
							if (a7_43 != 0x00 && t1_40 != a7_43)
								goto l23070D22;
						}
						a0_128.u0 = ~0x07;
						goto l23070CB8;
					}
l23070D22:
					a5 = *((word32) a5 + 0x0C);
				}
				++a0_26;
			} while (a6_20 + 0x03 != a0_26);
		}
		if (a5 != 0x00)
			*a5 = a0;
		Eq_2 a4_86 = g_t42026908;
		*((word32) a0 + 22) = (word16) a2;
		g_t42027908 = a0;
		*((word32) a4_86 + 0x0C) = a0;
		word32 a0_233;
		word32 a3_235;
		word32 a2_234;
		word32 s1_232;
		word32 s8_236;
		tcp_timer_needed(s1, a3_110, mstatus, dwArg24, out s1_232, out a0_233, out a2_234, out a3_235, out a4, out s8_236);
		a0_128.u0 = 0x00;
	}
l23070CB8:
	a4Out = a4;
	return a0_128;
}

// 23070D2A: Register ui32 tcp_bind_netif(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_setsockopt_callback
ui32 tcp_bind_netif(Eq_2 a0, Eq_2 a1)
{
	ui32 a5_3 = 0x00;
	if (a1 != 0x00)
		a5_3 = (word32) *((word32) a1 + 0x0044) + 0x01 & 0x00FF;
	*((word32) a0 + 8) = (byte) a5_3;
	return a5_3;
}

// 23070D3E: Register Eq_2 tcp_listen_with_backlog_and_err(Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      lwip_netconn_do_listen
//      altcp_tcp_listen
Eq_2 tcp_listen_with_backlog_and_err(Eq_2 s1, Eq_2 a0, byte * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg38, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	Eq_2 s1_132;
	ptr32 a5_136;
	if (a0 != 0x00)
	{
		Eq_2 s0_161 = a0;
		if ((word32) *((word32) a0 + 20) == 0x00)
		{
			if (((word32) *((word32) a0 + 9) & 0x04) != 0x00)
			{
				Eq_2 a5_23 = g_t42026900;
				while (a5_23 != 0x00)
				{
					a3 = (word32) *((word32) a5_23 + 22);
					a4 = (word32) *((word32) s0_161 + 22);
					if (a3 == a4)
					{
						a5_23 = *a3;
						s0_161 = *a4.u0;
						if (a3 == a4)
						{
							a5_136 = ~0x07;
							goto l23070E32;
						}
					}
					a5_23 = *((word32) a5_23 + 0x0C);
				}
			}
			word32 a5_246;
			Eq_2 a0_52;
			word32 a2_245;
			memp_malloc(s1, 0x03, a3, a4, mstatus, out a0_52, out a2_245, out a3, out a4, out a5_246);
			s1_132 = a0_52;
			a5_136 = ~0x00;
			if (a0_52 != 0x00)
			{
				Eq_2 s0_62 = *(union Eq_2 *) 0x0F;
				*(union Eq_2 *) 0x0F = a0_52;
				*((word32) a0_52 + 22) = (word16) (word32) *((word32) s0_62 + 22);
				*((word32) a0_52 + 20) = 0x01;
				*((word32) a0_52 + 21) = (byte) (word32) *((word32) s0_62 + 21);
				word32 a5_70 = (word32) *((word32) s0_62 + 9);
				*((word32) a0_52 + 8) = 0x00;
				*((word32) a0_52 + 9) = (byte) a5_70;
				*((word32) a0_52 + 11) = (byte) (word32) *((word32) s0_62 + 11);
				union Eq_2 * a5_75 = (word32) *((word32) s0_62 + 0x0A);
				*((word32) a0_52 + 0x0A) = (byte) a5_75;
				Eq_2 s0_77 = *a5_75;
				*a5_75 = (union Eq_2 *) a0_52;
				if ((word32) *((word32) s0_77 + 22) != 0x00)
				{
					a4.u0 = 0x42027000;
					Eq_2 a5_81 = g_t42026908;
					if (a5_81 == s0_77)
					{
						s0_77 = *((word32) a5_81 + 0x0C);
						g_t42027908 = a5_81;
					}
					else
					{
						while (a5_81 != 0x00)
						{
							Eq_2 a5_85 = g_t4202700C;
							if (s0_77 == 0x42027000)
							{
								s0_77 = g_t4202700C;
								g_t4202700C = a5_85;
								break;
							}
							a5_81.u0 = 0x42027000;
						}
					}
					*((word32) s0_77 + 0x0C) = 0x00;
				}
				word32 a5_251;
				word32 a1_248;
				word32 a4_250;
				word32 a0_247;
				Eq_2 a3_107;
				word32 a2_249;
				Eq_2 s1_110 = tcp_free(s0_77, a3, a4, mstatus, out a0_247, out a1_248, out a2_249, out a3_107, out a4_250, out a5_251);
				g_t23071396 = s1_110;
				Eq_2 a4_116 = g_t42026900;
				g_t42027900 = s1_110;
				*((word32) a4_116 + 0x0C) = s1_110;
				word32 a0_252;
				word32 a2_253;
				word32 s8_254;
				tcp_timer_needed(s1_110, a3_107, mstatus, dwArg34, out s1_132, out a0_252, out a2_253, out a3, out a4, out s8_254);
				a5_136 = 0x00;
			}
		}
		else
		{
			a5_136 = ~0x0E;
l23070E32:
			s1_132.u0 = 0x00;
		}
	}
	else
	{
		s1_132.u0 = 0x00;
		a5_136 = ~0x0F;
	}
	if (a2 != null)
		*a2 = (byte) a5_136;
	0x00 = (int8) dwArg38;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_136;
	return s1_132;
}

