pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23070E3A: Register Eq_2 tcp_update_rcv_ann_wnd(Register Eq_2 a0, Register (ptr32 Eq_406233) a2, Register Eq_2 a3, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_406237 a4Out, Register out Eq_2 a5Out)
// Called from:
//      tcp_receive
//      altcp_tcp_recved
Eq_2 tcp_update_rcv_ann_wnd(Eq_2 a0, struct Eq_406233 * a2, Eq_2 a3, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_406237 & a4Out, union Eq_2 & a5Out)
{
	word32 a1_6 = (word32) *((word32) a0 + 40);
	Eq_406244 a4_11 = (word32) *((word32) a0 + 50);
	Eq_2 a0_14 = a2 + (a1_6 - a3) / 20;
	if (a4_11 > 0x0408)
		a4_11.u0 = 0x0408;
	Eq_406237 a4_20 = a0_14 - (word32) ((word16) a4_11);
	if (a4_20 < 0x00)
	{
		Eq_406237 a4_23 = a2 - a3;
		if (a4_23 > 0x00)
			((word32) a0 + 42)->u2 = 0x00;
		else
		{
			a3 -= a2;
			*((word32) a0 + 42) = (word16) a3;
		}
		a1Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4_23;
		a5Out.u0 = <invalid>;
		return 0x00;
	}
	else
	{
		*((word32) a0 + 42) = (word16) a1_6;
		a1Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4_20;
		a5Out.u0 = <invalid>;
		return a0_14;
	}
}

// 23070E84: Register Eq_2 tcp_recved(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_406304) a4Out, Register out (ptr32 byte) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_recv_null
//      recv_tcp
//      lwip_netconn_do_recv
//      altcp_tcp_recved
Eq_2 tcp_recved(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, struct Eq_406304 & a4Out, byte & a5Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_406304 * a4_9 = (word32) *((word32) a0 + 40);
		struct Eq_406304 * a1_15 = (word32) (word16) (a4_9 + a1 / 8);
		if (a1_15 > (struct Eq_406304 *) 0x00FFF810 || a1_15 < a4_9)
			a1_15 = (struct Eq_406304 *) 0x00FFF810;
		((word32) a0 + 40)->u2 = (word16) a1_15;
		word32 a5_233;
		word32 a3_231;
		word32 a4_232;
		word32 a1_230;
		tcp_update_rcv_ann_wnd(a0, a2, a3, out a1_230, out a3_231, out a4_232, out a5_233);
		if (a0 <= 1031)
		{
			s0Out = s0;
			s1Out = s1;
			a0Out = a0;
			a3Out = a3;
			a4Out = a4_9;
			a5Out = (byte *) 1031;
			s3Out = s3;
			s4Out = s4;
			s7Out = s7;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			*((word32) a0 + 26) = (word16) ((word32) *((word32) a0 + 26) | 2);
			Eq_2 a0_47;
			byte * a5_48;
			Eq_2 a3_50;
			struct Eq_406304 * a4_51;
			ptr32 s0_54;
			Eq_2 s1_55;
			ptr32 s4_57;
			ptr32 s10_64;
			ptr32 s11_65;
			ptr32 s3_66;
			Eq_2 s7_67;
			ptr32 s9_68;
			ptr32 mstatus_75;
			word32 s8_239;
			word32 s5_237;
			word32 s6_238;
			word32 a2_235;
			word32 s2_236;
			word32 a1_234;
			Eq_2 ra_53 = tcp_output(ra, s1, a0, dwArg10, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_54, out s1_55, out a0_47, out a1_234, out a2_235, out a3_50, out a4_51, out a5_48, out s2_236, out s3_66, out s4_57, out s5_237, out s6_238, out s7_67, out s8_239, out s9_68, out s10_64, out s11_65, out mstatus_75);
			s0Out = s0_54;
			s1Out = s1_55;
			a0Out = a0_47;
			a3Out = a3_50;
			a4Out = a4_51;
			a5Out = a5_48;
			s3Out = s3_66;
			s4Out = s4_57;
			s7Out = s7_67;
			s9Out = s9_68;
			s10Out = s10_64;
			s11Out = s11_65;
			mstatusOut = mstatus_75;
			return ra_53;
		}
	}
}

// 23070EDA: Register Eq_2 tcp_seg_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0108, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_406417) a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_406420) a5Out)
// Called from:
//      tcp_segs_free
//      tcp_oos_insert_segment
//      tcp_free_acked_segments.isra.3
//      tcp_receive
//      tcp_input
//      tcp_create_segment
//      tcp_output
Eq_2 tcp_seg_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0108, union Eq_2 & a0Out, union Eq_2 & a1Out, struct Eq_406417 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_406420 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a1_21 = a0;
		Eq_2 a0_6 = *((word32) a0 + 4);
		if (a0_6 != 0x00)
		{
			word32 s0_130;
			word32 s1_131;
			word32 a0_132;
			word32 a2_133;
			word32 a5_134;
			word32 a7_135;
			word32 s2_136;
			word32 s3_137;
			word32 s4_138;
			word32 s5_139;
			word32 s6_140;
			word32 s8_141;
			pbuf_free(ra, a0_6, a3, a4, s4, mstatus, dwArg0108, out s0_130, out s1_131, out a0_132, out a1_21, out a2_133, out a3, out a4, out a5_134, out a7_135, out s2_136, out s3_137, out s4_138, out s5_139, out s6_140, out s8_141, out mstatus);
		}
		struct Eq_406420 * a5_50;
		Eq_2 a0_51;
		struct Eq_406417 * a2_52;
		Eq_2 a3_53;
		Eq_2 a4_54;
		Eq_2 s1_55 = memp_free(0x04, a1_21, a3, a4, mstatus, out a0_51, out a2_52, out a3_53, out a4_54, out a5_50);
		a0Out = a0_51;
		a1Out = a1_21;
		a2Out = a2_52;
		a3Out = a3_53;
		a4Out = a4_54;
		a5Out = a5_50;
		return s1_55;
	}
}

// 23070EFE: Register Eq_2 tcp_segs_free(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_406490) a5Out)
// Called from:
//      tcp_free_ooseq
//      tcp_pcb_purge
//      tcp_abort
//      tcp_oos_insert_segment
//      altcp_tcp_write
Eq_2 tcp_segs_free(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgF8, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_406490 & a5Out)
{
	if (a0 != 0x00)
	{
		do
		{
			ptr32 a1_19;
			struct Eq_406490 * a5_23;
			word32 a0_61;
			word32 a2_62;
			Eq_2 s1_24 = tcp_seg_free(ra, *s0, a3, a4, s4, mstatus, dwArgF8, out a0_61, out a1_19, out a2_62, out a3, out a4, out a5_23);
		} while (s0 != 0x00);
		a0Out = s0;
		a1Out = a1_19;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_23;
		return s1_24;
	}
	else
	{
		a0Out = a0;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
}

// 23070F1A: void tcp_setprio(Register (ptr32 Eq_406514) a0, Register word32 a1)
// Called from:
//      altcp_tcp_setprio
void tcp_setprio(struct Eq_406514 * a0, word32 a1)
{
	if (a0 != null)
		a0->b0015 = (byte) a1;
}

// 23070F22: Register Eq_2 tcp_seg_copy(Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      tcp_receive
Eq_2 tcp_seg_copy(Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_15;
	word32 a2_86;
	ptr32 a3_18;
	ptr32 a4_19;
	ptr32 a5_16;
	Eq_2 s1_20 = memp_malloc(s1, 0x04, a3, a4, mstatus, out a0_15, out a2_86, out a3_18, out a4_19, out a5_16);
	Eq_2 s0_22 = a0_15;
	if (a0_15 != 0x00)
	{
		Eq_2 a4_26;
		Eq_2 a3_31;
		word32 a1_87;
		word32 a2_88;
		word32 a5_89;
		word32 a6_90;
		word32 a7_91;
		memcpy(a0_15, a1, 0x14, out a1_87, out a2_88, out a3_31, out a4_26, out a5_89, out a6_90, out a7_91);
		s0_22 = *((word32) a0_15 + 4);
		pbuf_ref(a0_15, a3_31, a4_26, mstatus, out a3_18, out a4_19, out a5_16);
	}
	s1Out = s1_20;
	a0Out = s0_22;
	a3Out = a3_18;
	a4Out = a4_19;
	a5Out = a5_16;
	return s0_22;
}

// 23070F4C: void tcp_arg(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      setup_tcp
//      accept_function
//      lwip_netconn_do_listen
//      lwip_netconn_do_close
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
void tcp_arg(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a1 + 16) = a0;
}

// 23070F52: void tcp_recv(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
void tcp_recv(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a0 + 0x0084) = a1;
}

// 23070F5A: void tcp_sent(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
void tcp_sent(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a0 + 0x0080) = a1;
}

// 23070F62: void tcp_err(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
void tcp_err(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a0 + 144) = a1;
}

// 23070F6A: Register word32 tcp_accept(Register Eq_2 a0, Register (ptr32 Eq_406605) a1)
// Called from:
//      lwip_netconn_do_listen
//      lwip_netconn_do_close
//      altcp_tcp_listen
word32 tcp_accept(Eq_2 a0, struct Eq_406605 * a1)
{
	if (a0 != 0x00)
	{
		a4 = (word32) *((word32) a0 + 20);
		if (a4 == 0x01)
			a1->t0018 = a0;
	}
	return a4;
}

// 23070F7A: void tcp_poll(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
//      altcp_tcp_close
//      altcp_tcp_set_poll
void tcp_poll(Eq_2 a0, Eq_2 a1, Eq_2 a2)
{
	if (a0 != 0x00)
	{
		*((word32) a0 + 0x008C) = a1;
		*((word32) a0 + 29) = (byte) a2;
	}
}

// 23070F86: Register Eq_2 tcp_next_iss(Register Eq_2 a0)
// Called from:
//      tcp_input
//      altcp_tcp_connect
Eq_2 tcp_next_iss(Eq_2 a0)
{
	word32 a0_9 = a0 + Mem0[1107454204:int32];
	*a0_9 = *a0;
	return a0_9;
}

// 23070F9E: Register (ptr32 int32) tcp_eff_send_mss_netif(Register (ptr32 int32) a0, Register Eq_2 a1, Register out Eq_406642 a3Out)
// Called from:
//      tcp_input
//      tcp_output
//      altcp_tcp_connect
int32 * tcp_eff_send_mss_netif(int32 * a0, Eq_2 a1, union Eq_406642 & a3Out)
{
	if (a1 != 0x00)
	{
		Eq_406646 a5_5 = (word32) *((word32) a1 + 56);
		if (a5_5 != 0x00)
		{
			a3.u0 = 40;
			int32 * a4_11 = null;
			if (a5_5 > 40)
			{
				uint32 a5_9 = (word32) a5_5.u1 - 40 << 16;
				a4_11 = a5_9 >> 16;
				if (a0 < a5_9 >> 16)
					a4_11 = a0;
			}
			a0 = (word32) (word16) a4_11;
		}
	}
	a3Out = a3;
	return a0;
}

