pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23070FC8: Register Eq_2 tcp_connect(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_connect
//      altcp_tcp_connect
Eq_2 tcp_connect(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_104 = ~0x0F;
	if (a0 != 0x00 && a1 != 0x00)
	{
		a5 = (word32) *((word32) a0 + 20);
		s1_104.u0 = ~0x09;
		if (a5 != 0x00)
			goto l23071024;
		Eq_2 a3_310;
		Eq_2 a2_40;
		Eq_2 a0_36;
		Eq_2 a1_25 = *a5;
		*((word32) a5 + 4) = a0;
		*((word32) a0 + 24) = (word16) a2;
		Eq_2 a0_32 = (word32) *((word32) a0 + 8);
		if (a0_32 != 0x00)
		{
			a0_36 = netif_get_by_index(a0_32, out a4, out a5);
			a2_40 = a2;
			a3_310 = a3;
		}
		else
			a0_36 = ip4_route(a2, a5, out a2_40, out a3_310, out a4, out a5);
		s1_104.u0 = ~0x03;
		if (a0_36 != 0x00)
		{
			Eq_2 s0_105 = *a5;
			if (a5 == 0x00)
				*a5 = s0_105;
			word32 s5_54 = (word32) *((word32) s0_105 + 22);
			if (s5_54 == 0x00)
			{
				word32 a3_664;
				word32 a0_94 = tcp_new_port(a2_40, out a3_664, out a5);
				((word32) s0_105 + 22)->u2 = (word16) a0_94;
				s1_104.u0 = ~0x01;
				if (a0_94 == 0x00)
					goto l23071024;
			}
			else if (((word32) *((word32) s0_105 + 9) & 0x04) != 0x00)
			{
				a5 = g_t42026904;
				while (a5 != 0x00)
				{
					if ((word32) *((word32) a5 + 22) == s5_54)
					{
						Eq_2 a4_80 = (word32) *((word32) a5 + 24);
						if (a4_80 == a2)
						{
							a5 = *a3_310;
							s0_105 = *a4_80;
							if (a3_310 == a4_80)
							{
								a5 = *((word32) a3_310 + 4);
								a4 = *a1_25;
								if (a3_310 == a4)
								{
l2307107C:
									s1_104.u0 = ~0x07;
									goto l23071024;
								}
							}
						}
					}
					a5 = *((word32) a5 + 0x0C);
				}
				a5 = g_t420268F8;
				while (a5 != 0x00)
				{
					if ((word32) *((word32) a5 + 22) == s5_54)
					{
						Eq_2 a4_67 = (word32) *((word32) a5 + 24);
						if (a4_67 == a2)
						{
							a5 = *a3_310;
							s0_105 = *a4_67;
							if (a3_310 == a4_67)
							{
								a5 = *((word32) a3_310 + 4);
								a4 = *a1_25;
								if (a3_310 == a4)
									goto l2307107C;
							}
						}
					}
					a5 = *((word32) a5 + 0x0C);
				}
			}
			struct Eq_406773 * a0_111 = tcp_next_iss(s0_105);
			*(union Eq_2 *) 0x08100838 = s0_105;
			a0_111->t0050 = s0_105;
			((word32) s0_105 + 96)->u2 = 0xF810;
			a0_111->t0043 = s0_105;
			a0_111->t0057 = s0_105;
			a0_111->t005B = s0_105;
			((word32) s0_105 + 50)->u2 = 0x0218;
			((word32) s0_105 + 36)->u0 = 0x00;
			((word32) s0_105 + 44)->u0 = 0x00;
			Eq_2 a3_140;
			*((word32) s0_105 + 50) = (word16) tcp_eff_send_mss_netif((int32 *) 536, a0_36, out a3_140);
			((word32) s0_105 + 72)->u0 = 0x01;
			*((word32) s0_105 + 0x0088) = a3;
			Eq_2 a0_177;
			Eq_2 a3_180;
			word32 s5_192;
			word32 a1_666;
			word32 s4_670;
			word32 s1_665;
			word32 a2_667;
			word32 s2_668;
			word32 s3_669;
			word32 s6_671;
			word32 s8_672;
			Eq_2 s0_187;
			Eq_2 ra_186 = tcp_enqueue_flags(ra, s0_105, 0x02, a3_140, mstatus, dwArg04, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_187, out s1_665, out a0_177, out a1_666, out a2_667, out a3_180, out a4, out a5, out s2_668, out s3_669, out s4_670, out s5_192, out s6_671, out s8_672, out mstatus);
			s1_104 = a0_177;
			if (a0_177 == 0x00)
			{
				*((word32) s0_187 + 20) = 0x02;
				if (s5_192 != 0x00)
				{
					Eq_2 a5_206 = g_t42026908;
					if (a5_206 == s0_187)
					{
						s0_187 = *((word32) a5_206 + 0x0C);
						g_t42027908 = a5_206;
					}
					else
					{
						while (a5_206 != 0x00)
						{
							Eq_2 a5_210 = g_t4202700C;
							if (s0_187 == 0x42027000)
							{
								s0_187 = g_t4202700C;
								g_t4202700C = a5_210;
								break;
							}
							a5_206.u0 = 0x42027000;
						}
					}
				}
				Eq_2 a4_219 = g_t42026904;
				g_t42027904 = s0_187;
				*((word32) a4_219 + 0x0C) = s0_187;
				Eq_2 a2_235;
				Eq_2 s1_238;
				word32 a3_674;
				word32 a4_675;
				word32 s8_676;
				word32 a0_673;
				Eq_2 s0_237 = tcp_timer_needed(a0_177, a3_180, mstatus, dwArg24, out s1_238, out a0_673, out a2_235, out a3_674, out a4_675, out s8_676);
				g_b4202790C = 0x01;
				word32 a0_678;
				word32 a1_679;
				word32 s0_677;
				word32 s6_686;
				word32 a3_681;
				word32 s2_682;
				word32 a2_680;
				word32 s5_685;
				word32 s4_684;
				word32 s3_683;
				word32 s8_688;
				word32 s9_689;
				word32 s10_690;
				word32 s11_691;
				word32 s7_687;
				tcp_output(ra_186, s1_238, s0_237, a2_235, s7, mstatus, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s0_677, out s1_104, out a0_678, out a1_679, out a2_680, out a3_681, out a4, out a5, out s2_682, out s3_683, out s4_684, out s5_685, out s6_686, out s7_687, out s8_688, out s9_689, out s10_690, out s11_691, out mstatus);
			}
		}
	}
l23071024:
	0x00 = (int8) dwArgA8;
	s1Out = s1_104;
	a0Out = s1_104;
	a4Out = a4;
	a5Out = a5;
	mstatusOut = mstatus;
	return s1;
}

// 2307115C: void tcp_tcp_get_tcp_addrinfo(Register (ptr32 Eq_407055) a0, Register word32 a1, Register (ptr32 Eq_407055) a2, Register (ptr32 word16) a3, Register (ptr32 Eq_407059) a5)
// Called from:
//      altcp_tcp_get_tcp_addrinfo
void tcp_tcp_get_tcp_addrinfo(struct Eq_407055 * a0, word32 a1, struct Eq_407055 * a2, word16 * a3, struct Eq_407059 * a5)
{
	if (a0 == null)
		return;
	word32 a5_15;
	if (a1 != 0x00)
	{
		if (a2 != null)
		{
			a0 = a5->ptr0000;
			a5->ptr0000 = a2;
		}
		if (a3 == null)
			return;
		a5_15 = (word32) a0->w0016;
	}
	else
	{
		if (a2 != null)
		{
			a0 = a5->ptr0004;
			a5->ptr0000 = a2;
		}
		if (a3 == null)
			return;
		a5_15 = (word32) a0->w0018;
	}
	*a3 = (word16) a5_15;
}

