pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23071188: Register Eq_2 tcp_free_ooseq(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Register out Eq_2 a0Out, Register out Eq_403145 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      pbuf_free_ooseq_callback
//      tcp_pcb_purge
//      tcp_tmr
Eq_2 tcp_free_ooseq(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgE8, union Eq_2 & a0Out, union Eq_403145 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	Eq_2 a0_5 = *((word32) a5 + 116);
	if (a5 == 0x00)
	{
		a0Out = a0_5;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		return s1;
	}
	else
	{
		Eq_2 a0_17;
		Eq_2 a3_20;
		Eq_2 a4_21;
		word32 a1_51;
		word32 a5_52;
		Eq_2 s1_23 = tcp_segs_free(ra, a0_5, a5, a3, a4, s4, mstatus, dwArgE8, out a0_17, out a1_51, out a3_20, out a4_21, out a5_52);
		((word32) a0_5 + 116)->u0 = 0x00;
		a0Out = a0_17;
		a2Out = dwArg10;
		a3Out = a3_20;
		a4Out = a4_21;
		return s1_23;
	}
}

// 230711A8: Register Eq_2 tcp_pcb_purge(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      tcp_pcb_remove
//      tcp_close
//      tcp_tmr
//      tcp_input
Eq_2 tcp_pcb_purge(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		a5 = (word32) *((word32) a0 + 20);
		a4.u0 = 0x01;
		if (a5 > 0x01)
		{
			a4.u0 = 0x0A;
			if (a5 != 0x0A)
			{
				Eq_2 a0_14 = *((word32) a0 + 0x0078);
				if (a0_14 != 0x00)
				{
					struct Eq_407163 * s0_20;
					word32 s8_221;
					word32 s6_220;
					word32 s5_219;
					word32 s3_218;
					word32 s2_217;
					word32 a7_216;
					word32 a2_215;
					word32 a1_214;
					word32 s1_213;
					ra = pbuf_free(ra, a0_14, a3, 0x0A, s4, mstatus, dwArg0118, out s0_20, out s1_213, out a0_14, out a1_214, out a2_215, out a3, out a4, out a5, out a7_216, out s2_217, out s3_218, out s4, out s5_219, out s6_220, out s8_221, out mstatus);
					s0_20->dw0078 = 0x00;
				}
				if (a5 != 0x00)
				{
					word32 a2_224;
					tcp_free_ooseq(ra, a3, a4, a5, s4, mstatus, dwArgD8, out a0_14, out a2_224, out a3, out a4);
				}
				Eq_2 s0_65 = *((word32) a0_14 + 0x006C);
				((word32) s0_65 + 48)->u0 = ~0x00;
				Eq_2 a0_74;
				Eq_2 a3_77;
				Eq_2 a4_78;
				word32 a5_223;
				word32 a1_222;
				tcp_segs_free(ra, s0_65, a0_14, a3, a4, s4, mstatus, dwArgE8, out a0_74, out a1_222, out a3_77, out a4_78, out a5_223);
				Eq_2 s0_82 = *((word32) a0_74 + 112);
				Eq_2 a0_83;
				ptr32 a1_84;
				Eq_2 a3_86;
				Eq_2 a4_87;
				Eq_2 a5_88;
				Eq_2 s1_89 = tcp_segs_free(ra, s0_82, a0_74, a3_77, a4_78, s4, mstatus, dwArgE8, out a0_83, out a1_84, out a3_86, out a4_87, out a5_88);
				((word32) s0_82 + 0x006C)->u0 = 0x00;
				((word32) s0_82 + 112)->u0 = 0x00;
				((word32) s0_82 + 0x0068)->u0 = 0x00;
				a0Out = a0_83;
				a1Out = a1_84;
				a2Out = dwArg10;
				a3Out = a3_86;
				a4Out = a4_87;
				a5Out = a5_88;
				return s1_89;
			}
		}
	}
	a0Out = a0;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return s1;
}

// 23071200: Register Eq_2 tcp_pcb_remove(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out (ptr32 Eq_407276) a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_407278) a4Out, Register out ptr32 s2Out, Register out (ptr32 code) s3Out, Register out Eq_2 s4Out, Register out Eq_407282 s5Out, Register out Eq_407283 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_abort
//      tcp_close
//      tcp_input_delayed_close
//      tcp_input
Eq_2 tcp_pcb_remove(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, union Eq_2 & s1Out, struct Eq_407276 & a0Out, ptr32 & a3Out, struct Eq_407278 & a4Out, ptr32 & s2Out, <anonymous> & s3Out, union Eq_2 & s4Out, union Eq_407282 & s5Out, union Eq_407283 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_9 = *a5;
	Eq_2 s0_11 = a1;
	if (a5 == a1)
		*a5 = a0_9;
	else
	{
		while (a5 != 0x00)
		{
			Eq_2 a5_15 = *((word32) a4 + 0x0C);
			if (a4 == a1)
			{
				s0_11 = *((word32) a4 + 0x0C);
				*((word32) a4 + 0x0C) = a5_15;
				break;
			}
			a5 = a4;
		}
	}
	*((word32) s0_11 + 0x0C) = 0x00;
	word32 a5_240;
	Eq_2 a2_42;
	word32 a1_238;
	word32 a4_239;
	struct Eq_407276 * a0_145;
	ptr32 a3_147;
	Eq_2 s1_160 = tcp_pcb_purge(ra, s0_11, a3, s4, mstatus, dwArgC8, dwArgD8, dwArg0108, out a0_145, out a1_238, out a2_42, out a3_147, out a4_239, out a5_240);
	word32 a5_46 = (word32) *((word32) s0_11 + 20);
	struct Eq_407278 * a4_148 = (struct Eq_407278 *) 0x0A;
	if (a5_46 != 0x0A)
	{
		a4_148 = (struct Eq_407278 *) 0x01;
		if (a5_46 != 0x01)
		{
			ui32 a5_49 = (word32) *((word32) s0_11 + 26);
			a4_148 = a5_49 & 1;
			if ((a5_49 & 1) != 0x00)
			{
				*((word32) s0_11 + 26) = (word16) (a5_49 | 2);
				word32 a2_236;
				word32 a5_237;
				word32 a1_235;
				ra = tcp_output(ra, s1_160, s0_11, a2_42, s7, mstatus, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArgFC, dwArg0108, out s0_11, out s1_160, out a0_145, out a1_235, out a2_236, out a3_147, out a4_148, out a5_237, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
			}
		}
	}
	*((word32) s0_11 + 20) = 0x00;
	*((word32) s0_11 + 22) = 0x00;
	s1Out = s1_160;
	a0Out = a0_145;
	a3Out = a3_147;
	a4Out = a4_148;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23071264: Register Eq_2 tcp_abandon(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_407430) a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_abort
//      tcp_kill_state
//      tcp_input
Eq_2 tcp_abandon(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, struct Eq_407430 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a5_21 = (word32) *((word32) a0 + 20);
		Eq_2 a4_111 = 0x0A;
		Eq_2 s0_23 = a0;
		if (a5_21 != 0x0A)
		{
			ptr32 s2_152;
			Eq_2 s5_173 = *((word32) a0 + 80);
			Eq_2 s6_166 = *((word32) a0 + 36);
			Eq_2 s3_200 = *((word32) a0 + 144);
			Eq_2 s4_101 = *((word32) a0 + 16);
			word32 s1_28 = (word32) *((word32) a0 + 22);
			if (a5_21 == 0x00)
			{
				s2_152 = 0x00;
				if (s1_28 != 0x00)
				{
					a4_111.u0 = 0x42027000;
					Eq_2 a5_70 = g_t42026908;
					if (a5_70 == a0)
					{
						a0 = *((word32) a5_70 + 0x0C);
						g_t42027908 = a5_70;
					}
					else
					{
						while (a5_70 != 0x00)
						{
							Eq_2 a5_74 = g_t4202700C;
							if (a0 == 0x42027000)
							{
								s0_23 = g_t4202700C;
								g_t4202700C = a5_74;
								break;
							}
							a5_70.u0 = 0x42027000;
						}
					}
					*((word32) s0_23 + 0x0C) = 0x00;
					s2_152 = 0x00;
				}
			}
			else
			{
				word32 s1_643;
				word32 a4_644;
				word32 s8_645;
				ra = tcp_pcb_remove(ra, a0, a3, 0x0A, a5_21, s4_101, s7, mstatus, dwArg28, dwArg38, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, out s1_643, out a0, out a3, out a4_644, out s2_152, out s3_200, out s4_101, out s5_173, out s6_166, out s7, out s8_645, out s9, out s10, out s11, out mstatus);
				g_b4202790C = 0x01;
				a4_111.u0 = 0x01;
			}
			Eq_2 s0_89 = *((word32) a0 + 112);
			if (a0 != 0x00)
			{
				word32 a1_630;
				word32 a5_631;
				tcp_segs_free(ra, s0_89, a0, a3, a4_111, s4_101, mstatus, dwArgD8, out a0, out a1_630, out a3, out a4_111, out a5_631);
			}
			Eq_2 s0_117 = *((word32) a0 + 0x006C);
			if (a0 != 0x00)
			{
				word32 a1_632;
				word32 a5_633;
				tcp_segs_free(ra, s0_117, a0, a3, a4_111, s4_101, mstatus, dwArgD8, out a0, out a1_632, out a3, out a4_111, out a5_633);
			}
			Eq_2 s0_134 = *((word32) a0 + 116);
			if (a0 != 0x00)
			{
				word32 a0_634;
				word32 a1_635;
				word32 a5_636;
				tcp_segs_free(ra, s0_134, a0, a3, a4_111, s4_101, mstatus, dwArgD8, out a0_634, out a1_635, out a3, out a4_111, out a5_636);
			}
			if (s2_152 != 0x00)
			{
				word32 a5_639;
				word32 s4_640;
				word32 s8_641;
				word32 a0_638;
				word32 s1_637;
				ra = tcp_rst(ra, s0_134, s5_173, s6_166, s7, mstatus, dwArg28, dwArg38, dwArg58, s1, dwArg74, dwArg78, dwArg98, dwArgA8, dwArgD8, dwArg0108, out s0_134, out s1_637, out a0_638, out a3, out a4_111, out a5_639, out s2_152, out s3_200, out s4_640, out s5_173, out s6_166, out s7, out s8_641, out s9, out mstatus);
			}
			Eq_2 a0_221;
			ptr32 a1_222;
			Eq_2 a3_224;
			struct Eq_407430 * a4_225;
			ptr32 a5_226;
			word32 a2_642;
			Eq_2 s1_227 = tcp_free(s0_134, a3, a4_111, mstatus, out a0_221, out a1_222, out a2_642, out a3_224, out a4_225, out a5_226);
			if (s3_200 == 0x00)
			{
				0x00 = (int8) dwArgA8;
				s0Out = s1;
				s1Out = s1_227;
				a0Out = a0_221;
				a1Out = a1_222;
				a3Out = a3_224;
				a4Out = a4_225;
				a5Out = a5_226;
				s2Out = s2_152;
				s3Out = s3_200;
				s4Out = dwArg04;
				s5Out = s5_173;
				s6Out = s6_166;
				s7Out = s7;
				s9Out = s9;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus;
				return ra;
			}
			else
			{
				0x00 = (int8) dwArgA8;
				Eq_2 a0_263;
				Eq_2 s0_264;
				Eq_2 ra_265;
				Eq_2 s1_266;
				ptr32 s2_267;
				Eq_2 s3_268;
				Eq_2 s4_269;
				Eq_2 s5_270;
				Eq_2 s6_271;
				ptr32 a5_272;
				struct Eq_407430 * a4_273;
				ptr32 a1_274;
				Eq_2 a3_280;
				word32 t1_281;
				ptr32 mstatus_282;
				Eq_2 s7_283;
				word32 a7_284;
				ptr32 s10_285;
				ptr32 s11_286;
				ptr32 s9_287;
				word32 t0_288;
				word32 t4_289;
				word32 t5_290;
				word32 t6_291;
				s3_200();
				s0Out = s0_264;
				s1Out = s1_266;
				a0Out = a0_263;
				a1Out = a1_274;
				a3Out = a3_280;
				a4Out = a4_273;
				a5Out = a5_272;
				s2Out = s2_267;
				s3Out = s3_268;
				s4Out = s4_269;
				s5Out = s5_270;
				s6Out = s6_271;
				s7Out = s7_283;
				s9Out = s9_287;
				s10Out = s10_285;
				s11Out = s11_286;
				mstatusOut = mstatus_282;
				return ra_265;
			}
		}
		else
		{
			Eq_2 a3_298;
			Eq_2 a4_299;
			ptr32 mstatus_305;
			ptr32 s10_307;
			ptr32 s11_308;
			ptr32 s2_309;
			Eq_2 s3_310;
			Eq_2 s5_312;
			Eq_2 s6_313;
			Eq_2 s7_314;
			ptr32 s9_316;
			word32 s1_625;
			word32 a0_626;
			word32 s4_627;
			word32 s8_628;
			Eq_2 ra_306 = tcp_pcb_remove(ra, a0, a3, 0x0A, a5_21, s4, s7, mstatus, dwArg28, dwArg38, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, out s1_625, out a0_626, out a3_298, out a4_299, out s2_309, out s3_310, out s4_627, out s5_312, out s6_313, out s7_314, out s8_628, out s9_316, out s10_307, out s11_308, out mstatus_305);
			0x00 = (int8) dwArgA8;
			Eq_2 a0_332;
			ptr32 a1_333;
			Eq_2 a3_335;
			struct Eq_407430 * a4_336;
			ptr32 a5_337;
			word32 a2_629;
			Eq_2 s1_338 = tcp_free(a0, a3_298, a4_299, mstatus_305, out a0_332, out a1_333, out a2_629, out a3_335, out a4_336, out a5_337);
			s0Out = s1;
			s1Out = s1_338;
			a0Out = a0_332;
			a1Out = a1_333;
			a3Out = a3_335;
			a4Out = a4_336;
			a5Out = a5_337;
			s2Out = s2_309;
			s3Out = s3_310;
			s4Out = dwArg04;
			s5Out = s5_312;
			s6Out = s6_313;
			s7Out = s7_314;
			s9Out = s9_316;
			s10Out = s10_307;
			s11Out = s11_308;
			mstatusOut = mstatus_305;
			return ra_306;
		}
	}
}

// 23071378: Register Eq_2 tcp_abort(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_407764) s0Out, Register out (ptr32 Eq_407765) s1Out, Register out (ptr32 Eq_407766) a0Out, Register out ptr32 a1Out, Register out (ptr32 Eq_407768) a3Out, Register out (ptr32 Eq_407769) a4Out, Register out Eq_407770 a5Out, Register out (ptr32 Eq_407771) s2Out, Register out (ptr32 Eq_407772) s3Out, Register out (ptr32 byte) s4Out, Register out Eq_407774 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_accept_null
//      tcp_netif_ip_addr_changed_pcblist.isra.2
//      tcp_new_ip_type
//      tcp_input
//      netconn_drain
//      lwip_netconn_do_close
//      altcp_tcp_abort
Eq_2 tcp_abort(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, struct Eq_407764 & s0Out, struct Eq_407765 & s1Out, struct Eq_407766 & a0Out, ptr32 & a1Out, struct Eq_407768 & a3Out, struct Eq_407769 & a4Out, union Eq_407770 & a5Out, struct Eq_407771 & s2Out, struct Eq_407772 & s3Out, byte & s4Out, union Eq_407774 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_407766 * a0_13;
	ptr32 a1_14;
	struct Eq_407768 * a3_16;
	struct Eq_407769 * a4_17;
	Eq_407770 a5_18;
	ptr32 mstatus_21;
	struct Eq_407764 * s0_23;
	struct Eq_407765 * s1_24;
	ptr32 s10_25;
	ptr32 s11_26;
	struct Eq_407771 * s2_27;
	struct Eq_407772 * s3_28;
	byte * s4_29;
	Eq_407774 s5_30;
	ptr32 s6_31;
	ptr32 s7_32;
	union Eq_2 * s9_34;
	Eq_2 ra_22 = tcp_abandon(ra, s1, a0, a3, s3, s4, s7, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArg48, dwArg58, dwArg74, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s0_23, out s1_24, out a0_13, out a1_14, out a3_16, out a4_17, out a5_18, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s7_32, out s9_34, out s10_25, out s11_26, out mstatus_21);
	s0Out = s0_23;
	s1Out = s1_24;
	a0Out = a0_13;
	a1Out = a1_14;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s5Out = s5_30;
	s6Out = s6_31;
	s7Out = s7_32;
	s9Out = s9_34;
	s10Out = s10_25;
	s11Out = s11_26;
	mstatusOut = mstatus_21;
	return ra_22;
}

// 2307137E: void tcp_accept_null(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
void tcp_accept_null(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	word32 s0_65;
	word32 s1_66;
	word32 a0_67;
	word32 a1_68;
	word32 a3_69;
	word32 a4_70;
	word32 a5_71;
	word32 s2_72;
	word32 s3_73;
	word32 s4_74;
	word32 s5_75;
	word32 s6_76;
	word32 s7_77;
	word32 s9_78;
	word32 s10_79;
	word32 s11_80;
	word32 mstatus_81;
	tcp_abort(ra, s1, a1, a3, s3, s4, s7, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArg28, dwArg38, dwArg48, dwArg64, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgC8, dwArgCC, dwArgD8, dwArgF8, out s0_65, out s1_66, out a0_67, out a1_68, out a3_69, out a4_70, out a5_71, out s2_72, out s3_73, out s4_74, out s5_75, out s6_76, out s7_77, out s9_78, out s10_79, out s11_80, out mstatus_81);
}

