pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23071390: Register Eq_2 tcp_netif_ip_addr_changed_pcblist.isra.2(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_netif_ip_addr_changed
Eq_2 tcp_netif_ip_addr_changed_pcblist.isra.2(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgF8, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	while (a1 != 0x00)
	{
		Eq_2 a1_19 = *((word32) s1 + 0x0C);
		if (a4 == a5)
		{
			word32 s0_196;
			word32 a0_197;
			word32 a1_198;
			word32 s5_199;
			word32 s6_200;
			word32 s9_201;
			word32 s10_202;
			word32 s11_203;
			ra = tcp_abort(ra, s1, a1_19, a3, s3, s4, s7, mstatus, dwLoc10, s0, dwArg18, dwArg28, dwArg38, dwArg48, dwArg64, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgC8, dwArgCC, dwArgD8, dwArgF8, out s0_196, out s1, out a0_197, out a1_198, out a3, out a4, out a5, out s2, out s3, out s4, out s5_199, out s6_200, out s7, out s9_201, out s10_202, out s11_203, out mstatus);
		}
		a1 = s1;
	}
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

Eq_2 g_t23071396 = 
	{
		38
	};
// 230713BA: Register Eq_2 tcp_netif_ip_addr_changed(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_do_set_ipaddr
//      netif_remove
Eq_2 tcp_netif_ip_addr_changed(Eq_2 ra, ptr32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_12 = *a4;
		if (a4 != 0x00)
		{
			Eq_2 a3_26;
			Eq_2 a4_27;
			ptr32 mstatus_31;
			Eq_2 s1_33;
			Eq_2 s3_37;
			Eq_2 s4_38;
			Eq_2 s7_41;
			word32 s7_265;
			word32 s2_263;
			word32 s3_264;
			word32 a5_262;
			ra = tcp_netif_ip_addr_changed_pcblist.isra.2(tcp_netif_ip_addr_changed_pcblist.isra.2(ra, a0_12, a1, g_t42026904, a3, a4, 0x42027000, s3, s4, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s1_33, out a3_26, out a4_27, out a5_262, out s2_263, out s3_37, out s4_38, out s7_41, out mstatus_31), a0_12, s1_33, g_t42026908, a3_26, a4_27, 0x42027000, s3_37, s4_38, s7_41, mstatus_31, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s1, out a3, out a4, out a5, out s2, out s3_264, out s4, out s7_265, out mstatus);
			if (s1 != 0x00)
			{
				s1 = *a5;
				if (a5 != 0x00)
				{
					a5 = g_t42026900;
					while (a5 != 0x00)
					{
						Eq_2 a5_88 = *a3;
						if (a3 == a4)
						{
							s1 = *a4;
							*a4 = a5_88;
						}
						a5 = *((word32) a5_88 + 0x0C);
					}
				}
			}
		}
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23071412: void tcp_kill_state(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
// Called from:
//      tcp_new_ip_type
void tcp_kill_state(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	Eq_2 a5_10 = g_t42026904;
	Eq_406632 a1_7 = g_t420268FC;
	up32 a2_17 = 0x00;
	Eq_2 a3_19 = 0x00;
	while (a5_10 != 0x00)
	{
		Eq_2 a4_12 = (word32) *((word32) a5_10 + 20);
		if (a4_12 == a0)
		{
			a5_10 = *((word32) a4_12 + 32);
			up32 a4_16 = a1_7 - a4_12;
			if (a4_16 >= a2_17)
			{
				a2_17 = a4_16;
				a3_19 = a5_10;
			}
		}
		a5_10 = *((word32) a5_10 + 0x0C);
	}
	if (a3_19 == 0x00)
		return;
	word32 s11_229;
	word32 mstatus_230;
	word32 s10_228;
	word32 s7_226;
	word32 s9_227;
	word32 s5_224;
	word32 s6_225;
	word32 s3_222;
	word32 s4_223;
	word32 a5_220;
	word32 s2_221;
	word32 a3_218;
	word32 a4_219;
	word32 a0_216;
	word32 a1_217;
	word32 s0_214;
	word32 s1_215;
	tcp_abandon(ra, s1, a3_19, a3_19, s3, s4, s7, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArg48, dwArg58, dwArg74, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s0_214, out s1_215, out a0_216, out a1_217, out a3_218, out a4_219, out a5_220, out s2_221, out s3_222, out s4_223, out s5_224, out s6_225, out s7_226, out s9_227, out s10_228, out s11_229, out mstatus_230);
}

