pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307144E: Register Eq_2 tcp_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_408150) a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_408152) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_new_ip_type
//      tcp_input
Eq_2 tcp_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, struct Eq_407430 & a4Out, ptr32 & a5Out, struct Eq_408152 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_407430 * a4_285;
	ptr32 a3_284;
	ptr32 a5_282;
	Eq_2 a0_20;
	word32 a2_890;
	word32 a5_891;
	Eq_2 a3_23;
	Eq_2 a4_116;
	Eq_2 s1_123 = memp_malloc(a0, 0x02, a3, a4, mstatus, out a0_20, out a2_890, out a3_23, out a4_116, out a5_891);
	Eq_2 s0_153 = a0_20;
	if (a0_20 != 0x00)
	{
l2307151A:
		word32 a2_938;
		word32 a5_939;
		word32 a0_937;
		word32 t1_936;
		ra = memset(ra, s0_153, 0x00, 0x00A4, out t1_936, out a0_937, out a1, out a2_938, out a3_284, out a4_285, out a5_939);
		((word32) s0_153 + 100)->u0 = 0x0580;
		*(union Eq_2 *) 0x08100838 = s0_153;
		*((word32) s0_153 + 11) = ~0x00;
		((word32) s0_153 + 64)->u0 = 0x06;
		*((word32) s0_153 + 62) = 0x06;
		*(union Eq_2 *) 0x0219002F = s0_153;
		Eq_406632 a5_349 = g_t420268FC;
		*((word32) s0_153 + 21) = (byte) s1_123;
		*((word32) a5_349 + 32) = s0_153;
		*((word32) s0_153 + 30) = (byte) (word32) g_b4200F661;
		*(union Eq_2 *) 0x15800049 = s0_153;
		((word32) s0_153 + 0x0084)->u0 = 587667334;
		((word32) s0_153 + 0x0094)->u0 = 7200000;
		((word32) s0_153 + 0x0098)->u0 = 301991160;
		((word32) s0_153 + 0x009C)->u0 = 0x09;
		a5_282 = 0x09;
l2307159C:
		s1Out = s1_123;
		a0Out = s0_153;
		a1Out = a1;
		a3Out = a3_284;
		a4Out = a4_285;
		a5Out = a5_282;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = dwLoc1C;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	s3.u0 = 0x42027000;
	Eq_2 a0_29 = g_t42026904;
	s4_102 = s4;
	while (true)
	{
		Eq_2 s4_102;
		if (a0_29 == 0x00)
			break;
		ui32 a5_32 = (word32) *((word32) a0_29 + 26);
		Eq_2 a0_34 = *((word32) a0_20 + 0x0C);
		a4_116 = a5_32 & 8;
		if ((a5_32 & 8) != 0x00)
		{
			*((word32) a0_34 + 26) = (word16) (a5_32 & ~0x08);
			word32 a2_945;
			word32 s2_947;
			word32 a0_944;
			word32 a5_946;
			word32 s8_948;
			ra = tcp_close_shutdown_fin(ra, s1_123, a0_34, a3_23, s7, mstatus, dwLoc0C, dwArg08, dwArg28, dwArg38, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s1_123, out a0_944, out a1, out a2_945, out a3_23, out a4_116, out a5_946, out s2_947, out s3, out s4_102, out s5, out s6, out s7, out s8_948, out s9, out s10, out s11, out mstatus);
		}
		a0_29 = a0_20;
	}
	s2 = (struct Eq_408152 *) &g_w42027000;
	Eq_2 a5_76 = g_t420268F8;
	Eq_406632 a2_77 = g_t420268FC;
	Eq_2 a3_115 = 0x00;
	while (a5_76 != 0x00)
	{
		Eq_2 a5_82 = *((word32) a4_116 + 32);
		a4_116 = a2_77 - a4_116;
		if (a4_116 >= a3_115)
		{
			a3_115 = a4_116;
			a0_29 = a5_82;
		}
		a5_76 = *((word32) a5_82 + 0x0C);
	}
	if (a0_29 != 0x00)
	{
		word32 s0_892;
		word32 a0_893;
		word32 a5_894;
		ra = tcp_abort(ra, s1_123, a0_29, a3_115, s3, s4_102, s7, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s0_892, out s1_123, out a0_893, out a1, out a3_115, out a4_116, out a5_894, out s2, out s3, out s4_102, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
	}
	Eq_2 a0_146;
	Eq_2 a3_149;
	Eq_2 a4_150;
	word32 a5_896;
	word32 a2_895;
	s1_123 = memp_malloc(s1_123, 0x02, a3_115, a4_116, mstatus, out a0_146, out a2_895, out a3_149, out a4_150, out a5_896);
	s0_153 = a0_146;
	if (a0_146 != 0x00)
	{
l23071508:
		uint16 * a4_309 = g_ptr420268B0;
		*a4_309 = (word16) ((word32) *a4_309 + ~0x00);
		goto l2307151A;
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg116 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg220 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	tcp_kill_state(ra, s1, a0, s3, s4, s7, mstatus, stackArg0, stackArg4, stackArg40, stackArg56, stackArg72, stackArg88, stackArg116, stackArg120, stackArg136, stackArg152, stackArg156, stackArg168, stackArg184, stackArg216, stackArg220, stackArg232, stackArg264);
	Eq_2 a0_156;
	Eq_2 a3_159;
	Eq_2 a4_160;
	word32 a2_914;
	word32 a5_915;
	s1_123 = memp_malloc(s1_123, 0x02, a3_149, a4_150, mstatus, out a0_156, out a2_914, out a3_159, out a4_160, out a5_915);
	s0_153 = a0_156;
	if (a0_156 != 0x00)
	{
l230714F6:
		uint16 * a4_303 = g_ptr420268B0;
		*a4_303 = (word16) ((word32) *a4_303 + ~0x00);
		goto l23071508;
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg116 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg220 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	tcp_kill_state(ra, s1, a0, s3, s4, s7, mstatus, stackArg0, stackArg4, stackArg40, stackArg56, stackArg72, stackArg88, stackArg116, stackArg120, stackArg136, stackArg152, stackArg156, stackArg168, stackArg184, stackArg216, stackArg220, stackArg232, stackArg264);
	Eq_2 a0_166;
	word32 a2_933;
	word32 a5_934;
	Eq_2 a4_170;
	Eq_2 a3_169;
	s1_123 = memp_malloc(s1_123, 0x02, a3_159, a4_160, mstatus, out a0_166, out a2_933, out a3_169, out a4_170, out a5_934);
	s0_153 = a0_166;
	if (a0_166 != 0x00)
	{
l230714E4:
		uint16 * a4_297 = g_ptr420268B0;
		*a4_297 = (word16) ((word32) *a4_297 + ~0x00);
		goto l230714F6;
	}
	Eq_2 a5_176;
	if ((int32) (byte) s1_123 >= 0x00)
	{
		a5_176 = s1_123;
		if (s1_123 == 0x00)
			goto l230714C8;
	}
	else
		a5_176.u0 = 0x007F;
	a4_170 = *((byte) s3.u0 - 1788);
	int32 a0_187 = s2->dwFFFFF8FC;
	uint32 a5_190 = (word32) a5_176 - 1 & 0x00FF;
	a3_169.u0 = 0x00;
	while (a4_170 != 0x00)
	{
		uint32 a2_194 = (word32) *((word32) a4_170 + 21);
		if (a2_194 >= a5_190)
		{
			if (a2_194 != a5_190)
				goto l2307161A;
			a4_170 = *((word32) a1 + 32);
			a1 = a0_187 - a1;
			if (a1 >= a3_169)
				goto l23071610;
		}
		else
		{
l23071610:
			a4_170 = *((byte) a3_169.u0 + 32);
			a5_190 = a2_194;
			s0_153 = a4_170;
			a3_169 = a0_187 - a3_169;
		}
l2307161A:
		a4_170 = *((word32) a4_170 + 0x0C);
	}
	if (s0_153 != 0x00)
	{
		word32 a5_942;
		word32 s4_943;
		word32 s0_940;
		word32 a0_941;
		ra = tcp_abort(ra, s1_123, s0_153, a3_169, s3, s4_102, s7, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s0_940, out s1_123, out a0_941, out a1, out a3_169, out a4_170, out a5_942, out s2, out s3, out s4_943, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
	}
l230714C8:
	word32 a2_935;
	Eq_2 a0_281;
	s1_123 = memp_malloc(s1_123, 0x02, a3_169, a4_170, mstatus, out a0_281, out a2_935, out a3_284, out a4_285, out a5_282);
	s0_153 = a0_281;
	if (a0_281 == 0x00)
		goto l2307159C;
	uint16 * a4_291 = g_ptr420268B0;
	*a4_291 = (word16) ((word32) *a4_291 + ~0x00);
	goto l230714E4;
}

// 2307161E: Register Eq_2 tcp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_408609) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_newconn
//      altcp_tcp_new_ip_type
Eq_2 tcp_new_ip_type(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_408609 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_14;
	ptr32 a3_16;
	ptr32 a4_17;
	struct Eq_408609 * a5_18;
	ptr32 s1_22;
	ptr32 s4_23;
	ptr32 s8_24;
	ptr32 a0_29;
	ptr32 mstatus_31;
	ptr32 s2_34;
	ptr32 s3_35;
	ptr32 s6_37;
	ptr32 s7_38;
	ptr32 s9_39;
	word32 s5_76;
	word32 s10_77;
	word32 s11_78;
	Eq_2 ra_20 = tcp_alloc(ra, s1, 64, a1, a3, a4, s3, s4, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s1_22, out a0_29, out a1_14, out a3_16, out a4_17, out a5_18, out s2_34, out s3_35, out s4_23, out s5_76, out s6_37, out s7_38, out s8_24, out s9_39, out s10_77, out s11_78, out mstatus_31);
	s1Out = s1_22;
	a0Out = a0_29;
	a1Out = a1_14;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s2Out = s2_34;
	s3Out = s3_35;
	s4Out = s4_23;
	s6Out = s6_37;
	s7Out = s7_38;
	s8Out = s8_24;
	s9Out = s9_39;
	mstatusOut = mstatus_31;
	return ra_20;
}

// 23071626: Register Eq_2 tcp_close_shutdown(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_close
//      altcp_tcp_shutdown
Eq_2 tcp_close_shutdown(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_106;
	ptr32 a4_112;
	ptr32 a5_108;
	Eq_2 s1_113;
	Eq_2 s0_11 = a0;
	Eq_2 a5_12 = (word32) *((word32) a0 + 20);
	if (a1 != 0x00)
	{
		a4.u0 = 0x04;
		if (a5_12 != 0x04)
		{
			a4.u0 = 0x07;
			if (a5_12 != 0x07)
				goto l230716BE;
		}
		s0_11 = *((byte) a4.u0 + 0x0078);
		if (a4 != 0x00)
		{
l23071654:
			Eq_2 a3_222;
			word32 a5_705;
			word32 a0_703;
			word32 a4_704;
			word32 s1_702;
			ra = tcp_rst(ra, *((word32) a1 + 80), a1, a2, s7, mstatus, dwArg38, dwArg48, dwArg68, dwArg78, dwArg84, dwArg88, dwArgA8, dwArgB8, dwArgE8, dwArg0118, out s0_11, out s1_702, out a0_703, out a3_222, out a4_704, out a5_705, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out mstatus);
			word32 a5_709;
			word32 a2_707;
			word32 a4_708;
			word32 a0_706;
			s1_113 = tcp_pcb_purge(ra, s0_11, a3_222, s4, mstatus, dwArgC8, dwArgD8, dwArg0108, out a0_706, out a1_106, out a2_707, out a3, out a4_708, out a5_709);
			Eq_2 a5_256 = g_t42026904;
			if (a5_256 == s0_11)
			{
				s0_11 = *((word32) a5_256 + 0x0C);
				g_t42027904 = a5_256;
			}
			else
			{
				while (a5_256 != 0x00)
				{
					Eq_2 a5_260 = g_t4202700C;
					if (s0_11 == 0x42027000)
					{
						s0_11 = g_t4202700C;
						g_t4202700C = a5_260;
						break;
					}
					a5_256.u0 = 0x42027000;
				}
			}
			g_b4202790C = 0x01;
			Eq_2 a5_271 = g_t42026910;
			*((word32) s0_11 + 0x0C) = 0x00;
			a4.u0 = 0x01;
			if (a5_271 == s0_11)
			{
				a4_112 = tcp_trigger_input_pcb_close(out a5_108);
				goto l230716A2;
			}
			goto l230716F6;
		}
		a3 = (word32) *((word32) s0_11 + 40);
		a4.u0 = 0x00FFF810;
		if (a3 != 0x00FFF810)
			goto l23071654;
	}
l230716BE:
	if (a5_12 == 0x01)
	{
		do
		{
			word32 a5_30 = *((byte) a4.u0 + 4);
			a4 = *a4.u0;
			while (a4 != 0x00)
			{
				Eq_2 a4_35 = *((word32) a2 + 0x007C);
				if (s0_11 == a2)
					((word32) a4_35 + 0x007C)->u0 = 0x00;
				a4 = *((word32) a4_35 + 0x0C);
			}
		} while (a5_30 != 3706964116);
		Eq_2 a3_81;
		Eq_2 a4_82;
		word32 a0_715;
		word32 s1_714;
		ra = tcp_pcb_remove(ra, s0_11, 0x230C3770, a4, a5_30 + 0x04, s4, s7, mstatus, dwArg38, dwArg48, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s1_714, out a0_715, out a3_81, out a4_82, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
		a1_106 = s0_11;
		word32 a2_717;
		word32 a0_716;
		s1_113 = memp_free(0x03, s0_11, a3_81, a4_82, mstatus, out a0_716, out a2_717, out a3, out a4_112, out a5_108);
l230716A2:
		s1Out = s1_113;
		a0Out = 0x00;
		a1Out = a1_106;
		a3Out = a3;
		a4Out = a4_112;
		a5Out = a5_108;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	if (a5_12 != 0x00)
	{
		if (a5_12 != 0x02)
		{
			Eq_2 a1_173;
			Eq_2 a3_175;
			ptr32 a4_176;
			ptr32 a5_177;
			ptr32 mstatus_180;
			Eq_2 s1_182;
			ptr32 s2_183;
			ptr32 s3_184;
			Eq_2 s4_185;
			ptr32 s5_186;
			ptr32 s6_187;
			ptr32 s8_188;
			ptr32 a0_196;
			ptr32 s10_197;
			ptr32 s11_198;
			Eq_2 s7_199;
			ptr32 s9_200;
			word32 a2_712;
			Eq_2 ra_181 = tcp_close_shutdown_fin(ra, 0x01, s0_11, a3, s7, mstatus, dwArg14, dwArg28, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArgFC, dwArg0108, dwArg0128, out s1_182, out a0_196, out a1_173, out a2_712, out a3_175, out a4_176, out a5_177, out s2_183, out s3_184, out s4_185, out s5_186, out s6_187, out s7_199, out s8_188, out s9_200, out s10_197, out s11_198, out mstatus_180);
			s1Out = s1_182;
			a0Out = a0_196;
			a1Out = a1_173;
			a3Out = a3_175;
			a4Out = a4_176;
			a5Out = a5_177;
			s2Out = s2_183;
			s3Out = s3_184;
			s4Out = s4_185;
			s5Out = s5_186;
			s6Out = s6_187;
			s7Out = s7_199;
			s8Out = s8_188;
			s9Out = s9_200;
			s10Out = s10_197;
			s11Out = s11_198;
			mstatusOut = mstatus_180;
			return ra_181;
		}
		word32 s1_144;
		word32 a0_713;
		ra = tcp_pcb_remove(ra, s0_11, a3, 0x02, a5_12, s4, s7, mstatus, dwArg38, dwArg48, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s1_144, out a0_713, out a3, out a4, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
		g_b4202790C = (byte) s1_144;
	}
	else if ((word32) *((word32) s0_11 + 22) != 0x00)
	{
		a4.u0 = 0x42027000;
		Eq_2 a5_119 = g_t42026908;
		if (a5_119 == s0_11)
		{
			s0_11 = *((word32) a5_119 + 0x0C);
			g_t42027908 = a5_119;
		}
		else
		{
			while (a5_119 != 0x00)
			{
				Eq_2 a5_123 = g_t4202700C;
				if (s0_11 == 0x42027000)
				{
					s0_11 = g_t4202700C;
					g_t4202700C = a5_123;
					break;
				}
				a5_119.u0 = 0x42027000;
			}
		}
		*((word32) s0_11 + 0x0C) = 0x00;
	}
l230716F6:
	word32 a2_711;
	word32 a0_710;
	s1_113 = tcp_free(s0_11, a3, a4, mstatus, out a0_710, out a1_106, out a2_711, out a3, out a4_112, out a5_108);
	goto l230716A2;
}

