pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23071764: Register Eq_2 tcp_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_409018) s1Out, Register out (ptr32 Eq_409019) a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_409022 a4Out, Register out (ptr32 Eq_409023) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out Eq_409027 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_recv_null
//      lwip_netconn_do_listen
//      lwip_netconn_do_close
//      altcp_tcp_close
//      altcp_tcp_new_ip_type
Eq_2 tcp_close(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_409018 & s1Out, struct Eq_409019 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_409022 & a4Out, struct Eq_409023 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_409027 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = (struct Eq_409019 *) ~0x0F;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a4_6 = (word32) *((word32) a0 + 20);
		if (a4_6 != 0x01)
			*((word32) a0 + 26) = (word16) ((word32) *((word32) a0 + 26) | 16);
		struct Eq_409019 * a0_28;
		ptr32 a1_29;
		Eq_2 a3_31;
		Eq_409022 a4_32;
		struct Eq_409023 * a5_33;
		ptr32 mstatus_36;
		struct Eq_409018 * s1_38;
		ptr32 s10_39;
		ptr32 s11_40;
		ptr32 s2_41;
		ptr32 s3_42;
		Eq_2 s4_43;
		Eq_409027 s5_44;
		ptr32 s6_45;
		Eq_2 s7_46;
		ptr32 s8_47;
		ptr32 s9_48;
		Eq_2 ra_37 = tcp_close_shutdown(ra, a0, 0x01, a2, a3, a4_6, s4, s7, mstatus, dwArg14, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, dwArg0128, out s1_38, out a0_28, out a1_29, out a3_31, out a4_32, out a5_33, out s2_41, out s3_42, out s4_43, out s5_44, out s6_45, out s7_46, out s8_47, out s9_48, out s10_39, out s11_40, out mstatus_36);
		s1Out = s1_38;
		a0Out = a0_28;
		a1Out = a1_29;
		a3Out = a3_31;
		a4Out = a4_32;
		a5Out = a5_33;
		s2Out = s2_41;
		s3Out = s3_42;
		s4Out = s4_43;
		s5Out = s5_44;
		s6Out = s6_45;
		s7Out = s7_46;
		s8Out = s8_47;
		s9Out = s9_48;
		s10Out = s10_39;
		s11Out = s11_40;
		mstatusOut = mstatus_36;
		return ra_37;
	}
}

// 23071786: Register Eq_2 tcp_recv_null(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out (ptr32 Eq_409139) a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_409141) a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_process_refused_data
//      tcp_input
Eq_2 tcp_recv_null(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s1Out, struct Eq_409139 & a0Out, union Eq_2 & a3Out, struct Eq_409141 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a1 == 0x00)
	{
		s1Out = s1;
		a0Out = (struct Eq_409139 *) ~0x0F;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else if (a2 == 0x00)
	{
		if (a3 != 0x00)
		{
			s1Out = s1;
			a0Out = null;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			struct Eq_409139 * a0_14;
			Eq_2 a3_17;
			struct Eq_409141 * a4_18;
			ptr32 mstatus_22;
			Eq_2 s1_24;
			ptr32 s10_25;
			ptr32 s11_26;
			ptr32 s2_27;
			ptr32 s3_28;
			Eq_2 s4_29;
			ptr32 s5_30;
			ptr32 s6_31;
			Eq_2 s7_32;
			ptr32 s8_33;
			union Eq_2 * s9_34;
			word32 a1_210;
			word32 a5_211;
			Eq_2 ra_23 = tcp_close(ra, a1, a2, a3, s4, s7, mstatus, dwArg14, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, dwArg0128, out s1_24, out a0_14, out a1_210, out a3_17, out a4_18, out a5_211, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s7_32, out s8_33, out s9_34, out s10_25, out s11_26, out mstatus_22);
			s1Out = s1_24;
			a0Out = a0_14;
			a3Out = a3_17;
			a4Out = a4_18;
			s2Out = s2_27;
			s3Out = s3_28;
			s4Out = s4_29;
			s5Out = s5_30;
			s6Out = s6_31;
			s7Out = s7_32;
			s8Out = s8_33;
			s9Out = s9_34;
			s10Out = s10_25;
			s11Out = s11_26;
			mstatusOut = mstatus_22;
			return ra_23;
		}
	}
	else
	{
		Eq_2 a4_52;
		Eq_2 a3_55;
		ptr32 mstatus_58;
		Eq_2 s0_60;
		ptr32 s10_62;
		ptr32 s11_63;
		Eq_2 s4_66;
		Eq_2 s7_69;
		union Eq_2 * s9_71;
		Eq_2 a3_86;
		struct Eq_409141 * a4_87;
		Eq_2 s1_89;
		ptr32 s2_90;
		ptr32 s3_91;
		Eq_2 s4_94;
		ptr32 s5_95;
		ptr32 s6_96;
		ptr32 s8_97;
		ptr32 mstatus_103;
		word32 s1_200;
		word32 a0_201;
		word32 a5_202;
		word32 s3_203;
		word32 s0_204;
		word32 a0_205;
		word32 a1_206;
		word32 a2_207;
		word32 a5_208;
		word32 a7_209;
		Eq_2 ra_104 = pbuf_free(tcp_recved(ra, s1, a1, (word32) *((word32) a2 + 8), s7, mstatus, dwArg00, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArgFC, dwArg0108, out s0_60, out s1_200, out a0_201, out a3_55, out a4_52, out a5_202, out s3_203, out s4_66, out s7_69, out s9_71, out s10_62, out s11_63, out mstatus_58), s0_60, a3_55, a4_52, s4_66, mstatus_58, dwArg0118, out s0_204, out s1_89, out a0_205, out a1_206, out a2_207, out a3_86, out a4_87, out a5_208, out a7_209, out s2_90, out s3_91, out s4_94, out s5_95, out s6_96, out s8_97, out mstatus_103);
		s1Out = s1_89;
		a0Out = null;
		a3Out = a3_86;
		a4Out = a4_87;
		s2Out = s2_90;
		s3Out = s3_91;
		s4Out = s4_94;
		s5Out = s5_95;
		s6Out = s6_96;
		s7Out = s7_69;
		s8Out = s8_97;
		s9Out = s9_71;
		s10Out = s10_62;
		s11Out = s11_63;
		mstatusOut = mstatus_103;
		return ra_104;
	}
}

// 230717BC: Register Eq_2 tcp_process_refused_data(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out (ptr32 Eq_409305) s1Out, Register out (ptr32 Eq_409305) a0Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_409308) a3Out, Register out Eq_409309 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_fasttmr
//      tcp_input
Eq_2 tcp_process_refused_data(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s0Out, struct Eq_409305 & s1Out, struct Eq_409305 & a0Out, union Eq_2 & a2Out, struct Eq_409308 & a3Out, union Eq_409309 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_409305 * s1_124 = (struct Eq_409305 *) ~0x0F;
	if (a0 != 0x00)
	{
		word32 s4_118;
		struct Eq_409305 * a0_28;
		Eq_2 s2_16 = *((word32) a0 + 0x0078);
		Eq_2 a5_17 = *((word32) a0 + 0x0084);
		word32 s3_19 = (word32) *((word32) s2_16 + 0x0D);
		((word32) a0 + 0x0078)->u0 = 0x00;
		s0 = a0;
		if (a5_17 != 0x00)
		{
			word32 a5_64;
			word32 a1_67;
			word32 a7_75;
			word32 t0_81;
			word32 t1_82;
			word32 t4_83;
			word32 t5_84;
			word32 t6_85;
			word32 tp_86;
			a5_17();
		}
		else
		{
			word32 s1_365;
			word32 s8_366;
			ra = tcp_recv_null(ra, ~0x0F, a0, s2_16, 0x00, s4, s7, mstatus, dwLoc20, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s1_365, out a0_28, out a3, out a4, out s2, out s3, out s4_118, out s5, out s6, out s7, out s8_366, out s9, out s10, out s11, out mstatus);
		}
		s1_124 = a0_28;
		if (a0_28 == null)
		{
			s3 &= 32;
			if (s3 == 0x00)
				goto l23071822;
			word32 a5_97 = (word32) *((word32) s0 + 40);
			a4.u0 = 0x00FFF810;
			if (a5_97 != 0x00FFF810)
				((word32) s0 + 40)->u2 = (word16) (a5_97 + 0x01);
			Eq_2 a5_104 = *((word32) s0 + 0x0084);
			if (a5_104 != 0x00)
			{
				word32 s0_106 = a0_28->dw0010;
				word32 a0_129;
				word32 a7_141;
				word32 t0_147;
				word32 t1_148;
				word32 t4_149;
				word32 t5_150;
				word32 t6_151;
				word32 tp_152;
				a5_104();
				if (a0_129 != ~0x0C)
					goto l23071822;
l23071820:
				s1_124 = (struct Eq_409305 *) ~0x0C;
				goto l23071822;
			}
		}
		else
		{
			if (a0_28 == (struct Eq_409305 *) ~0x0C)
				goto l23071820;
			*((word32) s0 + 0x0078) = s2;
			s1_124 = (struct Eq_409305 *) ~0x04;
		}
	}
l23071822:
	s0Out = s0;
	s1Out = s1_124;
	a0Out = s1_124;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwLoc1C;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23071848: Register Eq_2 tcp_fasttmr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s5Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_tmr
Eq_2 tcp_fasttmr(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s5Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	g_b4200F661 = (byte) ((word32) g_b4200F661 + 0x01);
	Eq_2 a3_144 = 0x4200F661;
	byte * s2_101 = &g_b4200F661;
	Eq_2 s4_103 = 0x42027000;
	Eq_2 s3_102 = 0x42027000;
	s1_100 = s1;
	ra_129 = ra;
l23071874:
	Eq_2 ra_129;
	Eq_2 s1_100;
	Eq_2 s0_167 = *((word32) s4_103 - 1788);
	while (s0_167 != 0x00)
	{
		word32 a5_30 = (word32) *s2_101;
		if ((word32) *((word32) s0_167 + 30) != a5_30)
		{
			*((word32) s0_167 + 30) = (byte) a5_30;
			ui32 a5_35 = (word32) *((word32) s0_167 + 26);
			if ((a5_35 & 1) != 0x00)
			{
				*((word32) s0_167 + 26) = (word16) (a5_35 | 2);
				word32 a1_492;
				word32 s6_495;
				word32 s9_497;
				word32 s10_498;
				word32 s11_499;
				word32 s8_496;
				word32 a5_494;
				word32 a4_493;
				ra_129 = tcp_output(ra_129, s1_100, s0_167, a2, s7, mstatus, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s0_167, out s1_100, out a0, out a1_492, out a2, out a3_144, out a4_493, out a5_494, out s2_101, out s3_102, out s4_103, out s5, out s6_495, out s7, out s8_496, out s9_497, out s10_498, out s11_499, out mstatus);
				*((word32) s0_167 + 26) = (word16) ((word32) *((word32) s0_167 + 26) & ~0x03);
			}
			ui32 a5_119 = (word32) *((word32) s0_167 + 26);
			if ((a5_119 & 8) != 0x00)
			{
				*((word32) s0_167 + 26) = (word16) (a5_119 & ~0x08);
				word32 s10_505;
				word32 s11_506;
				word32 a1_500;
				word32 s6_502;
				word32 s8_503;
				word32 s9_504;
				word32 a4_501;
				ra_129 = tcp_close_shutdown_fin(ra_129, s1_100, s0_167, a3_144, s7, mstatus, dwLoc0C, dwArg08, dwArg28, dwArg38, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s1_100, out a0, out a1_500, out a2, out a3_144, out a4_501, out a5_119, out s2_101, out s3_102, out s4_103, out s5, out s6_502, out s7, out s8_503, out s9_504, out s10_505, out s11_506, out mstatus);
			}
			Eq_2 s0_123 = *((word32) s1_100 + 0x0C);
			if (a5_119 != 0x00)
			{
				*((word32) s3_102 + 0x090C) = 0x00;
				word32 s11_513;
				word32 s10_512;
				word32 s9_511;
				word32 s8_510;
				word32 s0_507;
				word32 a4_508;
				word32 s6_509;
				ra_129 = tcp_process_refused_data(ra_129, s1_100, s0_123, s3_102, s4_103, s7, mstatus, s2, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg58, s1, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, out s0_507, out s1_100, out a0, out a2, out a3_144, out a4_508, out s2_101, out s3_102, out s4_103, out s5, out s6_509, out s7, out s8_510, out s9_511, out s10_512, out s11_513, out mstatus);
				if ((word32) *((word32) s3_102 - 0x06F4) != 0x00)
					goto l23071874;
			}
		}
		s0_167 = s1_100;
	}
	s1Out = s1_100;
	a0Out = a0;
	a3Out = a3_144;
	s5Out = s5;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra_129;
}

// 230718F0: Register Eq_2 tcp_shutdown(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ui32 a2, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_close
//      altcp_tcp_shutdown
Eq_2 tcp_shutdown(Eq_2 ra, Eq_2 a0, Eq_2 a1, ui32 a2, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a0_162;
	Eq_2 a3_10 = (word32) *((word32) a0 + 20);
	Eq_2 a4_11 = 0x01;
	if (a3_10 != 0x01)
	{
		if (a1 != 0x00)
		{
			ui32 a4_19 = (word32) *((word32) a0 + 26);
			*((word32) a0 + 26) = (word16) (a4_19 | 16);
			a1.u0 = 0x01;
			a4_11 = a4_19 | 16;
			if (a2 == 0x00)
			{
				Eq_2 a0_67 = *((word32) a0 + 0x0078);
				if (a0_67 != 0x00)
				{
					struct Eq_409737 * s0_70;
					word32 s8_307;
					word32 s2_306;
					word32 a7_305;
					word32 a0_302;
					word32 a2_304;
					word32 a1_303;
					ra = pbuf_free(ra, a0_67, a3_10, a4_19 | 16, s4, mstatus, dwArg0118, out s0_70, out s1, out a0_302, out a1_303, out a2_304, out a3_10, out a4_11, out a5, out a7_305, out s2_306, out s3, out s4, out s5, out s6, out s8_307, out mstatus);
					s0_70->dw0078 = 0x00;
				}
				goto l2307191A;
			}
			goto l23071940;
		}
		if (a2 == 0x00)
		{
l2307191A:
			a0_162 = 0x00;
			goto l2307191C;
		}
		a5 = 0x07;
		if (a3_10 <= 0x07)
		{
			ui32 a4_16 = 0x01 << a3_10;
			a4_11 = a4_16 & 0x0098;
			if ((a4_16 & 0x0098) != 0x00)
			{
l23071940:
				ptr32 a0_39;
				Eq_2 a3_42;
				Eq_2 a4_43;
				ptr32 a5_44;
				ptr32 mstatus_47;
				ptr32 s1_49;
				ptr32 s3_53;
				Eq_2 s4_54;
				ptr32 s5_55;
				ptr32 s6_56;
				Eq_2 s7_57;
				word32 s11_313;
				word32 s8_310;
				word32 s10_312;
				word32 s9_311;
				word32 s2_309;
				word32 a1_308;
				Eq_2 ra_48 = tcp_close_shutdown(ra, a0, a1, dwArg10, a3_10, a4_11, s4, s7, mstatus, dwArg14, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, dwArg0128, out s1_49, out a0_39, out a1_308, out a3_42, out a4_43, out a5_44, out s2_309, out s3_53, out s4_54, out s5_55, out s6_56, out s7_57, out s8_310, out s9_311, out s10_312, out s11_313, out mstatus_47);
				s1Out = s1_49;
				a0Out = a0_39;
				a3Out = a3_42;
				a4Out = a4_43;
				a5Out = a5_44;
				s3Out = s3_53;
				s4Out = s4_54;
				s5Out = s5_55;
				s6Out = s6_56;
				s7Out = s7_57;
				mstatusOut = mstatus_47;
				return ra_48;
			}
		}
	}
	a0_162 = ~0x0A;
l2307191C:
	s1Out = s1;
	a0Out = a0_162;
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

