pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23071952: Register word32 tcp_slowtmr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArg010C, Register out ptr32 a3Out, Register out Eq_409846 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_tmr
word32 tcp_slowtmr(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArg010C, ptr32 & a3Out, union Eq_405847 & a4Out, ptr32 & mstatusOut)
{
	g_dw420278FC = (word32) g_t420268FC + 1;
	g_b4200F661 = (byte) ((word32) g_b4200F661 + 0x01);
	struct Eq_409862 * s2_222 = &g_w42027000;
	Eq_409846 a4_17 = 0x4200F661;
	byte * s5_225 = &g_b4200F661;
	Eq_2 s7_178 = 0x42027000;
	int32 s8_228 = 588003108;
	word32 s9_229 = 588036836;
	ra_162 = ra;
	mstatus_194 = mstatus;
	a0_208 = a0;
	a3_211 = a3;
l230719A6:
	ptr32 mstatus_718;
	Eq_2 a0_716;
	Eq_2 a2_714;
	Eq_2 a3_710;
	Eq_2 a3_211;
	Eq_2 a0_208;
	ptr32 mstatus_194;
	Eq_2 ra_162;
	struct Eq_409882 * s6_226 = &g_w42027000;
	Eq_2 s0_100 = g_t42026904;
	Eq_2 s10_124 = 0x07FFFFFE;
	Eq_2 s3_223 = 0x00;
	Eq_2 s4_224 = 0x07FFFFFF;
	while (true)
	{
		struct Eq_409893 * sp_204 = fp - 80;
		if (s0_100 == 0x00)
			break;
		Eq_2 s11_583;
		Eq_409846 a5_55 = (word32) *s5_225;
		a4_17 = (word32) *((word32) s0_100 + 30);
		if (a4_17 == a5_55)
		{
			s11_583 = *((word32) s0_100 + 0x0C);
			goto l230719FA;
		}
		Eq_2 a4_61;
		a3_211 = (word32) *((word32) s0_100 + 20);
		*((word32) s0_100 + 30) = (byte) a5_55;
		Eq_2 a5_60 = (word32) *((word32) s0_100 + 66);
		if (a3_211 == 0x02)
			a4_61.u0 = 0x05;
		else
			a4_61.u0 = 11;
		Eq_2 s1_219 = 0x01;
		if (a4_61 >= a5_60)
		{
			Eq_2 s1_68 = (word32) *((word32) s0_100 + 161);
			if (s1_68 != 0x00)
			{
				if ((word32) *((word32) s0_100 + 0x00A2) <= 11)
				{
					Eq_2 s1_242 = (word32) s1_68 + s9_229;
					uint32 a4_243 = (word32) *((word32) s1_242 - 1);
					uint32 a5_244 = (word32) *((word32) s0_100 + 0x00A0);
					if (a5_244 < a4_243)
					{
						uint32 a5_246 = a5_244 + 0x01 & 0x00FF;
						*((word32) s0_100 + 0x00A0) = (byte) a5_246;
						if (a5_246 < a4_243)
							goto l23071A68;
					}
					if ((word32) *((word32) s0_100 + 96) != 0x00)
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg104 = <invalid>;
						Eq_2 stackArg120 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg168 = <invalid>;
						Eq_2 stackArg184 = <invalid>;
						Eq_2 stackArg200 = <invalid>;
						Eq_2 stackArg216 = <invalid>;
						Eq_2 stackArg264 = <invalid>;
						Eq_2 stackArg280 = <invalid>;
						tcp_split_unsent_seg(ra, s0, a1, a3, a4, s5, s8, mstatus, stackArg88, stackArg104, stackArg120, stackArg136, stackArg152, stackArg168, stackArg184, stackArg200, stackArg216, stackArg264, stackArg280);
						a0_208 = s0_100;
						if (s0_100 != 0x00)
							goto l23071B58;
						word32 a1_2033;
						word32 a5_2035;
						word32 s11_2036;
						word32 a4_2034;
						word32 s1_2032;
						ra_162 = tcp_output(ra_162, s1_242, s0_100, a2, s7_178, mstatus_194, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_100, out s1_2032, out a0_208, out a1_2033, out a2, out a3_211, out a4_2034, out a5_2035, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out s10_124, out s11_2036, out mstatus_194);
						if (a0_208 != 0x00)
							goto l23071B58;
					}
					else
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg72 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg120 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg184 = <invalid>;
						Eq_2 stackArg200 = <invalid>;
						Eq_2 stackArg248 = <invalid>;
						Eq_2 stackArg296 = <invalid>;
						tcp_zero_window_probe(ra, a0, s4, s7, mstatus, stackArg72, stackArg88, stackArg120, stackArg136, stackArg152, stackArg184, stackArg200, stackArg248, stackArg296);
						a0_208 = s0_100;
						if (s0_100 == 0x00)
						{
l23071B58:
							up32 a5_293 = (word32) *((word32) s0_100 + 161);
							*((word32) s0_100 + 0x00A0) = 0x00;
							if (a5_293 <= 0x06)
								*((word32) s0_100 + 161) = (byte) (a5_293 + 0x01);
						}
					}
					goto l23071A68;
				}
				s1_219.u0 = 0x01;
				goto l23071A6A;
			}
			Eq_2 a5_69 = (int32) *((word32) s0_100 + 48);
			if (a5_69 >= 0x00)
			{
				if (a5_69 == s4_224)
					goto l23071B7A;
				((word32) s0_100 + 48)->u1 = (word16) ((word32) a5_69 + 1);
			}
			a4_61 = (int32) *((word32) s0_100 + 48);
			a5_69 = (int32) *((word32) s0_100 + 64);
			if (a4_61 >= a5_69)
			{
l23071B7A:
				struct Eq_410567 * a5_88;
				Eq_2 s1_90;
				word32 a4_2067;
				s0_100 = tcp_rexmit_rto_prepare(s1_68, a4_61, a5_69, out s1_90, out a0_208, out a2, out a3_211, out a4_2067, out a5_88, out s2_222, out s3_223, out s4_224, out s8_228);
				if (a0_208 != 0x00)
				{
					s0_100 = a5_88->t0070;
					if (a5_88 != null)
						goto l23071A68;
					s0_100 = a5_88->t006C;
					if (a5_88 != null)
						goto l23071B8E;
					goto l23071A68;
				}
l23071B8E:
				if ((word32) *((word32) s0_100 + 20) != 0x02)
				{
					int32 a5_108 = ((int32) *((word32) s0_100 + 60) >> 3) + (int32) (*((word32) s0_100 + 62));
					uint32 a4_109 = (word32) *((word32) s0_100 + 66);
					if (a4_109 > 0x0C)
						a4_109 = 0x0C;
					Eq_2 a5_119 = a5_108 << (word32) (*((word32) (a4_109 & 0x00FF) + s8_228));
					if (s10_124 < a5_119)
						a5_119 = s4_224;
					((word32) s0_100 + 64)->u1 = (word16) a5_119;
				}
				uint32 a4_135 = (word32) *((word32) s0_100 + 72);
				uint32 a5_136 = (word32) *((word32) s0_100 + 96);
				((word32) s0_100 + 48)->u1 = 0x00;
				if (a4_135 < a5_136)
					a5_136 = a4_135;
				ui32 a3_141 = (word32) *((word32) s0_100 + 50);
				uint32 a5_143 = a5_136 << 16;
				*((word32) s0_100 + 74) = (word16) (a5_143 >> 0x0011);
				uint32 a4_149 = a3_141 << 0x11 >> 16;
				if (a5_143 >> 0x0011 < a4_149)
					*((word32) s0_100 + 74) = (word16) a4_149;
				((word32) s0_100 + 72)->u2 = (word16) a3_141;
				*((word32) s0_100 + 0x006A) = 0x00;
				word32 a4_2068;
				word32 s11_2069;
				ra_162 = tcp_rexmit_rto_commit(ra_162, s1_90, s0_100, a2, s7_178, mstatus_194, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_100, out s1_219, out a0_208, out a2, out a3_211, out a4_2068, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out s10_124, out s11_2069, out mstatus_194);
			}
			else
			{
l23071A68:
				s1_219.u0 = 0x00;
			}
		}
l23071A6A:
		Eq_410113 a5_303 = (word32) *((word32) s0_100 + 20);
		if (a5_303 == 0x06 && ((word32) (*((word32) s0_100 + 26)) & 0x10) != 0x00)
		{
			s0_100 = *((word32) a3_211 + 32);
			a3_211.u0 = 40;
			if (s2_222->tFFFFF8FC - a3_211 > 40)
				s1_219 = (byte) s1_219.u0 + 1 & 0x00FF;
		}
		ui32 s11_329 = (word32) *((word32) s0_100 + 9);
		ui32 s11_330 = s11_329 & 8;
		if ((s11_329 & 8) != 0x00)
		{
			if (a5_303 != 0x04)
			{
				s11_330 = 0x00;
				if (a5_303 == 0x07)
					goto l23071AAC;
			}
			else
			{
l23071AAC:
				a0_208 = *((word32) s0_100 + 0x0098);
				struct Eq_410161 * a1_339 = *((word32) s0_100 + 0x0094);
				a2.u0 = 500;
				Eq_2 s0_346 = *((word32) a5_303 + 32);
				a3_211 = s2_222->tFFFFF8FC - a5_303;
				if (a0_208 + Mem301[s0_100 + 0x009C:int32] + a1_339 >>u 500 <u a3_211)
				{
					s1_219 = (byte) s1_219.u0 + 1 & 0x00FF;
					s11_330 = 0x01;
				}
				else
				{
					uint32 a5_353 = a1_339 + ((word32) a0_208 + (word32) (*((word32) s0_346 + 0x00A3)));
					s11_330 = 0x00;
					a5_303 = a5_353 >> 500;
					if (a5_353 >> 500 < a3_211)
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg16 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg104 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg168 = <invalid>;
						Eq_2 stackArg200 = <invalid>;
						Eq_2 stackArg216 = <invalid>;
						Eq_2 stackArg248 = <invalid>;
						Eq_2 stackArg264 = <invalid>;
						Eq_2 stackArg296 = <invalid>;
						tcp_keepalive(ra, s0, a0, s7, mstatus, stackArg16, stackArg88, stackArg104, stackArg136, stackArg152, stackArg168, stackArg200, stackArg216, stackArg248, stackArg264, stackArg296);
						a0_208 = s0_346;
						if (s0_346 == 0x00)
						{
							word32 a5_356 = (word32) *((word32) s0_346 + 0x00A3);
							*((word32) s0_346 + 0x00A3) = (byte) (a5_356 + 0x01);
							a5_303 = a5_356 + 0x01;
						}
					}
				}
			}
		}
		s0_100 = *((word32) a5_303 + 116);
		if (a5_303 != 0x00)
		{
			s0_100 = *((word32) a5_303 + 32);
			a3_211.u0 = 0x06;
			Eq_2 a4_371 = s2_222->tFFFFF8FC - a5_303;
			Eq_410201 a5_372 = (int32) *((word32) s0_100 + 64);
			if (a4_371 >= (word32) a5_372 + 6)
			{
				word32 a4_2037;
				s1_219 = tcp_free_ooseq(ra_162, 0x06, a4_371, (word32) a5_372 + 6, s4_224, mstatus_194, dwArg98, out a0_208, out a2, out a3_211, out a4_2037);
			}
		}
		word32 a5_411 = (word32) *((word32) s0_100 + 20);
		if (a5_411 == 0x03)
		{
			s0_100 = *(union Eq_2 *) 0x23;
			if (s2_222->tFFFFF8FC > 0x2B)
				s1_219 = (byte) s1_219.u0 + 1 & 0x00FF;
			goto l23071B1A;
		}
		Eq_410435 a5_422;
		Eq_410435 a4_423;
		if (a5_411 == 0x09)
		{
			s0_100 = *(union Eq_2 *) 0x29;
			a5_422 = s2_222->tFFFFF8FC - 0x09;
			a4_423.u0 = 0x00F0;
			goto l23071C5C;
		}
		Eq_410448 a4_414 = 0x05;
		if (a5_411 != 0x05)
		{
			a4_414.u0 = 0x08;
			if (a5_411 == 0x08)
				goto l23071CC4;
			goto l23071B1A;
		}
l23071CC4:
		s0_100 = a4_414.u0[32];
		a5_422 = s2_222->tFFFFF8FC - a4_414;
		a4_423.u0 = 0x0A;
l23071C5C:
		if (a4_423 < a5_422)
		{
l23071C60:
			Eq_2 a1_479;
			Eq_2 a2_480;
			word32 a0_2042;
			struct Eq_410360 * a5_477;
			Eq_2 a4_476;
			Eq_2 a3_481;
			tcp_pcb_purge(ra_162, s0_100, a3_211, s4_224, mstatus_194, dwArg88, dwArg98, dwArgC8, out a0_2042, out a1_479, out a2_480, out a3_481, out a4_476, out a5_477);
			if (s3_223 != 0x00)
				*((word32) s3_223 + 0x0C) = a5_477;
			else
				s6_226[0x0904] = (struct Eq_409882) a5_477;
			if (s11_330 != 0x00)
			{
				word32 a0_2045;
				word32 s1_2044;
				word32 s0_2043;
				ra_162 = tcp_rst(ra_162, *((word32) a1_479 + 80), a1_479, a2_480, s7_178, mstatus_194, dwLoc08, dwArg08, dwArg28, dwArg38, s7, s5, dwArg68, dwArg78, dwArgA8, dwArgD8, out s0_2043, out s1_2044, out a0_2045, out a3_481, out a4_476, out a5_477, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out mstatus_194);
			}
			Eq_2 s0_581 = a5_477[16];
			s11_583 = *((word32) s0_581 + 0x0C);
			word32 a5_596;
			word32 a1_2046;
			Eq_2 s1_597 = tcp_free(s0_581, a3_481, a4_476, mstatus_194, out a0_208, out a1_2046, out a2, out a3_211, out a4_17, out a5_596);
			*((word32) s7_178 + 0x090C) = 0x00;
			if (s1_597 != 0x00)
			{
				s1_597();
				if ((word32) *((word32) s7_178 - 0x06F4) != 0x00)
					goto l230719A6;
			}
			s0_100 = s3_223;
			goto l230719FA;
		}
l23071B1A:
		if (s1_219 != 0x00)
			goto l23071C60;
		a4_17 = (word32) *((word32) s0_100 + 29);
		s11_583 = *((word32) s0_100 + 0x0C);
		Eq_409846 a5_621 = (word32) *((word32) s0_100 + 28) + 0x01 & 0x00FF;
		*((word32) s0_100 + 28) = (byte) a5_621;
		if (a5_621 >= a4_17)
		{
			<anonymous> * a5_623 = *((word32) s0_100 + 0x008C);
			*((word32) s0_100 + 28) = 0x00;
			*((word32) s7_178 + 0x090C) = 0x00;
			if (a5_623 != null)
			{
				word32 s0_638 = *((word32) a0_208 + 16);
				word32 a7_719;
				word32 t1_720;
				word32 t4_721;
				word32 t5_722;
				word32 t6_723;
				a5_623();
				mstatus_194 = mstatus_718;
				a2 = a2_714;
				a0_208 = a0_716;
				a3_211 = a3_710;
				if ((word32) *((word32) s7_178 - 0x06F4) != 0x00)
					goto l230719A6;
				mstatus_194 = mstatus_718;
				a2 = a2_714;
				a0_208 = a0_716;
				a3_211 = a3_710;
				if (a0_716 != 0x00)
					goto l230719FA;
				a2 = a2_714;
				mstatus_194 = mstatus_718;
			}
			word32 a1_2039;
			word32 s3_2041;
			word32 a5_2040;
			word32 s1_2038;
			ra_162 = tcp_output(ra_162, s1_219, s0_100, a2, s7_178, mstatus_194, sp_204[88], sp_204[0x0068], sp_204[0x0088], sp_204[0x0094], sp_204[0x0098], sp_204[0x00A8], sp_204[0x00B8], sp_204[200], sp_204[0x00CC], sp_204[0x00D8], sp_204[232], sp_204[264], sp_204[268], sp_204[0x0118], out s0_100, out s1_2038, out a0_208, out a1_2039, out a2, out a3_211, out a4_17, out a5_2040, out s2_222, out s3_2041, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out s10_124, out s11_583, out mstatus_194);
			goto l230719FA;
		}
l230719FA:
		s3_223 = s0_100;
		s0_100 = s11_583;
	}
	Eq_2 s1_780 = g_t420268F8;
	while (s1_780 != 0x00)
	{
		Eq_2 s1_788 = *((word32) a4_17 + 32);
		if (s2_222->tFFFFF8FC - a4_17 > 0x00F0)
		{
			Eq_2 a4_798;
			Eq_2 a5_799;
			Eq_2 a3_803;
			word32 a1_2014;
			word32 a2_2015;
			word32 a0_2013;
			tcp_pcb_purge(ra_162, s1_788, a3_211, 0x00F0, mstatus_194, dwArg88, dwArg98, dwArgC8, out a0_2013, out a1_2014, out a2_2015, out a3_803, out a4_798, out a5_799);
			Eq_2 s1_806 = *((word32) a5_799 + 0x0C);
			if (s0_100 == 0x00)
				g_t420278F8 = a5_799;
			else
				*((word32) a5_799 + 0x0C) = s0_100;
			Eq_2 s5_813 = *((word32) s1_806 + 0x0C);
			word32 a0_2016;
			word32 a2_2018;
			word32 a5_2019;
			word32 a1_2017;
			tcp_free(s1_806, a3_803, a4_798, mstatus_194, out a0_2016, out a1_2017, out a2_2018, out a3_211, out a4_17, out a5_2019);
			s1_780 = s5_813;
		}
		else
		{
			s0_100 = s1_788;
			s1_780 = *((word32) s1_788 + 0x0C);
		}
	}
	0x00 = dwArg010C;
	a3Out = s2;
	a4Out = a4_17;
	mstatusOut = mstatus_194;
	return dwLoc4C;
}

