pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23071D1C: Register Eq_2 tcp_tmr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg010C, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      tcpip_tcp_timer
Eq_2 tcp_tmr(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg010C, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a0_12;
	Eq_2 a3_15;
	ptr32 mstatus_20;
	Eq_2 s1_23;
	Eq_2 s5_29;
	Eq_2 s7_31;
	Eq_2 ra_21 = tcp_fasttmr(ra, s1, a2, s2, s3, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s1_23, out a0_12, out a3_15, out s5_29, out s7_31, out mstatus_20);
	ui32 a5_45 = (word32) g_b4200F660 + 0x01 & 0x00FF;
	g_b4200F660 = (byte) a5_45;
	if ((a5_45 & 0x01) == 0x00)
	{
		a3Out = a3_15;
		a4Out = 0x4200F660;
		mstatusOut = mstatus_20;
		return s1_23;
	}
	else
	{
		Eq_2 a3_55;
		ptr32 a4_56;
		ptr32 mstatus_60;
		Eq_2 s1_63 = tcp_slowtmr(ra_21, a0_12, dwArg10, a3_15, s5_29, s7_31, mstatus_20, dwArg08, dwArg18, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArg010C, out a3_55, out a4_56, out mstatus_60);
		a3Out = a3_55;
		a4Out = a4_56;
		mstatusOut = mstatus_60;
		return s1_63;
	}
}

// 23071D4C: Register word32 tcp_get_next_optbyte(Register out Eq_2 a4Out)
// Called from:
//      tcp_parseopt.isra.0.part.1
word32 tcp_get_next_optbyte(union Eq_2 & a4Out)
{
	Eq_410851 a5_6 = (word32) g_w4200F678;
	g_w4200F678 = (word16) ((word32) a5_6 + 1);
	Eq_2 a4_10 = g_t4200F684;
	if (a4_10 != 0x00)
	{
		Eq_410851 a3_12 = (word32) g_w4200F680;
		if (a5_6 >= a3_12)
		{
			word32 a0_16 = CONVERT(Mem8[(a5_6 - a3_12 & 0x00FF) + a4_10:byte], byte, word32);
			a4Out = a4_10;
			return a0_16;
		}
	}
	Eq_2 a4_19 = g_t4200F67C;
	word32 a0_22 = CONVERT(Mem8[a5_6 + a4_19 + 20:byte], byte, word32);
	a4Out = a4_19;
	return a0_22;
}

// 23071D94: Register Eq_2 tcp_oos_insert_segment(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_410891) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_receive
Eq_2 tcp_oos_insert_segment(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, struct Eq_410891 * a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s0Out, ptr32 & mstatusOut)
{
	Eq_2 s1_103 = a5->t0010;
	word32 a5_273;
	Eq_2 a0_23 = lwip_htons((word32) a5->b000C | (word32) a5->b000D << 8, out a5_273);
	Eq_2 s2_105 = a1;
	Eq_2 a0_110 = a0_23 & 0x01;
	if ((a0_23 & 0x01) == 0x00)
	{
		while (true)
		{
			Eq_2 a4_42 = *((byte) s2_105.u0 + 16);
			Eq_2 a2_44 = g_t4200F674;
			int32 a1_57 = (word32) *((word32) a4_42 + 7) << 24 | ((word32) (*((word32) a4_42 + 6)) << 16 | ((word32) (*((word32) a4_42 + 4)) | (word32) (*((word32) a4_42 + 5)) << 8));
			int32 a5_49 = (word32) a2_44 + (word32) (*((word32) s1_103 + 8));
			Eq_2 a3_60 = a5_49 - ((word32) (*((byte) s2_105.u0 + 8)) + a1_57);
			if (a3_60 < 0x00)
				break;
			struct Eq_410943 * a5_66;
			if ((lwip_htons((word32) *((word32) a4_42 + 0x0C) | (word32) (*((word32) a4_42 + 0x0D)) << 8, out a5_66) & 0x01) != 0x00)
			{
				struct Eq_411027 * a5_75;
				uint32 a0_79 = (word32) (word16) (lwip_htons(0x01, out a5_75) | ((word32) a5_66->b000D << 8 | (word32) a5_66->b000C));
				a5_75->b000C = (byte) a0_79;
				a5_75->b000D = (byte) (a0_79 >> 8);
			}
			s0 = *s2_105;
			word32 a1_288;
			word32 a2_289;
			word32 a4_291;
			word32 a3_290;
			word32 a5_292;
			s1_103 = tcp_seg_free(ra, s2_105, a3_60, a4_42, s4, mstatus, dwArgE8, out a0_110, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292);
			if (s0 == 0x00)
				goto l23071E24;
			s2_105 = s0;
		}
		if (a5_49 - a1_57 > 0x00)
		{
			Eq_2 a1_112 = (word32) (word16) (a1_57 - a2_44);
			*((word32) *((word32) a0_110 + 4) + 8) = (word16) a1_112;
			word32 s8_287;
			word32 s6_286;
			word32 s4_284;
			word32 s5_285;
			word32 s3_283;
			word32 a4_281;
			word32 a5_282;
			word32 a3_280;
			word32 a2_279;
			ra = pbuf_realloc(ra, s0, a0_110, a1_112, a3_60, a4_42, s2_105, 0x4200F000, s4, mstatus, dwLoc0C, dwArg78, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0148, out s1_103, out a2_279, out a3_280, out a4_281, out a5_282, out s2_105, out s3_283, out s4_284, out s5_285, out s6_286, out s8_287, out mstatus);
		}
	}
	else
	{
		word32 a5_278;
		word32 a4_277;
		word32 a1_275;
		word32 a3_276;
		word32 a0_274;
		s1_103 = tcp_segs_free(ra, s0, a1, a3, a4, s4, mstatus, dwArgD8, out a0_274, out a1_275, out a3_276, out a4_277, out a5_278);
l23071E24:
		s2_105.u0 = 0x00;
	}
	*s1_103 = s2_105;
	s0Out = s0;
	mstatusOut = mstatus;
	return ra;
}

// 23071E72: Register word32 tcp_parseopt.isra.0.part.1(Register (ptr32 Eq_411102) a0, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_411104) s1Out, Register out (ptr32 Eq_411102) a0Out, Register out (ptr32 Eq_411106) a4Out, Register out (ptr32 int32) s2Out, Register out (ptr32 Eq_411102) s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 Eq_2) s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_411112) s7Out, Register out (ptr32 uint16) s8Out)
// Called from:
//      tcp_input
word32 tcp_parseopt.isra.0.part.1(struct Eq_411102 * a0, Eq_2 dwArg0128, struct Eq_411104 & s1Out, struct Eq_411102 & a0Out, struct Eq_411106 & a4Out, int32 & s2Out, struct Eq_411102 & s3Out, byte & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, struct Eq_411112 & s7Out, uint16 & s8Out)
{
	g_w4200F678 = 0x00;
	a0_156 = a0;
	while (true)
	{
		struct Eq_411102 * a0_156;
		Eq_411134 s0_37 = (word32) g_w4200F688;
		if ((word32) g_w4200F678 >= s0_37)
			break;
		a0_156 = tcp_get_next_optbyte(out a4);
		if (a0_156 == (struct Eq_411102 *) 0x01)
			continue;
		if ((int32) (byte) a0_156 == 0x00)
			break;
		if (a0_156 == (struct Eq_411102 *) 0x02)
		{
			a0_156 = tcp_get_next_optbyte(out a4);
			if (a0_156 != (struct Eq_411102 *) 0x04 || (word32) g_w4200F678 + 0x01 >= s0_37)
				break;
			word32 a4_183;
			a0_156 = (word32) (word16) (tcp_get_next_optbyte(out a4) | (tcp_get_next_optbyte(out a4_183) << 0x18) >> 16);
			if ((word32) (word16) ((char *) a0_156 - 1) > 687)
				a0_156 = (struct Eq_411102 *) 688;
			a0->w0000 = (word16) a0_156;
			continue;
		}
		a0_156 = tcp_get_next_optbyte(out a4);
		if (a0_156 <= (struct Eq_411102 *) 0x01)
			break;
		g_w4200F678 = (word16) (a0_156 + ((word32) g_w4200F678 + ~0x01) / 20);
	}
	0x00 = (int8) dwArg0128;
	s1Out = (struct Eq_411104 *) &g_w4200F678;
	a0Out = a0_156;
	a4Out = a4;
	s2Out = (int32 *) &g_t4200F000;
	s3Out = a0;
	s4Out = dwArg78;
	s5Out = (union Eq_2 *) 0x01;
	s6Out = 0x02;
	s7Out = (struct Eq_411112 *) 0x04;
	s8Out = s5;
	return s4;
}

// 23071F32: Register Eq_2 tcp_input_delayed_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Register out Eq_2 s1Out, Register out (ptr32 Eq_411219) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_input
Eq_2 tcp_input_delayed_close(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, union Eq_2 & s1Out, struct Eq_411219 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (((word32) g_b4200F670 & 0x10) == 0x00)
	{
		s1Out = s1;
		a0Out = null;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 ra_23;
		ui32 a5_14 = (word32) *((word32) a0 + 26);
		Eq_2 s0_15 = a0;
		Eq_2 a5_16 = a5_14 & 0x10;
		ra_23 = ra;
		if ((a5_14 & 0x10) == 0x00)
		{
			a5_16 = *((word32) a0 + 144);
			ra_23 = ra;
			if (a5_16 != 0x00)
			{
				word32 a2_26;
				word32 s1_93;
				word32 tp_94;
				word32 a6_95;
				word32 a7_96;
				word32 s10_97;
				word32 s11_98;
				word32 s2_99;
				word32 s3_100;
				word32 s5_101;
				word32 s6_102;
				word32 s8_103;
				word32 s9_104;
				word32 t0_105;
				word32 t1_106;
				word32 t3_107;
				word32 t4_108;
				word32 t5_109;
				word32 t6_110;
				a5_16();
			}
		}
		Eq_2 a3_48;
		Eq_2 a4_49;
		ptr32 mstatus_55;
		ptr32 s10_57;
		ptr32 s11_58;
		ptr32 s2_59;
		ptr32 s3_60;
		Eq_2 s4_61;
		ptr32 s5_62;
		ptr32 s6_63;
		Eq_2 s7_64;
		ptr32 s8_65;
		union Eq_2 * s9_66;
		word32 s1_207;
		word32 a0_208;
		Eq_2 ra_56 = tcp_pcb_remove(ra_23, s0_15, a3, a4, a5_16, s4, s7, mstatus, dwArg38, dwArg48, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s1_207, out a0_208, out a3_48, out a4_49, out s2_59, out s3_60, out s4_61, out s5_62, out s6_63, out s7_64, out s8_65, out s9_66, out s10_57, out s11_58, out mstatus_55);
		Eq_2 a3_77;
		Eq_2 a4_78;
		word32 a0_209;
		word32 a1_210;
		word32 a2_211;
		word32 a5_212;
		s1Out = tcp_free(s0_15, a3_48, a4_49, mstatus_55, out a0_209, out a1_210, out a2_211, out a3_77, out a4_78, out a5_212);
		a0Out = (struct Eq_411219 *) 0x01;
		a2Out = dwArg10;
		a3Out = a3_77;
		a4Out = a4_78;
		s2Out = s2_59;
		s3Out = s3_60;
		s4Out = s4_61;
		s5Out = s5_62;
		s6Out = s6_63;
		s7Out = s7_64;
		s8Out = s8_65;
		s9Out = s9_66;
		s10Out = s10_57;
		s11Out = s11_58;
		mstatusOut = mstatus_55;
		return ra_56;
	}
}

// 23071F7C: Register Eq_2 tcp_free_acked_segments.isra.3(Register Eq_2 ra, Register (ptr32 uint16) a0, Register Eq_2 a1, Register (ptr32 Eq_411342) a4, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_411347 a2Out, Register out (ptr32 Eq_411342) a4Out, Register out Eq_2 a5Out, Register out (ptr32 uint16) s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 uint16) s4Out, Register out Eq_2 s5Out)
// Called from:
//      tcp_receive
Eq_2 tcp_free_acked_segments.isra.3(Eq_2 ra, uint16 * a0, Eq_2 a1, struct Eq_411342 * a4, ptr32 mstatus, Eq_2 dwArgE8, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_411347 & a2Out, struct Eq_411342 & a4Out, union Eq_2 & a5Out, uint16 & s2Out, union Eq_2 & s3Out, uint16 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s0_21 = a1;
	while (s0_21 != 0x00)
	{
		struct Eq_411360 * a5_41;
		word32 a3_151;
		Eq_2 a0_38 = lwip_htonl((word32) a4->t0007 << 24 | ((word32) a4->t0006 << 16 | ((word32) a4->b0005 << 8 | (word32) a4->b0004)), out a3_151, out a4, out a5_41);
		s0_21 = a5_41->t0010;
		word32 s1_44 = (word32) *((word32) s0_21 + 8);
		word32 a5_152;
		Eq_2 a0_49 = lwip_htons((word32) a5_41->b000C | (word32) a5_41->b000D << 8, out a5_152);
		a5 = g_t4200F664;
		Eq_2 a0_54 = (word32) ((a0_49 & 0x03) != 0x00);
		s5 = a0_38;
		s1 = (word32) a0_54 + ((word32) a0_38 + (s1_44 - a5));
		if (s1 > 0x00)
			break;
		Eq_2 s0_59 = *s1;
		word32 a0_60 = pbuf_clen(a0_54);
		Eq_2 a3_66 = (word32) g_w4200F66A;
		*a0 = (word16) ((word32) *a0 - a0_60);
		g_w4200F66A = (word16) ((word32) a3_66 + (word32) (*((word32) s0_59 + 8)));
		s0_21 = s1;
		word32 a0_153;
		word32 a2_154;
		word32 a3_155;
		s1 = tcp_seg_free(ra, s0_59, a3_66, 0x4200F66A, 0x4200F000, mstatus, dwArgE8, out a0_153, out a1, out a2_154, out a3_155, out a4, out a5);
	}
	a0Out = s0_21;
	a1Out = a1;
	a2Out = dwArg48;
	a4Out = a4;
	a5Out = a5;
	s2Out = a0;
	s3Out = &g_t4200F000;
	s4Out = dwArg04;
	s5Out = s5;
	return s1;
}

