pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307202C: Register Eq_2 tcp_receive(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_411505) a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_input
Eq_2 tcp_receive(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, struct Eq_411505 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s5_115;
	ui32 a5_5 = (word32) g_b4200F668;
	Eq_2 s3_113 = 0x4200F674;
	Eq_2 s4_114 = 0x4200F68A;
	s5_115 = s5;
	if ((a5_5 & 0x10) == 0x00)
	{
l230721B6:
		struct Eq_411505 * a4_1573;
		ui32 a5_1574;
		ui32 a5_1575;
		Eq_2 a2_430 = (word32) *s4_114;
		Eq_2 s0_1445 = *((word32) a3 + 36);
		Eq_2 a5_450 = *s3_113;
		if (a2_430 == 0x00 || (word32) (*((word32) s0_1445 + 20)) > 0x06)
		{
			a4_1573 = a5_450 - a3;
			if (a4_1573 >= null)
			{
				a4_1573 = (word32) *((word32) s0_1445 + 40);
				if ((word32) a5_450 + 1 - a3 - a4_1573 <= 0x00)
				{
l23072778:
					0x00 = (int8) dwArg0128;
					s0Out.u0 = <invalid>;
					s1Out = s1;
					a0Out = a0;
					a3Out = a3;
					a4Out = a4_1573;
					s2Out = s2;
					s3Out = s3_113;
					s4Out = dwArg78;
					s5Out = s5_115;
					s6Out = s6;
					s7Out = s7;
					s8Out = s5;
					s9Out = s9;
					mstatusOut = mstatus;
					return ra;
				}
			}
			a5_1575 = (word32) *((word32) s0_1445 + 26);
			goto l23072766;
		}
		Eq_2 a1_465 = a3 - a5_450;
		Eq_2 a4_1169 = (word32) a1_465 - 1;
		if (a1_465 >= ~0x00)
		{
			a4_1169 = (word32) a3 + ((0x01 - a5_450) - a2_430);
			if (a4_1169 <= 0x00)
			{
				Eq_2 a1_483 = (word32) (word16) a1_465;
				*((word32) *((word32) a0 + 4) + 8) = (word16) ((word32) g_w4201B274 - a1_483);
				word32 a5_496 = (word32) (word16) ((word32) *((word32) a0 + 8) - a1_483);
				while (true)
				{
					Eq_2 a4_499 = (word32) *((word32) a0 + 0x0A);
					if (a4_499 >= a1_483)
						break;
					((word32) a0 + 8)->u2 = (word16) a5_496;
					((word32) a0 + 0x0A)->u2 = 0x00;
					a1_483 = (word32) (word16) (a1_483 - a4_499);
					a0 = *a0;
				}
				Eq_2 a5_510;
				word32 a3_3025;
				pbuf_remove_header(a0, a1_483, a2_430, out a1_465, out a3_3025, out a4_1169, out a5_510);
				s1 = *((word32) a4_1169 + 16);
				*s3_113 = a5_510;
				*((word32) a4_1169 + 4) = (byte) a5_510;
				*((word32) a4_1169 + 5) = (byte) (a5_510 >> 0x08);
				*((word32) a4_1169 + 6) = (byte) (a5_510 >> 0x10);
				*((word32) a4_1169 + 7) = (byte) (a5_510 >> 24);
l2307223A:
				Eq_2 a5_528 = *s3_113;
				Eq_2 s0_531 = *((word32) a4_1169 + 36);
				if (a5_528 - a4_1169 >= 0x00)
				{
					struct Eq_406233 * a2_1168 = (word32) *((word32) s0_531 + 40);
					Eq_2 a3_1173 = (word32) a5_528 + 1 - a4_1169 - a2_1168;
					if (a3_1173 <= 0x00)
					{
						if (a5_528 == a4_1169)
						{
							struct Eq_411755 * a5_1084 = g_ptr4201B27C;
							Eq_2 s2_1083 = (word32) g_w4201B274;
							word32 a5_3026;
							word32 a0_1094 = (word32) s2_1083 + (word32) ((lwip_htons((word32) a5_1084->b000C | (word32) a5_1084->b000D << 8, out a5_3026) & 0x03) != 0x00);
							struct Eq_411784 * a5_1096 = (word32) *((word32) s0_531 + 40);
							struct Eq_411784 * a0_1097 = (word32) (word16) a0_1094;
							s4_114->u2 = (word16) a0_1097;
							if (a5_1096 < a0_1097)
							{
								Eq_2 s1_1099 = a5_1096->t0010;
								struct Eq_411807 * a5_1105;
								if ((lwip_htons((word32) a5_1096->b000C | (word32) a5_1096->b000D << 8, out a5_1105) & 0x01) != 0x00)
								{
									Eq_2 s2_1111 = (word32) a5_1105->b000D << 8 | (word32) a5_1105->b000C;
									word32 a5_3028;
									word32 a5_3029;
									Eq_2 a0_1116 = lwip_htons(lwip_htons(s2_1111, out a5_3028) & 62, out a5_3029);
									s1_1099 = *((word32) a4_1169 + 16);
									uint32 a0_1124 = (word32) (word16) (s2_1111 & 0xFC0000FF | a0_1116);
									*((word32) a4_1169 + 0x0C) = (byte) a0_1124;
									*((word32) a4_1169 + 0x0D) = (byte) (a0_1124 >> 8);
									s2_1083 = s2_1111 & 0xFC0000FF;
								}
								struct Eq_411826 * a5_1130 = (word32) *((word32) s0_531 + 40);
								*((word32) s1_1099 + 8) = (word16) a5_1130;
								struct Eq_411835 * s1_1133 = a5_1130->ptr0010;
								word32 a5_3027;
								Eq_2 a0_1138 = lwip_htons((word32) a5_1130->b000C | (word32) a5_1130->b000D << 8, out a5_3027);
								if ((a0_1138 & 0x02) != 0x00)
									s1_1133->w0008 = (word16) ((word32) s1_1133->w0008 + ~0x00);
								struct Eq_411907 * a5_1166;
								word32 s2_3031;
								word32 s8_3034;
								word32 s5_3032;
								word32 s6_3033;
								word32 s1_3030;
								ra = pbuf_realloc(ra, s0_531, a0_1138 & 0x02, (word32) s1_1133->w0008, a3_1173, a4_1169, s2_1083, s3_113, s4_114, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_3030, out a2_1168, out a3_1173, out a4_1169, out a5_1166, out s2_3031, out s3_113, out s4_114, out s5_3032, out s6_3033, out s8_3034, out mstatus);
								s2_1083 = (word32) a5_1166->ptr0010->w0008 + (word32) ((lwip_htons((word32) a5_1166->b000C | (word32) a5_1166->b000D << 8, out a5_1096) & 0x03) != 0x00);
								s4_114->u2 = (word16) s2_1083;
							}
							Eq_2 s0_1204 = a5_1096->t0074;
							if (a5_1096 != null)
							{
								Eq_2 s1_1205 = a5_1096->t0010;
								struct Eq_412019 * a5_1211;
								Eq_2 a0_1210 = lwip_htons((word32) a5_1096->b000C | (word32) a5_1096->b000D << 8, out a5_1211);
								struct Eq_412035 * a0_1212 = a0_1210 & 0x01;
								if ((a0_1210 & 0x01) == 0x00)
								{
									Eq_2 s5_1233 = *((word32) s0_1204 + 116);
									while (true)
									{
										Eq_2 a1_1236 = *s3_113;
										Eq_2 a4_1239 = (word32) a1_1236 + (word32) (*s4_114);
										if (s5_1233 == 0x00)
											break;
										Eq_2 a3_1241 = *((word32) s5_1233 + 16);
										ui32 a5_1251 = (word32) *((word32) a3_1241 + 7) << 24 | ((word32) (*((word32) a3_1241 + 6)) << 16 | ((word32) (*((word32) a3_1241 + 4)) | (word32) (*((word32) a3_1241 + 5)) << 8));
										a2_1168 = a4_1239 - ((word32) (*((word32) s5_1233 + 8)) + a5_1251);
										if (a2_1168 < null)
										{
											Eq_2 a4_1319 = a4_1239 - a5_1251;
											if (a4_1319 > 0x00)
											{
												struct Eq_412115 * a5_1320 = a5_1251 - a1_1236;
												*((word32) s1_1205 + 8) = (word16) a5_1320;
												struct Eq_412122 * s1_1323 = a5_1320->ptr0010;
												word32 a5_3037;
												Eq_2 a0_1328 = lwip_htons((word32) a5_1320->b000C | (word32) a5_1320->b000D << 8, out a5_3037);
												if ((a0_1328 & 0x02) != 0x00)
													s1_1323->w0008 = (word16) ((word32) s1_1323->w0008 + ~0x00);
												struct Eq_412146 * a5_1352;
												word32 a4_3040;
												word32 s2_3041;
												word32 s6_3042;
												word32 s8_3043;
												word32 s1_3038;
												word32 a3_3039;
												ra = pbuf_realloc(ra, s0_1204, a0_1328 & 0x02, (word32) s1_1323->w0008, a3_1241, a4_1319, s2_1083, s3_113, s4_114, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_3038, out a2_1168, out a3_3039, out a4_3040, out a5_1352, out s2_3041, out s3_113, out s4_114, out s5_1233, out s6_3042, out s8_3043, out mstatus);
												word32 a5_3044;
												s4_114->u2 = (word16) ((word32) a5_1352->ptr0010->w0008 + (word32) ((lwip_htons((word32) a5_1352->b000C | (word32) a5_1352->b000D << 8, out a5_3044) & 0x03) != 0x00));
											}
											break;
										}
										struct Eq_412092 * a5_1260;
										if ((lwip_htons((word32) *((word32) a3_1241 + 0x0C) | (word32) (*((word32) a3_1241 + 0x0D)) << 8, out a5_1260) & 0x01) != 0x00)
										{
											struct Eq_412313 * a5_1268;
											if ((lwip_htons((word32) a5_1260->b000C | (word32) a5_1260->b000D << 8, out a5_1268) & 0x02) == 0x00)
											{
												struct Eq_412332 * a5_1277;
												uint32 a0_1281 = (word32) (word16) ((word32) a5_1268->b000D << 8 | (word32) a5_1268->b000C | lwip_htons(0x01, out a5_1277));
												a5_1277->b000C = (byte) a0_1281;
												a5_1277->b000D = (byte) (a0_1281 >> 8);
												word32 a5_3054;
												s4_114->u2 = (word16) ((word32) a5_1277->ptr0010->w0008 + (word32) ((lwip_htons((word32) a5_1277->b000C | (word32) a5_1277->b000D << 8, out a5_3054) & 0x03) != 0x00));
											}
										}
										s2_1083 = *s5_1233;
										word32 a0_3049;
										word32 a1_3050;
										word32 a5_3053;
										word32 a3_3051;
										word32 a4_3052;
										s1_1205 = tcp_seg_free(ra, s5_1233, a3_1241, a4_1239, s4_114, mstatus, dwArgD8, out a0_3049, out a1_3050, out a2_1168, out a3_3051, out a4_3052, out a5_3053);
										s5_1233 = s2_1083;
									}
									*((word32) s0_1204 + 116) = s5_1233;
								}
								else
								{
									while (true)
									{
										s0_1204 = a0_1212->t0074;
										if (a0_1212 == null)
											break;
										Eq_2 a0_1217 = a5_1211->t0000;
										a5_1211->t0074 = s0_1204;
										word32 a1_3055;
										tcp_seg_free(ra, a0_1217, a3_1173, a4_1169, s4_114, mstatus, dwArgD8, out a0_1212, out a1_3055, out a2_1168, out a3_1173, out a4_1169, out a5_1211);
									}
								}
							}
							Eq_2 a3_1395 = (word32) *s4_114;
							word32 a5_1404 = (word32) *((word32) s0_1204 + 40) - a3_1395;
							Mem1406[Mem1394[s3_113 + 0x00:int32] + a3_1395 + 36:word32] = s0_1204;
							((word32) s0_1204 + 40)->u2 = (word16) a5_1404;
							struct Eq_411995 * a5_1417;
							word32 a1_3035;
							word32 a4_3036;
							tcp_update_rcv_ann_wnd(s0_1204, a2_1168, a3_1395, out a1_3035, out a3, out a4_3036, out a5_1417);
							struct Eq_412004 * s1_1419 = a5_1417->ptr0004;
							struct Eq_412008 * a4_1420 = (word32) a5_1417->w0008;
							if (a4_1420 != null)
							{
								g_ptr4200F66C = a5_1417;
								s1_1419->dw0004 = 0x00;
								a4_1420 = (struct Eq_412008 *) &g_t4200F000;
							}
							s1 = a5_1417->t0010;
							word32 a5_3056;
							Eq_2 a0_1431 = lwip_htons((word32) a5_1417->b000C | (word32) a5_1417->b000D << 8, out a5_3056);
							a0 = a0_1431 & 0x01;
							if ((a0_1431 & 0x01) != 0x00)
							{
								ui32 a4_1436 = (word32) g_b4200F670;
								g_b4200F670 = (byte) (a4_1436 | 32);
								a4_1420 = a4_1436 | 32;
							}
							s2.u0 = 0x4200F000;
							s5_115.u0 = 0x04;
							s6 = 0x07;
							while (true)
							{
								s0_1445 = *((byte) s1.u0 + 116);
								if (s1 == 0x00)
									break;
								a3 = (word32) a4_1420->b0005 << 8 | (word32) a4_1420->b0004 | (word32) a4_1420->t0006 << 16;
								s1 = a4_1420->t0010;
								Eq_2 a5_1457 = (word32) a4_1420->t0007 << 24 | a3;
								s0_1445 = *((word32) a3 + 36);
								if (a5_1457 != a3)
									break;
								*s3_113 = a5_1457;
								int32 s7_1463 = (word32) *((byte) s1.u0 + 8);
								struct Eq_412961 * a5_1467;
								Eq_2 a0_1466 = lwip_htons((word32) a4_1420->b000C | (word32) a4_1420->t000D << 8, out a5_1467);
								Eq_2 s0_1468 = a5_1467->t0024;
								(a5_1467 + s7_1463 / 40 + (word32) ((a0_1466 & 0x03) != 0x00) / 40)->t0024 = s0_1468;
								struct Eq_412991 * a5_1480;
								lwip_htons((word32) a5_1467->b000C | (word32) a5_1467->b000D << 8, out a5_1480);
								s7 = (word32) a5_1480->ptr0010->w0008;
								word32 a5_3086;
								((word32) s0_1468 + 40)->u2 = (word16) ((word32) *((word32) s0_1468 + 40) - ((word32) s7 + (word32) ((lwip_htons((word32) a5_1480->b000C | (word32) a5_1480->b000D << 8, out a5_3086) & 0x03) != 0x00)));
								Eq_2 a1_1498;
								Eq_2 a3_1499;
								word32 a5_3087;
								Eq_2 a4_1500;
								Eq_2 a0_1497 = tcp_update_rcv_ann_wnd(s0_1468, a2_1168, a3, out a1_1498, out a3_1499, out a4_1500, out a5_3087);
								struct Eq_413054 * s1_1503 = *((word32) a1_1498 + 4);
								struct Eq_413058 * a5_1504 = (word32) *((word32) a1_1498 + 8);
								if (a5_1504 != null)
								{
									a5_1504 = (struct Eq_413058 *) *a0_1497;
									if (a0_1497 != 0x00)
										pbuf_cat(a0_1497, a1_1498, a4_1500);
									else
										*a1_1498 = a5_1504;
									s1_1503->dw0004 = 0x00;
								}
								struct Eq_413073 * a5_1518;
								if ((lwip_htons((word32) a5_1504->b000C | (word32) a5_1504->b000D << 8, out a5_1518) & 0x01) != 0x00)
								{
									g_b4200F670 = (byte) ((word32) g_b4200F670 | 32);
									a4_1500.u0 = 0x4200F670;
									a5_1518 = (word32) *((word32) s0_1468 + 20);
									if (a5_1518 == (struct Eq_413073 *) 0x04)
										*((word32) s0_1468 + 20) = 0x07;
								}
								Eq_2 s1_1539 = a5_1518->t0000;
								a5_1518->t0074 = s0_1468;
								word32 a1_3088;
								word32 a5_3089;
								s1 = tcp_seg_free(ra, s1_1539, a3_1499, a4_1500, 0x4200F000, mstatus, dwArgD8, out a0, out a1_3088, out a2_1168, out a3, out a4_1420, out a5_3089);
							}
							ui32 a5_1572 = (word32) *((word32) s0_1445 + 26);
							a4_1573 = a5_1572 & 1;
							if ((a5_1572 & 1) == 0x00)
							{
								a5_1574 = a5_1572 | 1;
								goto l23072774;
							}
							a5_1575 = a5_1572 & ~0x01;
l23072766:
							a5_1574 = a5_1575 | 2;
l23072774:
							((word32) s0_1445 + 26)->u2 = (word16) a5_1574;
							goto l23072778;
						}
						s0_531 = *((byte) s1.u0 + 116);
						Eq_2 s2_547 = 0x00;
						if (s1 == 0x00)
						{
							struct Eq_412251 * a0_975;
							word32 s1_3045;
							word32 a5_3048;
							word32 a3_3046;
							word32 a4_3047;
							s0_531 = tcp_seg_copy(s1, a1_465, a3_1173, a4_1169, mstatus, out s1_3045, out a0_975, out a3_3046, out a4_3047, out a5_3048);
							a0_975->t0074 = s0_531;
						}
						else
						{
							do
							{
								Eq_2 a3_583;
								Eq_2 a4_616;
								Eq_2 a1_652;
								struct Eq_410891 * a5_612;
								Eq_2 s1_859;
								Eq_2 a3_558 = (word32) a2_1168->b0005 << 8 | (word32) a2_1168->b0004 | (word32) a2_1168->b0006 << 16;
								Eq_2 s1_551 = a2_1168->t0010;
								Eq_2 a4_561 = (word32) a2_1168->b0007 << 24 | a3_558;
								if (a5_528 == a4_561)
								{
									Eq_2 a4_875 = (word32) g_w4201B274;
									if ((word32) *((word32) s1_551 + 8) >= a4_875)
										goto l230727A6;
									Eq_2 a0_887;
									s0_531 = tcp_seg_copy(s1_551, a1_465, a3_558, a4_875, mstatus, out s1_859, out a0_887, out a3_583, out a4_616, out a5_612);
									if (a0_887 == 0x00)
										goto l230727A6;
									if (s2_547 != 0x00)
										*s2_547 = a0_887;
									else
										*((word32) a0_887 + 116) = s0_531;
									goto l2307280A;
								}
								Eq_2 a3_576;
								if (s2_547 == 0x00)
								{
									a3_576 = a5_528 - a4_561;
									if (a3_576 >= 0x00)
										goto l230728C0;
									struct Eq_412447 * a0_863;
									s0_531 = tcp_seg_copy(s1_551, a1_465, a3_576, a4_561, mstatus, out s1_859, out a0_863, out a3_583, out a4_616, out a5_612);
									if (a0_863 == null)
										goto l230727A6;
									a0_863->t0074 = s0_531;
l2307280A:
									a1_652 = s1_859;
									goto l2307280C;
								}
								struct Eq_412404 * a7_564 = *((word32) s2_547 + 16);
								a1_465 = (word32) a7_564->b0005 << 8 | (word32) a7_564->b0004 | (word32) a7_564->b0006 << 16;
								a3_576 = (word32) a5_528 - 1 - ((word32) a7_564->b0007 << 24 | a1_465);
								if (a3_576 >= 0x00)
								{
									a3_576 = (word32) a5_528 + 1 - a4_561;
									if (a3_576 > 0x00)
										goto l230728C0;
									Eq_2 a0_591;
									word32 a5_3068;
									word32 a4_3067;
									Eq_2 s1_587;
									s0_531 = tcp_seg_copy(s1_551, a1_465, a3_576, a4_561, mstatus, out s1_587, out a0_591, out a3_583, out a4_3067, out a5_3068);
									s4_114 = a0_591;
									if (a0_591 == 0x00)
										goto l230727A6;
									struct Eq_412404 * a4_601 = *((word32) s2_547 + 16);
									a5_612 = (word32) a4_601->b0006 << 16 | ((word32) a4_601->b0004 | (word32) a4_601->b0005 << 8) | (word32) a4_601->b0007 << 24;
									Eq_2 a1_614 = *s3_113;
									a4_616 = a5_612 + (word32) (*((word32) s2_547 + 8)) / 20 - a1_614;
									if (a4_616 > 0x00)
									{
										Eq_2 a0_619 = *((word32) s2_547 + 4);
										Eq_2 a1_620 = (word32) (word16) (a1_614 - a5_612);
										((word32) s2_547 + 8)->u2 = (word16) a1_620;
										word32 a2_3069;
										word32 s6_3072;
										word32 s8_3073;
										word32 s5_3071;
										word32 s3_3070;
										ra = pbuf_realloc(ra, s0_531, a0_619, a1_620, a3_583, a4_616, s2_547, s3_113, a0_591, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_587, out a2_3069, out a3_583, out a4_616, out a5_612, out s2_547, out s3_3070, out s4_114, out s5_3071, out s6_3072, out s8_3073, out mstatus);
									}
									*s2_547 = s4_114;
									a1_652 = s1_587;
l2307280C:
									ra = tcp_oos_insert_segment(ra, s0_531, a1_652, a3_583, a4_616, a5_612, s4_114, mstatus, dwArg48, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArg0118, out s0_531, out mstatus);
									goto l230727A6;
								}
l230728C0:
								Eq_2 s1_657 = *a3_576;
								s2_547 = s1_657;
							} while (a3_576 != 0x00);
							if (a5_528 - a4_561 > 0x00)
							{
								word32 a5_3057;
								if ((lwip_htons((word32) a2_1168->b000C | (word32) a2_1168->b000D << 8, out a5_3057) & 0x01) == 0x00)
								{
									Eq_2 a3_679;
									struct Eq_412545 * a4_680;
									word32 s1_683;
									Eq_2 a0_687;
									word32 a5_3058;
									s0_531 = tcp_seg_copy(s1_657, a1_465, a3_576, a4_561, mstatus, out s1_683, out a0_687, out a3_679, out a4_680, out a5_3058);
									*a0_687 = s1_683;
									if (a0_687 != 0x00)
									{
										int32 a5_708 = (word32) a4_680->b0006 << 16 | ((word32) a4_680->b0004 | (word32) a4_680->b0005 << 8) | (word32) a4_680->b0007 << 24;
										Eq_2 a1_710 = *s3_113;
										Eq_2 a4_712 = (word32) a4_680->ptr0010->w0008 + a5_708 - a1_710;
										if (a4_712 > 0x00)
										{
											Eq_2 a1_716 = (word32) (word16) (a1_710 - a5_708);
											*((word32) *((word32) a0_687 + 4) + 8) = (word16) a1_716;
											word32 a5_3063;
											word32 s5_3064;
											word32 s6_3065;
											word32 a3_3061;
											word32 a4_3062;
											word32 a2_3060;
											word32 s1_3059;
											word32 s8_3066;
											ra = pbuf_realloc(ra, s0_531, a0_687, a1_716, a3_679, a4_712, s1_657, s3_113, s4_114, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_3059, out a2_3060, out a3_3061, out a4_3062, out a5_3063, out s2_547, out s3_113, out s4_114, out s5_3064, out s6_3065, out s8_3066, out mstatus);
										}
										Eq_2 a4_751 = *s3_113;
										s0_531 = *((word32) a4_751 + 36);
										Eq_2 a4_757 = (word32) *((word32) s0_531 + 40);
										struct Eq_412615 * a5_758 = (word32) a4_751 + (word32) (*s4_114) - a4_751 - a4_757;
										if (a5_758 > null)
										{
											struct Eq_412755 * a5_760 = a5_758->ptr0010;
											struct Eq_412759 * a5_766;
											Eq_2 a0_765 = lwip_htons((word32) a5_760->b000C | (word32) a5_760->b000D << 8, out a5_766);
											Eq_2 a0_767 = a0_765 & 0x01;
											if ((a0_765 & 0x01) != 0x00)
											{
												struct Eq_412861 * a5_769 = a5_766->ptr0010;
												Eq_2 s2_773 = (word32) a5_769->b000D << 8 | (word32) a5_769->b000C;
												word32 a5_3084;
												word32 a5_3085;
												uint32 a0_787 = (word32) (word16) (s2_773 & 0xFC0000FF | lwip_htons(lwip_htons(s2_773, out a5_3084) & 62, out a5_3085));
												*((word32) a4_757 + 0x0C) = (byte) a0_787;
												*((word32) a4_757 + 0x0D) = (byte) (a0_787 >> 8);
												s2_547 = s2_773 & 0xFC0000FF;
												a0_767 = a0_787 >> 8;
											}
											Eq_2 a3_793 = *s3_113;
											s0_531 = *((word32) a3_793 + 36);
											struct Eq_412788 * a5_800 = (word32) a3_793 + ((word32) (*((word32) s0_531 + 40)) - a3_793);
											*((word32) a4_757 + 8) = (word16) a5_800;
											struct Eq_412799 * a5_815;
											word16 * s4_829;
											word32 s1_3074;
											word32 a2_3075;
											word32 a3_3076;
											word32 s8_3082;
											word32 a4_3077;
											word32 s2_3078;
											word32 s6_3081;
											word32 s5_3080;
											word32 s3_3079;
											ra = pbuf_realloc(ra, s0_531, a0_767, (word32) a5_800->w0008, a3_793, a4_757, s2_547, s3_113, s4_114, mstatus, s0, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0138, out s1_3074, out a2_3075, out a3_3076, out a4_3077, out a5_815, out s2_3078, out s3_3079, out s4_829, out s5_3080, out s6_3081, out s8_3082, out mstatus);
											struct Eq_412828 * a5_841 = a5_815->ptr0010;
											word32 a5_3083;
											*s4_829 = (word16) ((word32) a5_815->w0008 + (word32) ((lwip_htons((word32) a5_841->b000C | (word32) a5_841->b000D << 8, out a5_3083) & 0x03) != 0x00));
										}
									}
								}
							}
						}
					}
				}
l230727A6:
				0x00 = (int8) dwArg0128;
				Eq_2 a0_1055;
				Eq_2 a3_1058;
				struct Eq_411505 * a4_1059;
				ptr32 mstatus_1063;
				Eq_2 s1_1065;
				Eq_2 s2_1066;
				Eq_2 s3_1067;
				Eq_2 s4_1068;
				Eq_2 s5_1069;
				ptr32 s6_1070;
				Eq_2 s7_1071;
				Eq_2 s8_1072;
				union Eq_2 * s9_1073;
				word32 a1_3090;
				word32 a5_3092;
				word32 a2_3091;
				Eq_2 ra_1064 = tcp_send_empty_ack(ra, dwArgE4, s0_531, s7, mstatus, s5, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s1_1065, out a0_1055, out a1_3090, out a2_3091, out a3_1058, out a4_1059, out a5_3092, out s2_1066, out s3_1067, out s4_1068, out s5_1069, out s6_1070, out s7_1071, out s8_1072, out s9_1073, out mstatus_1063);
				s0Out.u0 = <invalid>;
				s1Out = s1_1065;
				a0Out = a0_1055;
				a3Out = a3_1058;
				a4Out = a4_1059;
				s2Out = s2_1066;
				s3Out = s3_1067;
				s4Out = s4_1068;
				s5Out = s5_1069;
				s6Out = s6_1070;
				s7Out = s7_1071;
				s8Out = s8_1072;
				s9Out = s9_1073;
				mstatusOut = mstatus_1063;
				return ra_1064;
			}
		}
		if (a5_450 - a3 < 0x00)
			((word32) s0_1445 + 26)->u2 = (word16) ((word32) *((word32) s0_1445 + 26) | 2);
		goto l2307223A;
	}
	struct Eq_411546 * a0_33 = (a5_5 & 0x10)->ptr0054;
	Eq_2 a1_32 = g_t4200F674;
	up32 a6_35 = (word32) a0_33->b0014;
	a3 = (word32) a0_33->w0060;
	a0 = (a5_5 & 0x10) - a1_32;
	Eq_2 a4_105 = g_t4200F664;
	s1.u0 = 0x4200F664;
	if (a0 >= 0x00 && ((a5_5 & 0x10) != a1_32 || a2 - a4_105 >= 0x00))
	{
		if (a2 != a4_105)
			goto l230720D8;
		a0 = g_t4200F67C;
