pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
						ra = tcp_receive(ra, s0_1041, s1_1096, s0_1041, 0x4200F68A, 588003188, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwLoc08, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						if (((word32) *s7_1001.u0 & 0x10) != 0x00)
						{
							s0_1041 = *((byte) a4_1015.u0 + 80);
							Eq_2 a5_582 = *s5_1100;
							if (a4_1015 == a5_582)
							{
								s0_1041 = *((word32) a5_582 + 0x006C);
								if (a5_582 == 0x00)
								{
									word32 a0_5831;
									word32 a1_5832;
									word32 a5_5834;
									word32 a2_5833;
									s1_591 = tcp_pcb_purge(ra, s0_1041, a3_1014, s4_1033, mstatus, dwArg88, dwArg98, dwArgC8, out a0_5831, out a1_5832, out a2_5833, out a3_590, out a4_585, out a5_5834);
									a5_593 = *((word32) s3_1098 - 1788);
									if (s0_1041 != a5_593)
									{
										while (a5_593 != 0x00)
										{
											a5_597 = *((word32) a4_585 + 0x0C);
											if (s0_1041 == a4_585)
											{
l2307343E:
												s0_1041 = *((word32) a4_585 + 0x0C);
												*((word32) a4_585 + 0x0C) = a5_597;
												break;
											}
											a5_593 = a4_585;
										}
									}
									else
									{
l23073430:
										s0_1041 = *((word32) a5_593 + 0x0C);
										*((word32) s3_1098 + 0x0904) = a5_593;
									}
l23073448:
									g_b4202790C = 0x01;
									*((word32) s0_1041 + 20) = 0x0A;
									Eq_2 a4_731 = g_t420268F8;
									g_t420278F8 = s0_1041;
									*((word32) a4_731 + 0x0C) = s0_1041;
									word32 a2_5823;
									s0_1041 = tcp_timer_needed(s1_591, a3_590, mstatus, dwLoc0C, out s1_1096, out a0_1085, out a2_5823, out a3_1014, out a4_1015, out s8_1102);
								}
							}
						}
						break;
					case 0x07:
						ra = tcp_receive(ra, s0_1041, s1_1096, s0_1041, 0x4200F68A, 588003188, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwLoc08, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						if (((word32) *s7_1001.u0 & 0x10) != 0x00)
						{
							s0_1041 = *((word32) a4_1015 + 80);
							Eq_2 a5_546 = *s5_1100;
							if (a4_1015 == a5_546)
							{
								s0_1041 = *((word32) a5_546 + 0x006C);
								if (a5_546 == 0x00)
									*s4_1033 = (byte) ((word32) *s4_1033 | 16);
							}
						}
						break;
					}
				}
			}
l230730FC:
			if (((word32) *s4_1033 & 0x08) != 0x00)
			{
				Eq_2 a5_2029 = *((word32) s0_1041 + 144);
				if (a5_2029 != 0x00)
				{
					word32 t2_2060;
					a5_2029();
				}
				word32 s8_5792;
				word32 s6_5790;
				word32 s10_5793;
				word32 s7_5791;
				word32 s11_5794;
				word32 s3_5788;
				word32 s1_5785;
				word32 s5_5789;
				word32 a0_5786;
				word32 s2_5787;
				Eq_2 a3_2079;
				Eq_2 a4_2080;
				ra = tcp_pcb_remove(ra, s0_1041, a3_1014, a4_1015, a5_2029, s4_1033, s7_1001, mstatus, sp_1303->t0048, sp_1303->t0058, sp_1303->t0078, sp_1303->t0084, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00BC, sp_1303->t00C8, sp_1303->t00D8, sp_1303->t00F8, sp_1303->t00FC, sp_1303->t0108, out s1_5785, out a0_5786, out a3_2079, out a4_2080, out s2_5787, out s3_5788, out s4_1033, out s5_5789, out s6_5790, out s7_5791, out s8_5792, out s9_1002, out s10_5793, out s11_5794, out mstatus);
				word32 a1_5795;
				word32 a5_5797;
				word32 a2_5796;
				s1_1096 = tcp_free(s0_1041, a3_2079, a4_2080, mstatus, out a0_1085, out a1_5795, out a2_5796, out a3_1014, out a4_1015, out a5_5797);
				goto l23072DDA;
			}
			if ((word32) *s8_1102 != 0x00)
			{
				Eq_2 a5_1392 = *((word32) s0_1041 + 0x0080);
				if (a5_1392 != 0x00)
				{
					word32 s0_1406 = *((byte) a0_1085.u0 + 16);
					word32 t2_1643;
					a5_1392();
					if (a0_1085 == ~0x0C)
						goto l23072DDA;
				}
				*s8_1102 = 0x00;
				goto l23073546;
			}
l23073546:
			word32 a2_5798;
			word32 s2_1705;
			word32 s10_1703;
			word32 s3_1706;
			word32 s5_1708;
			word32 s6_1709;
			word32 s8_1711;
			word32 s11_1704;
			ra = tcp_input_delayed_close(ra, s0_1041, a3_1014, a4_1015, s4_1033, s7_1001, mstatus, sp_1303->t0038, sp_1303->t0048, sp_1303->t0068, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00AC, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00E8, sp_1303->t00EC, sp_1303->t00F8, out s1_1096, out a0_1085, out a2_5798, out a3_1014, out a4_1015, out s2_1705, out s3_1706, out s4_1033, out s5_1708, out s6_1709, out s7_1001, out s8_1711, out s9_1002, out s10_1703, out s11_1704, out mstatus);
			if (a0_1085 != 0x00)
				goto l23072DDA;
			Eq_2 a2_1720 = *s9_1002;
			if (a2_1720 != 0x00)
			{
				if (((word32) *((word32) s0_1041 + 26) & 0x10) != 0x00)
				{
					word32 s6_5807;
					word32 s5_5806;
					word32 s8_5808;
					word32 a0_5799;
					word32 a7_5804;
					word32 s2_5805;
					word32 a4_5802;
					word32 a1_5800;
					word32 a5_5803;
					word32 a2_5801;
					ra = pbuf_free(ra, a2_1720, a3_1014, a4_1015, s4_1033, mstatus, sp_1303->t0128, out s0_1966, out s1_1096, out a0_5799, out a1_5800, out a2_5801, out a3_1014, out a4_5802, out a5_5803, out a7_5804, out s2_5805, out s3_1098, out s4_1033, out s5_5806, out s6_5807, out s8_5808, out mstatus);
l23073312:
					word32 s7_5816;
					word32 s5_5814;
					word32 s6_5815;
					word32 s11_5818;
					word32 s2_5812;
					word32 a1_5810;
					word32 s3_5813;
					word32 s0_5809;
					word32 s10_5817;
					word32 a5_5811;
					ra = tcp_abort(ra, s1_1096, s0_1966, a3_1014, s3_1098, s4_1033, s7_1001, mstatus, sp_1303->t0000, sp_1303->t0004, sp_1303->t0028, sp_1303->t0038, sp_1303->t0048, sp_1303->t0058, sp_1303->t0074, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t009C, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00D8, sp_1303->t00DC, sp_1303->t00E8, sp_1303->t0108, out s0_5809, out s1_1096, out a0_1085, out a1_5810, out a3_1014, out a4_1015, out a5_5811, out s2_5812, out s3_5813, out s4_1033, out s5_5814, out s6_5815, out s7_5816, out s9_1002, out s10_5817, out s11_5818, out mstatus);
					goto l23072DDA;
				}
				Eq_2 a5_1723 = *((word32) s0_1041 + 0x0084);
				if (a5_1723 != 0x00)
				{
					word32 t2_1783;
					a5_1723();
				}
				else
					ra = tcp_recv_null(ra, s1_1096, s0_1041, a2_1720, 0x00, s4_1033, s7_1001, mstatus, sp_1303->t0000, sp_1303->t0014, sp_1303->t0028, sp_1303->t0038, sp_1303->t0048, sp_1303->t0058, sp_1303->t0068, sp_1303->t0078, sp_1303->t0084, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00AC, sp_1303->t00B8, sp_1303->t00BC, sp_1303->t00C8, sp_1303->t00D8, sp_1303->t00E8, sp_1303->t00EC, sp_1303->t00F8, sp_1303->t00FC, sp_1303->t0108, sp_1303->t0118, sp_1303->t0128, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1705, out s3_1706, out s4_1033, out s5_1708, out s6_1709, out s7_1001, out s8_1711, out s9_1002, out s10_1703, out s11_1704, out mstatus);
				if (a0_1085 == ~0x0C)
					goto l23072DDA;
				if (a0_1085 != 0x00)
					*((char *) *s9_1002 + 0x0078) = (union Eq_2 *) s0_1041;
			}
			ui32 a5_1796 = (word32) *s4_1033;
			if ((a5_1796 & 32) != 0x00)
			{
				s0_1041 = (a5_1796 & 32)->t0078;
				if ((a5_1796 & 32) != 0x00)
				{
					ui32 a4_1884 = (word32) (a5_1796 & 32)->b000D;
					(a5_1796 & 32)->b000D = (byte) (a4_1884 | 32);
					a4_1015 = a4_1884 | 32;
				}
				else
				{
					word32 a5_1799 = (word32) *((word32) s0_1041 + 40);
					a4_1015.u0 = 0x00FFF810;
					if (a5_1799 != 0x00FFF810)
						((word32) s0_1041 + 40)->u2 = (word16) (a5_1799 + 0x01);
					Eq_2 a5_1806 = *((word32) s0_1041 + 0x0084);
					if (a5_1806 != 0x00)
					{
						word32 s0_1809 = *((byte) a0_1085.u0 + 16);
						word32 t2_1880;
						a5_1806();
						if (a0_1085 == ~0x0C)
						{
l23072DDA:
							((word32) s1_1096 + 2320)->u0 = 0x00;
							*s9_1002 = (union Eq_2 *) 0x00;
							if (a0_1085 != 0x00)
							{
								word32 mstatus_5724;
								word32 s5_5721;
								word32 a4_5716;
								word32 a7_5717;
								word32 s3_5719;
								word32 s4_5720;
								word32 s6_5722;
								word32 s8_5723;
								word32 a3_5715;
								word32 a2_5714;
								word32 a1_5713;
								word32 s0_5710;
								word32 s2_5718;
								word32 s1_5711;
								word32 a0_5712;
								struct Eq_414400 * a5_2190;
								pbuf_free(ra, a0_1085, a3_1014, a4_1015, s4_1033, mstatus, dwArgD8, out s0_5710, out s1_5711, out a0_5712, out a1_5713, out a2_5714, out a3_5715, out a4_5716, out a5_2190, out a7_5717, out s2_5718, out s3_5719, out s4_5720, out s5_5721, out s6_5722, out s8_5723, out mstatus_5724);
								a5_2190->dw0004 = 0x00;
							}
							0x00 = dwArg010C;
							return dwLoc4C;
						}
					}
				}
			}
			((word32) s1_1096 + 2320)->u0 = 0x00;
			word32 s11_5830;
			word32 s2_5824;
			word32 s6_5827;
			word32 s10_5829;
			word32 s3_5825;
			word32 s5_5826;
			word32 s8_5828;
			Eq_2 a2_1908;
			Eq_2 s7_1923;
			ra = tcp_input_delayed_close(ra, s0_1041, a3_1014, a4_1015, s4_1033, s7_1001, mstatus, sp_1303->t0038, sp_1303->t0048, sp_1303->t0068, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00AC, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00E8, sp_1303->t00EC, sp_1303->t00F8, out s1_1096, out a0_1085, out a2_1908, out a3_1014, out a4_1015, out s2_5824, out s3_5825, out s4_1033, out s5_5826, out s6_5827, out s7_1923, out s8_5828, out s9_1002, out s10_5829, out s11_5830, out mstatus);
			if (a0_1085 == 0x00)
			{
				word32 s0_5839;
				word32 a1_5840;
				word32 s11_5850;
				word32 s5_5845;
				word32 s10_5849;
				word32 s7_5847;
				word32 s2_5843;
				word32 a2_5841;
				word32 s3_5844;
				word32 s8_5848;
				word32 a5_5842;
				word32 s6_5846;
				ra = tcp_output(ra, s1_1096, s0_1041, a2_1908, s7_1923, mstatus, sp_1303->t0058, sp_1303->t0068, sp_1303->t0088, sp_1303->t0094, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00CC, sp_1303->t00D8, sp_1303->t00E8, sp_1303->t0108, sp_1303->t010C, sp_1303->t0118, out s0_5839, out s1_1096, out a0_1085, out a1_5840, out a2_5841, out a3_1014, out a4_1015, out a5_5842, out s2_5843, out s3_5844, out s4_1033, out s5_5845, out s6_5846, out s7_5847, out s8_5848, out s9_1002, out s10_5849, out s11_5850, out mstatus);
			}
			goto l23072DDA;
		}
l23072E1C:
		a0_262 = s0_2313;
		s0_2313 = *((word32) s0_2313 + 0x0C);
	}
	Eq_2 a0_2225 = g_t420268F8;
	while (true)
	{
		Eq_2 a2_2296;
		Eq_2 a1_2290;
		Eq_2 a2_2264;
		if (a0_2225 == 0x00)
			break;
		ui32 a6_2228 = (word32) *((word32) a0_2225 + 8);
		if ((a6_2228 == 0x00 || a6_2228 == ((word32) t4_256->b0044 + 0x01 & 0x00FF)) && ((word32) (*((word32) a0_2225 + 24)) == ((word32) (*((word32) a3_1014 + 1)) << 8 | (word32) (*a3_1014)) && ((word32) (*((word32) a0_2225 + 22)) == ((word32) (*((word32) a3_1014 + 3)) << 8 | (word32) (*((word32) a3_1014 + 2))) && (t6_259 == *((word32) a0_2225 + 4) && t5_260 == *a0_2225))))
		{
			if ((a0_235 & 0x00FF & 4) != 0x00)
				goto l23072ED2;
			a2_2264 = (word32) g_w4200F68A;
			if ((a0_235 & 0x00FF & 2) != 0x00)
			{
				Eq_2 a7_2272 = g_t4200F674;
				a0_2225 = (a0_235 & 0x00FF)->t0024;
				a4_120 = a7_2272 - (a0_235 & 0x00FF);
				if (a4_120 >= 0x00)
				{
					a4_120 -= (word32) *((word32) a0_2225 + 40);
					if (a4_120 <= 0x00)
					{
						a1_2290 = g_t4200F664;
						a2_2296 = a2_2264 + a7_2272;
						goto l23072EAC;
					}
				}
			}
			else
			{
				a4_120 = a0_235 & 0x00FF & 0x01;
				if (a4_120 != 0x00)
					*((word32) g_t420268FC + 32) = a0_2225;
			}
			if (a2_2264 == 0x00)
				goto l23072ED2;
			((word32) a0_2225 + 26)->u2 = (word16) ((word32) *((word32) a0_2225 + 26) | 2);
			goto l23072ECE;
		}
		a0_2225 = *((word32) a0_2225 + 0x0C);
	}
	Eq_2 t0_2298 = g_t42026900;
	s7_1001.u0 = 0x00;
	Eq_2 t6_2300 = 0x00;
	Eq_2 a5_2301 = t0_2298;
	while (a5_2301 != 0x00)
	{
		ui32 t2_2304 = (word32) *((word32) a5_2301 + 8);
		if (t2_2304 == 0x00 || t2_2304 == ((word32) t4_256->b0044 + 0x01 & 0x00FF))
		{
			s0_2313 = (word32) *((word32) a3_1014 + 2);
			if ((word32) *((word32) a5_2301 + 22) == ((word32) (*((word32) a3_1014 + 3)) << 8 | s0_2313))
			{
				Eq_414019 a6_2318 = *a5_2301;
				if (t5_260 == a6_2318)
				{
					s7_1001 = a5_2301;
					goto l23072F54;
				}
				if (a6_2318 == 0x00)
				{
					s7_1001 = a5_2301;
					t6_2300 = a0_2225;
				}
			}
		}
		a0_2225 = a5_2301;
		a5_2301 = *((word32) a5_2301 + 0x0C);
	}
	if (s7_1001 != 0x00)
	{
		a0_2225 = t6_2300;
l23072F54:
		if (a0_2225 != 0x00)
		{
			Eq_2 a5_2400 = *((byte) s7_1001.u0 + 0x0C);
			g_t42027900 = s7_1001;
			*((word32) a5_2400 + 0x0C) = a0_2225;
			*((byte) s7_1001.u0 + 0x0C) = t0_2298;
		}
		else
			g_w4202689A = (word16) ((word32) g_w4202689A + 0x01);
		if ((a0_235 & 0x00FF & 4) != 0x00)
		{
l23072ED2:
			0x00 = dwArg010C;
			word32 s8_5674;
			word32 a7_5668;
			word32 s6_5673;
			word32 s5_5672;
			word32 mstatus_5675;
			word32 s2_5669;
			word32 s3_5670;
			word32 a3_5665;
			word32 s4_5671;
			word32 a1_5663;
			word32 s0_5661;
			word32 a5_5667;
			word32 a2_5664;
			word32 a4_5666;
			word32 a0_5662;
			Eq_2 s1_2886;
			pbuf_free(dwLoc08, dwLoc4C, s2, a4_120, dwArg0168, mstatus, dwArg0128, out s0_5661, out s1_2886, out a0_5662, out a1_5663, out a2_5664, out a3_5665, out a4_5666, out a5_5667, out a7_5668, out s2_5669, out s3_5670, out s4_5671, out s5_5672, out s6_5673, out s8_5674, out mstatus_5675);
			return s1_2886;
		}
		if ((a0_235 & 0x00FF & 16) == 0x00)
		{
			a4_120 = a0_235 & 0x00FF & 0x02;
			if (a4_120 != 0x00)
			{
				word32 a3_5726;
				word32 a5_5727;
				word32 a1_5725;
				Eq_2 s1_2491;
				struct Eq_414427 * s4_2492;
				word32 s8_2493;
				Eq_2 a0_2498;
				struct Eq_414430 * s10_2501;
				struct Eq_414508 ** s11_2502;
				struct Eq_414432 * s3_2504;
				word32 s5_2505;
				word32 s6_2506;
				word32 s9_2508;
				struct Eq_414464 ** s2_2503;
				Eq_2 ra_2489 = tcp_alloc(ra, s1_123, (word32) *((byte) s7_1001.u0 + 21), a1_135, a3_1014, a4_120, 0x42027000, s4_73, s7_1001, mstatus, dwLoc48, s6, dwLoc28, dwLoc18, dwArg04, dwArg08, dwArg28, dwArg2C, dwArg38, s5, s3, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgB8, out s1_2491, out a0_2498, out a1_5725, out a3_5726, out a4_120, out a5_5727, out s2_2503, out s3_2504, out s4_2492, out s5_2505, out s6_2506, out s7_1001, out s8_2493, out s9_2508, out s10_2501, out s11_2502, out mstatus);
				if (a0_2498 == 0x00)
				{
					s10_2501->w00A0 = (word16) ((word32) s10_2501->w00A0 + 0x01);
					<anonymous> * a5_2724 = *((byte) s7_1001.u0 + 24);
					if (a5_2724 != null)
					{
						word32 t2_2756;
						a5_2724();
					}
				}
				else
				{
					struct Eq_414464 * a4_2514 = *s2_2503;
					*s4_2492->ptr0014 = (union Eq_2 *) a0_2498;
					s4_2492->ptr0010->t0004 = a0_2498;
					*((word32) a0_2498 + 22) = (word16) (word32) *((byte) s7_1001.u0 + 22);
					Eq_2 a3_2521 = (word32) a4_2514->b0000;
					*((word32) a0_2498 + 24) = (word16) ((word32) a4_2514->b0001 << 8 | a3_2521);
					*((word32) a0_2498 + 20) = 0x03;
					struct Eq_414508 * a5_2527 = *s11_2502;
					a5_2527->t0025 = a0_2498;
					a5_2527->t002D = a0_2498;
					struct Eq_406773 * a0_2531 = tcp_next_iss(a0_2498);
					struct Eq_414508 * a5_2534 = *s11_2502;
					a0_2531->t0058 = a0_2498;
					a0_2531->t0050 = a0_2498;
					a0_2531->t0044 = a0_2498;
					a0_2531->t005C = a0_2498;
					a5_2534->t0053 = a0_2498;
					struct Eq_414540 * a5_2541 = *((byte) s7_1001.u0 + 16);
					*((word32) a0_2498 + 0x007C) = s7_1001;
					a5_2541->t0010 = a0_2498;
					*((word32) a0_2498 + 9) = (byte) ((word32) *((byte) s7_1001.u0 + 9) & 0x0C);
					*((word32) a0_2498 + 8) = (byte) (word32) *((byte) s7_1001.u0 + 8);
					struct Eq_414568 * a5_2549 = s3_2504->ptrFFFFF904;
					s3_2504->t0904 = a0_2498;
					a5_2549->t000C = a0_2498;
					word32 a4_5732;
					word32 s8_5733;
					word32 a2_5730;
					word32 a3_5731;
					word32 s1_5728;
					word32 a0_5729;
					tcp_timer_needed(s1_2491, a3_2521, mstatus, dwLoc0C, out s1_5728, out a0_5729, out a2_5730, out a3_5731, out a4_5732, out s8_5733);
					g_b4202790C = 0x01;
					Eq_2 s0_2566 = dwArg94;
					if ((word32) g_w42027000 != 0x00)
					{
						word32 s3_5748;
						word32 s6_5751;
						word32 s4_5749;
						word32 s1_5745;
						word32 s8_5752;
						word32 s5_5750;
						word32 a4_5747;
						word32 a0_5746;
						s0_2566 = tcp_parseopt.isra.0.part.1((word32) dwArg94 + 50, dwArgD8, out s1_5745, out a0_5746, out a4_5747, out s2_2503, out s3_5748, out s4_5749, out s5_5750, out s6_5751, out s7_1001, out s8_5752);
					}
					struct Eq_414464 * a4_2588 = *s2_2503;
					int32 * s2_2594 = (word32) *((word32) s0_2566 + 50);
					Eq_2 a5_2596 = (word32) a4_2588->b000F << 8 | (word32) a4_2588->b000E;
					*((word32) s0_2566 + 96) = (word16) a5_2596;
					*((word32) s0_2566 + 98) = (word16) a5_2596;
					word32 a2_5734;
					word32 a4_5736;
					word32 a5_5737;
					word32 a3_5735;
					Eq_2 a3_2611;
					((word32) s0_2566 + 50)->u2 = (word16) tcp_eff_send_mss_netif(s2_2594, ip4_route((word32) s0_2566 + 4, a5_2596, out a2_5734, out a3_5735, out a4_5736, out a5_5737), out a3_2611);
					word32 a1_5738;
					word32 s8_5744;
					word32 s2_5741;
					word32 a4_5739;
					word32 a5_5740;
					word32 s6_5743;
					word32 s5_5742;
					word32 a0_2618;
					Eq_2 a3_2621;
					Eq_2 s0_2628;
					Eq_2 s3_2631;
					Eq_2 s4_2632;
					ra = tcp_enqueue_flags(ra_2489, s0_2566, 0x12, a3_2611, mstatus, s0, dwArg38, s5, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_2628, out s1_123, out a0_2618, out a1_5738, out a2_2264, out a3_2621, out a4_5739, out a5_5740, out s2_5741, out s3_2631, out s4_2632, out s5_5742, out s6_5743, out s8_5744, out mstatus);
					if (a0_2618 != 0x00)
					{
						word32 s10_5766;
						word32 s11_5767;
						word32 s2_5759;
						word32 a5_5758;
						word32 s3_5760;
						word32 a3_5757;
						word32 s6_5763;
						word32 s7_5764;
						word32 s9_5765;
						word32 s4_5761;
						word32 s5_5762;
						word32 a1_5756;
						word32 s1_5754;
						word32 a0_5755;
						word32 s0_5753;
						tcp_abandon(ra, s1_123, s0_2628, a3_2621, s3_2631, s4_2632, s7_1001, mstatus, dwLoc50, 0x4200F688, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg24, dwArg28, dwArg38, s5, s3, dwArg58, dwArg68, dwArg88, dwArg8C, dwArg98, dwArgB8, out s0_5753, out s1_5754, out a0_5755, out a1_5756, out a3_5757, out a4_120, out a5_5758, out s2_5759, out s3_5760, out s4_5761, out s5_5762, out s6_5763, out s7_5764, out s9_5765, out s10_5766, out s11_5767, out mstatus);
					}
					else
					{
						a0_2225 = s0_2628;
l23072ECE:
						word32 s10_5783;
						word32 s9_5782;
						word32 s11_5784;
						word32 s2_5775;
						word32 s5_5778;
						word32 s6_5779;
						word32 s3_5776;
						word32 a5_5774;
						word32 s8_5781;
						word32 s4_5777;
						word32 s7_5780;
						word32 a2_5772;
						word32 a1_5771;
						word32 a3_5773;
						word32 s0_5768;
						word32 a0_5770;
						word32 s1_5769;
						tcp_output(ra, s1_123, a0_2225, a2_2264, s7_1001, mstatus, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_5768, out s1_5769, out a0_5770, out a1_5771, out a2_5772, out a3_5773, out a4_120, out a5_5774, out s2_5775, out s3_5776, out s4_5777, out s5_5778, out s6_5779, out s7_5780, out s8_5781, out s9_5782, out s10_5783, out s11_5784, out mstatus);
					}
				}
			}
			goto l23072ED2;
		}
		a2_2296 = (word32) g_t4200F674 + (word32) g_w4200F68A;
		a1_2290 = g_t4200F664;
	}
	else
	{
		word32 a5_5686;
		if ((lwip_htons((word32) *((word32) a3_1014 + 0x0C) | (word32) (*((word32) a3_1014 + 0x0D)) << 8, out a5_5686) & 0x04) != 0x00)
			goto l23072ED2;
		word32 a0_2356 = (word32) g_w4200F68A;
		g_w42026894 = (word16) ((word32) g_w42026894 + 0x01);
		Eq_2 a2_2363 = g_t4200F674;
		a1_2290 = g_t4200F664;
		g_w4202688A = (word16) ((word32) g_w4202688A + 0x01);
		a2_2296 = (word32) a2_2363 + a0_2356;
	}
l23072EAC:
	word32 s8_5708;
	word32 s9_5709;
	word32 a3_5700;
	word32 s5_5705;
	word32 s3_5703;
	word32 a5_5701;
	word32 s4_5704;
	word32 s6_5706;
	word32 s7_5707;
	word32 a0_5699;
	word32 s1_5698;
	word32 s0_5697;
	word32 s2_5702;
	tcp_rst(ra, s0_2313, a1_2290, a2_2296, s7_1001, mstatus, dwLoc08, dwArg08, dwArg28, dwArg38, s7, s5, dwArg68, dwArg78, dwArgA8, dwArgD8, out s0_5697, out s1_5698, out a0_5699, out a3_5700, out a4_120, out a5_5701, out s2_5702, out s3_5703, out s4_5704, out s5_5705, out s6_5706, out s7_5707, out s8_5708, out s9_5709, out mstatus);
	goto l23072ED2;
}

// 23073668: Register ui32 tcp_trigger_input_pcb_close(Register out ptr32 a5Out)
// Called from:
//      tcp_close
ui32 tcp_trigger_input_pcb_close(ptr32 & a5Out)
{
	ui32 a4_6 = (word32) g_b4200F670;
	g_b4200F670 = (byte) (a4_6 | 16);
	a5Out = 0x4200F670;
	return a4_6 | 16;
}

// 2307367E: Register Eq_2 tcp_seg_add_chksum(Register word32 a0, Register Eq_2 a1, Register (ptr32 word16) a2, Register (ptr32 byte) a3, Register out (ptr32 Eq_416911) a4Out, Register out (ptr32 Eq_416912) a5Out)
// Called from:
//      tcp_split_unsent_seg
//      altcp_tcp_write
Eq_2 tcp_seg_add_chksum(word32 a0, Eq_2 a1, word16 * a2, byte * a3, struct Eq_416911 & a4Out, struct Eq_416912 & a5Out)
{
	uint32 a0_9 = a0 + (word32) (*a2);
	struct Eq_416912 * a5_10 = a0_9 >> 0x10;
	uint32 a0_13 = (word32) (word16) (a0_9 + (a0_9 >> 0x10));
	if ((a1 & 0x01) != 0x00)
	{
		a4 = (word32) *a3;
		*a3 = (byte) (0x01 - a4);
		a5_10 = a0_13 << 0x08;
		a0_13 = (word32) (word16) (a0_13 >> 8 | a0_13 << 0x08);
	}
	*a2 = (word16) a0_13;
	a4Out = a4;
	a5Out = a5_10;
	return a1 & 0x01;
}

