pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 230736B0: Register Eq_2 tcp_create_segment(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_406854) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_416965) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_416972) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_406854) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_416977 s6Out, Register out Eq_416978 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_split_unsent_seg
//      tcp_send_fin
//      altcp_tcp_write
Eq_2 tcp_create_segment(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_406854 * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0128, struct Eq_416965 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_416972 & a5Out, union Eq_2 & s2Out, struct Eq_406854 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_416977 & s6Out, union Eq_416978 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s1_112;
	ptr32 a1_107;
	ptr32 a3_109;
	ptr32 a4_110;
	struct Eq_416972 * a5_111;
	ptr32 s0_103;
	Eq_2 s5_130 = a0;
	Eq_2 s2_125 = a1;
	struct Eq_406854 * s3_126 = a2;
	Eq_2 a0_31;
	Eq_2 a3_34;
	Eq_2 a4_35;
	word32 a2_216;
	word32 a5_217;
	Eq_2 s1_36 = memp_malloc(a4 << 0x02, 0x04, a3, a4, mstatus, out a0_31, out a2_216, out a3_34, out a4_35, out a5_217);
	if (a0_31 == 0x00)
	{
		word32 a0_220;
		word32 a2_221;
		word32 a7_222;
		word32 s4_223;
		word32 s8_224;
		ra = pbuf_free(ra, a1, a3_34, a4_35, a3, mstatus, dwArgF8, out s0_103, out s1_112, out a0_220, out a1_107, out a2_221, out a3_109, out a4_110, out a5_111, out a7_222, out s2_125, out s3_126, out s4_223, out s5_130, out s6, out s8_224, out mstatus);
	}
	else
	{
		*((word32) a0_31 + 0x0D) = (byte) a4_35;
		*a0_31 = 0x00;
		*((word32) a0_31 + 4) = a1;
		word32 a5_43 = (word32) *((word32) a1 + 8);
		*((word32) a0_31 + 0x0A) = 0x00;
		*((word32) a0_31 + 8) = (word16) (a5_43 - (s1_36 & 0x04));
		*((word32) a0_31 + 0x0C) = 0x00;
		s1_112 = s1_36 & 0x04;
		Eq_2 a3_54;
		struct Eq_417040 * a5_56;
		word32 a2_218;
		word32 a4_219;
		if (pbuf_add_header(a1, 0x14, out a1_107, out a2_218, out a3_54, out a4_219, out a5_56) != 0x00)
		{
			word32 a4_101 = (word32) g_w42026898;
			g_w42026898 = (word16) (a4_101 + 0x01);
			s0_103 = 0x00;
			word32 a0_228;
			word32 a2_229;
			s1_112 = tcp_seg_free(ra, a0_31, a3_54, a4_101 + 0x01, a3, mstatus, dwArgD8, out a0_228, out a1_107, out a2_229, out a3_109, out a4_110, out a5_111);
		}
		else
		{
			Eq_2 s0_57 = a5_56->t0004;
			Eq_2 s2_58 = a5_56->t0004;
			*((word32) s0_57 + 16) = s2_58;
			word32 a5_225;
			Eq_2 a0_61 = lwip_htons((word32) *((word32) a0 + 22), out a5_225);
			*s2_58 = (byte) a0_61;
			*((word32) s2_58 + 1) = (byte) (a0_61 >> 8);
			Eq_2 s2_67 = *((word32) s0_57 + 16);
			word32 a5_226;
			Eq_2 a0_68 = lwip_htons((word32) *((word32) a0 + 24), out a5_226);
			*((word32) s2_67 + 2) = (byte) a0_68;
			*((word32) s2_67 + 3) = (byte) (a0_68 >> 8);
			Eq_2 s2_73 = *((word32) s0_57 + 16);
			word32 a5_227;
			Eq_2 a0_75 = lwip_htonl(a3, out a3_109, out a4_110, out a5_227);
			*((word32) s2_73 + 4) = (byte) a0_75;
			*((word32) s2_73 + 5) = (byte) (a0_75 >> 0x08);
			*((word32) s2_73 + 7) = (byte) (a0_75 >> 24);
			*((word32) s2_73 + 6) = (byte) (a0_75 >> 0x10);
			s2_125 = *((word32) s0_57 + 16);
			Eq_2 a0_91 = lwip_htons(((s1_36 & 0x04) >> 0x02) + 0x05 << 0x0C | a2, out a5_111);
			*((word32) s2_125 + 0x0C) = (byte) a0_91;
			*((word32) s2_125 + 0x0D) = (byte) (a0_91 >> 8);
			s0_103 = a5_111->ptr0010;
			a5_111->b0012 = 0x00;
			a5_111->b0013 = 0x00;
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_112;
	a0Out = s0_103;
	a1Out = a1_107;
	a2Out = dwArg0100;
	a3Out = a3_109;
	a4Out = a4_110;
	a5Out = a5_111;
	s2Out = s2_125;
	s3Out = s3_126;
	s4Out = dwArg78;
	s5Out = s5_130;
	s6Out = s6;
	s8Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 230737BA: Register Eq_2 tcp_output_alloc_header_common.constprop.6(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_417242 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_output_alloc_header.constprop.5
//      tcp_rst
Eq_2 tcp_output_alloc_header_common.constprop.6(Eq_2 ra, Eq_2 s0, ui32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_417242 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a0_39;
	struct Eq_417254 * s0_44;
	Eq_2 s3_51;
	ui32 s4_52;
	ptr32 mstatus_55;
	Eq_2 s5_57;
	Eq_2 s6_58;
	word32 a1_188;
	word32 a2_189;
	word32 a7_190;
	word32 s2_191;
	word32 s8_192;
	Eq_417242 s1_167;
	ptr32 a5_107;
	ptr32 a4_162;
	Eq_2 a3_161;
	Eq_2 ra_56 = pbuf_alloc(ra, s0, a2, 0x00A2, (word32) (word16) (a1 + 0x14), 640, a3, a4, mstatus, dwLoc2C, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_44, out s1_167, out a0_39, out a1_188, out a2_189, out a3_161, out a4_162, out a5_107, out a7_190, out s2_191, out s3_51, out s4_52, out s5_57, out s6_58, out s8_192, out mstatus_55);
	if (a0_39 != 0x00)
	{
		word32 a5_193;
		Eq_2 a0_68 = lwip_htons(a3_161, out a5_193);
		s0_44->b0000 = (byte) a0_68;
		s0_44->b0001 = (byte) (a0_68 >> 8);
		word32 a5_194;
		Eq_2 a0_74 = lwip_htons(s6_58, out a5_194);
		s0_44->b0002 = (byte) a0_74;
		s0_44->b0004 = (byte) s1_167;
		s0_44->b0005 = (byte) (s1_167 >> 0x08);
		s0_44->b0003 = (byte) (a0_74 >> 8);
		s0_44->b0006 = (byte) (s1_167 >> 0x10);
		s0_44->b0007 = (byte) (s1_167 >> 24);
		word32 a5_195;
		Eq_2 a0_87 = lwip_htonl(s5_57, out a3_161, out a4_162, out a5_195);
		s0_44->b0008 = (byte) a0_87;
		s0_44->b0009 = (byte) (a0_87 >> 0x08);
		s0_44->b000B = (byte) (a0_87 >> 24);
		s0_44->b000A = (byte) (a0_87 >> 0x10);
		word32 a5_196;
		Eq_2 a0_100 = lwip_htons(s4_52 | 0x05000000, out a5_196);
		s0_44->b000C = (byte) a0_100;
		s0_44->b000D = (byte) (a0_100 >> 8);
		Eq_2 a0_106 = lwip_htons(s3_51, out a5_107);
		s0_44->b000E = (byte) a0_106;
		s0_44->b000F = (byte) (a0_106 >> 8);
		s0_44->b0010 = 0x00;
		s0_44->b0011 = 0x00;
		s0_44->b0012 = 0x00;
		s0_44->b0013 = 0x00;
		s1_167 >>= 24;
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_167;
	a3Out = a3_161;
	a4Out = a4_162;
	a5Out = a5_107;
	s2Out = a0_39;
	s3Out = s3_51;
	s4Out = dwArg78;
	s5Out = s5_57;
	s6Out = s6_58;
	s8Out = s5;
	mstatusOut = mstatus_55;
	return ra_56;
}

// 23073896: Register Eq_2 tcp_output_alloc_header.constprop.5(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_417447) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_output
//      tcp_keepalive
//      tcp_zero_window_probe
Eq_2 tcp_output_alloc_header.constprop.5(Eq_2 ra, Eq_2 a0, ui32 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_417447 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_13 = *((word32) a0 + 36);
	ptr32 a3_20;
	ptr32 mstatus_25;
	struct Eq_417461 * s0_27;
	ptr32 s1_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s8_34;
	ptr32 a4_21;
	struct Eq_417447 * a5_22;
	Eq_2 ra_26 = tcp_output_alloc_header_common.constprop.6(ra, a0, a1, a2, (word32) *((word32) a0 + 22), (word32) *((word32) a0 + 24), mstatus, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_27, out s1_28, out a3_20, out a4_21, out a5_22, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s8_34, out mstatus_25);
	if (a0_13 != 0x00)
	{
		a4_21 = (word32) s0_27->w002A;
		a5_22 += a4_21 / 48;
		a5_22->dw002C = a5_22->dw0024;
	}
	s1Out = s1_28;
	a0Out = a0_13;
	a3Out = a3_20;
	a4Out = a4_21;
	a5Out = a5_22;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s8Out = s8_34;
	mstatusOut = mstatus_25;
	return ra_26;
}

// 230738C6: Register Eq_2 tcp_output_control_segment(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_rst
//      tcp_output
//      tcp_keepalive
//      tcp_zero_window_probe
Eq_2 tcp_output_control_segment(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a3_110;
	Eq_2 a4_111;
	Eq_2 a0_30;
	Eq_2 s0_116 = a1;
	Eq_2 s4_120 = a2;
	if (a0 != 0x00)
	{
		Eq_2 a0_24 = (word32) *((word32) a0 + 8);
		if (a0_24 != 0x00)
		{
			word32 a5_249;
			a0_30 = netif_get_by_index(a0_24, out a4_111, out a5_249);
			a3_110 = a3;
l230738E8:
			if (a0_30 != 0x00)
			{
				Eq_2 a4_106;
				Eq_2 a3_105;
				uint32 a0_54;
				Eq_2 a6_60;
				Eq_2 s1_62;
				Eq_2 s2_63;
				struct Eq_417606 * s3_64;
				Eq_2 s4_65;
				Eq_2 s5_66;
				word32 a2_256;
				word32 a4_258;
				word32 a3_257;
				Eq_2 s0_61 = ip_chksum_pseudo(a1, 0x06, (word32) *((word32) a1 + 8), a2, a3, out s1_62, out a0_54, out a2_256, out a3_257, out a4_258, out a6_60, out s2_63, out s3_64, out s4_65, out s5_66);
				s3_64->b0010 = (byte) a0_54;
				s3_64->b0011 = (byte) (a0_54 >> 8);
				if (s1_62 != 0x00)
				{
					a3_105 = (word32) *((word32) s1_62 + 11);
					a4_106 = (word32) *((word32) s1_62 + 0x0A);
				}
				else
				{
					a4_106.u0 = 0x00;
					a3_105.u0 = 0x00FF;
				}
				g_w42026884 = (word16) ((word32) g_w42026884 + 0x01);
				word32 s1_259;
				word32 a0_260;
				word32 a1_261;
				word32 a5_262;
				word32 a7_263;
				word32 s2_264;
				word32 s3_265;
				word32 s5_266;
				word32 s6_267;
				word32 s8_268;
				ra = ip4_output_if(ra, s0_61, s1_62, s0_61, s4_65, s2_63, a3_105, a4_106, 0x06, a6_60, s4_65, s5_66, s6, s7, out s0_116, out s1_259, out a0_260, out a1_261, out a3_110, out a4_111, out a5_262, out a7_263, out s2_264, out s3_265, out s4_120, out s5_266, out s6_267, out s7, out s8_268, out s9);
			}
			word32 s0_250;
			word32 a1_252;
			word32 a0_251;
			word32 a7_254;
			word32 a2_253;
			word32 s8_255;
			ptr32 a3_156;
			ptr32 a4_157;
			ptr32 a5_158;
			ptr32 s1_159;
			ptr32 s2_160;
			ptr32 s3_161;
			ptr32 s4_164;
			ptr32 s5_165;
			ptr32 s6_166;
			ptr32 mstatus_173;
			Eq_2 ra_174 = pbuf_free(ra, s0_116, a3_110, a4_111, s4_120, mstatus, dwArgF8, out s0_250, out s1_159, out a0_251, out a1_252, out a2_253, out a3_156, out a4_157, out a5_158, out a7_254, out s2_160, out s3_161, out s4_164, out s5_165, out s6_166, out s8_255, out mstatus_173);
			0x00 = (int8) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_159;
			a0Out = s3_161;
			a3Out = a3_156;
			a4Out = a4_157;
			a5Out = a5_158;
			s2Out = s2_160;
			s3Out = s3_161;
			s4Out = s4_164;
			s5Out = s5_165;
			s6Out = s6_166;
			s7Out = s7;
			s8Out = dwArg58;
			s9Out = s9;
			mstatusOut = mstatus_173;
			return ra_174;
		}
	}
	word32 a5_248;
	word32 a2_247;
	a0_30 = ip4_route(a2, a5, out a2_247, out a3_110, out a4_111, out a5_248);
	goto l230738E8;
}

// 23073960: Register Eq_2 tcp_write(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Register ptr32 mstatus, Stack word32 dwArg04, Stack Eq_2 dwArg19, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_417708) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_417711) a3Out, Register out (ptr32 Eq_417712) a5Out, Register out (ptr32 Eq_417708) s2Out, Register out Eq_2 s3Out, Register out Eq_417715 s4Out, Register out ptr32 s5Out, Register out (ptr32 byte) s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_write
//      altcp_tcp_write
Eq_2 tcp_write(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, ui32 a3, ptr32 mstatus, word32 dwArg04, Eq_2 dwArg19, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, struct Eq_417708 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, struct Eq_417711 & a3Out, struct Eq_417712 & a5Out, struct Eq_417708 & s2Out, union Eq_2 & s3Out, union Eq_417715 & s4Out, ptr32 & s5Out, byte & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	struct Eq_417708 * s2_30 = (struct Eq_417708 *) ~0x0F;
	if (a0 != 0x00)
	{
		uint32 a5_32 = (word32) *((word32) a0 + 98);
		Eq_2 a4_33 = (word32) *((word32) a0 + 50);
		a5 = a5_32 >> 1;
		Eq_2 a7_35 = a5_32 >> 1;
		if (a4_33 < a5_32 >> 1)
			a7_35 = a4_33;
		uint32 s8_38 = a7_35 << 0x10;
		Eq_2 s8_162 = s8_38 >> 0x10;
		if (s8_38 >> 0x10 == 0x00)
			s8_162 = a4_33;
		s2_30 = (struct Eq_417708 *) ~0x0F;
		if (a1 == 0x00)
			goto l230739D4;
		a5 = (word32) *((word32) a0 + 20);
		uint32 a4_101 = 0x07;
		if (a5 != (struct Eq_417712 *) 0x07)
		{
			a5 = (char *) a5 - 2 & 0x00FF;
			a4_101 = 0x02;
			s2_30 = (struct Eq_417708 *) ~0x0A;
			if (a5 > (struct Eq_417712 *) 0x02)
				goto l230739D4;
		}
		if (a2 != 0x00)
		{
			if ((word32) *((word32) a0 + 100) < a2)
			{
l230739C6:
				ui32 a5_504 = (word32) *((word32) a0 + 26);
				((word32) a0 + 26)->u2 = (word16) (a5_504 | 0x0080);
				a5 = a5_504 | 0x0080;
l230739D2:
				s2_30 = (struct Eq_417708 *) ~0x00;
				goto l230739D4;
			}
			a4_101 = (word32) *((word32) a0 + 0x0066);
			a5 = (struct Eq_417712 *) 0x0F;
			if (a4_101 > 0x0F)
			{
				g_w42026890 = (word16) ((word32) g_w42026890 + 0x01);
				goto l230739C6;
			}
		}
		Eq_2 s1_114;
		Eq_2 s11_356;
		Eq_2 s2_106;
		Eq_2 a0_70 = *((word32) s1 + 0x006C);
		word32 s5_270 = (word32) *((word32) a0_70 + 0x0066);
		s1_114 = s1;
		if (s1 != 0x00)
		{
			do
			{
				s11_356 = s1_1179;
				s1_114 = *s1_1179;
				s1_1179 = s1_114;
			} while (s1_114 != 0x00);
			s7 = (word32) *((word32) a0_70 + 0x0068);
			ui32 t1_81 = (word32) *((word32) s1_1179 + 0x0D);
			a4_101 = (word32) *((word32) s1_1179 + 8);
			s2_106.u0 = 0x00;
			if (s7 != 0x00)
			{
				Eq_2 a4_91 = s8_162 - a4_101 - (t1_81 << 2 & 4);
				Eq_2 t1_92 = s7;
				if (a2 < s7)
					t1_92 = a2;
				Eq_2 s2_103 = a4_91;
				a4_101 = (word32) (word16) a4_91;
				if ((word32) (word16) t1_92 < a4_101)
					s2_103 = t1_92;
				uint32 s2_105 = s2_103 << 16;
				s2_106 = s2_105 >> 0x10;
				s7 = (word32) (word16) (s7 - (s2_105 >> 0x10));
				s1_114 = s1_1179;
			}
		}
		else
		{
			s11_356.u0 = 0x00;
			s7.u0 = 0x00;
			s2_106.u0 = 0x00;
			s1_114 = s1;
		}
		word16 wLoc5C_894 = (word16) a3;
		s3 = a2;
		Eq_2 s0_147 = a0_70;
		Eq_2 s10_149 = s2_106;
		Eq_2 s4_150 = 0x00;
		Eq_2 s9_151 = 0x00;
		word16 wLoc5A_577 = (word16) s8_162;
		while (s10_149 < s3)
		{
			Eq_2 a3_158 = s3 - s10_149;
			Eq_2 a4_159 = a3_158;
			Eq_2 a3_161 = (word32) (word16) a3_158;
			Eq_2 dwLoc5C_592 = SEQ(wLoc5A_577, wLoc5C_894);
			if (s8_162 < a3_161)
				a4_159 = (word32) wLoc5A_577;
			struct Eq_418050 * a0_185;
			word32 a4_188;
			word32 a5_189;
			word32 s5_203;
			uint32 s6_204;
			word32 s8_1160;
			word32 s1_1156;
			word32 a2_1157;
			word32 a7_1158;
			word32 s2_1159;
			Eq_2 a3_187;
			ra = pbuf_alloc(ra, s0_147, s1_114, 0x00B6, s8_162, 640, a3_161, a4_159, mstatus, dwLoc5C_592, dwLoc1C, s1, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s0_147, out s1_1156, out a0_185, out a1, out a2_1157, out a3_187, out a4_188, out a5_189, out a7_1158, out s2_1159, out s3, out s4_150, out s5_203, out s6_204, out s8_1160, out mstatus);
			s6 = s6_204 >> 0x10;
			if (a0_185 == null)
			{
l23073B0C:
				((word32) s0_147 + 26)->u2 = (word16) ((word32) *((word32) s0_147 + 26) | 0x0080);
				word32 a4_336 = (word32) g_w42026890;
				g_w42026890 = (word16) (a4_336 + 0x01);
				a5 = (struct Eq_417712 *) &g_t420267F0;
				if (s4_150 != 0x00)
				{
					word32 a0_1173;
					word32 a4_1175;
					word32 a3_1174;
					tcp_segs_free(ra, s0_147, s4_150, a3_187, a4_336 + 0x01, s4_150, mstatus, dwArg98, out a0_1173, out a1, out a3_1174, out a4_1175, out a5);
				}
				goto l230739D2;
			}
			0x00 = (int8) dwArg84;
			word32 a6_213 = (word32) a0_185->w000A;
			a0_185->w0008 = (word16) a4_188;
			a0_185->w000A = (word16) a4_188;
			word32 a0_222;
			word32 a2_1161;
			word32 a4_1162;
			Eq_2 s1_230 = lwip_chksum_copy(a0_185->t0004, (word32) s10_149 + a5_189, s6_204 >> 0x10, out a0_222, out a2_1161, out a4_1162);
			Eq_2 a4_244;
			word32 a5_1163;
			tcp_seg_add_chksum(a0_222, s6_204 >> 0x10, (word32) fp - 66, (word32) fp - 67, out a4_244, out a5_1163);
			s7 = (word32) (word16) (a6_213 - (s6_204 >> 0x10));
			if ((word32) (word16) (s5_203 + pbuf_clen(s1_230)) > 0x10)
			{
				word32 a2_1166;
				word32 s1_1164;
				word32 a4_1167;
				word32 s8_1172;
				word32 a0_1165;
				word32 a5_1168;
				word32 a7_1169;
				word32 s2_1170;
				word32 s5_1171;
				ra = pbuf_free(ra, s1_230, (word32) fp - 67, a4_244, s4_150, mstatus, dwArgC8, out s0_147, out s1_1164, out a0_1165, out a1, out a2_1166, out a3_187, out a4_1167, out a5_1168, out a7_1169, out s2_1170, out s3, out s4_150, out s5_1171, out s6, out s8_1172, out mstatus);
				goto l23073B0C;
			}
			Eq_2 a0_259;
			word32 a2_1177;
			word32 s1_1176;
			word32 a4_1178;
			ra = tcp_create_segment(ra, dwArg19, s1_230, null, (word32) s10_149 + ((word32) fp - 67), 0x00, mstatus, dwArg78, dwArg98, dwArgC8, out s0_147, out s1_1176, out a0_259, out a1, out a2_1177, out a3_187, out a4_1178, out a5, out s2_106, out s3, out s4_150, out s5_270, out s6, out s8_162, out mstatus);
			s1_114 = a0_259;
			if (a0_259 == 0x00)
				goto l23073B0C;
			*((word32) a0_259 + 0x0A) = 0x00;
			*((word32) a0_259 + 0x0C) = 0x00;
			ui32 a4_289 = (word32) *((word32) a0_259 + 0x0D);
			*((word32) a0_259 + 0x0D) = (byte) (a4_289 | 4);
			a4_101 = a4_289 | 4;
			if (s4_150 != 0x00)
				*s9_151 = a0_259;
			else
				s4_150 = a0_259;
			s10_149 = CONVERT(SLICE(s10_149 + s6, word16, 0), word16, word32);
			s9_151 = a0_259;
		}
		if (s2_106 != 0x00)
		{
			struct Eq_417887 * s10_359;
			s6 = (word32) s11_356 + 0x0C;
			word16 * s9_361 = (word32) s11_356 + 0x0A;
			for (s10_359 = *((word32) s11_356 + 4); s10_359 != null; s10_359 = s10_359->ptr0000)
			{
				s10_359->w0008 = (word16) ((byte) s2_106.u0 + (word32) s10_359->w0008);
				if (s10_359->ptr0000 == null)
				{
					word32 a4_369 = (word32) s10_359->w000A;
					int32 a0_370 = s10_359->dw0004;
					0x00 = dwArg04;
					word32 a0_375;
					word32 a2_1153;
					word32 a4_1154;
					s1_114 = lwip_chksum_copy(a0_370 + a4_369, a1, s2_106, out a0_375, out a2_1153, out a4_1154);
					word32 a4_1155;
					a1 = tcp_seg_add_chksum(a0_375, s2_106, s9_361, s6, out a4_1155, out a5);
					*((word32) s11_356 + 0x0D) = (byte) ((word32) *((word32) s11_356 + 0x0D) | 4);
					s10_359->w000A = (word16) ((byte) s2_106.u0 + (word32) s10_359->w000A);
				}
			}
			a4_101 = (word32) *((word32) s11_356 + 8);
			((word32) s11_356 + 8)->u2 = (word16) ((byte) s2_106.u0 + a4_101);
		}
		*((word32) s0_147 + 0x0068) = (word16) s7;
		if (s11_356 == 0x00)
			*((word32) s0_147 + 0x006C) = s4_150;
		else
			*s11_356 = s4_150;
		struct Eq_417916 * s0_444 = a5->ptr005C;
		word32 a2_445 = (word32) s0_444->w0064;
		s0_444->w0066 = (word16) s5_270;
		a5 += s3;
		a5->ptr005C = s0_444;
		s3 = a2_445 - s3;
		s0_444->w0064 = (word16) s3;
		s2_30 = null;
		if (s1_114 != 0x00 && a5 != null)
		{
			s7 = a4_101 & 2;
			if (s7 == 0x00)
			{
				uint32 a0_493 = (word32) (word16) (lwip_htons(0x08, out a5) | ((word32) a5->b000D << 8 | (word32) a5->b000C));
				a5->b000C = (byte) a0_493;
				a5->b000D = (byte) (a0_493 >> 8);
			}
		}
	}
l230739D4:
	a0Out = s2_30;
	a1Out = a1;
	a2Out = dwArg011C;
	a3Out = dwArg08;
	a5Out = a5;
	s2Out = s2_30;
	s3Out = s3;
	s4Out = dwArgDC;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArgBC;
	mstatusOut = mstatus;
	return dwArg68;
}

