pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23073C56: void tcp_split_unsent_seg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      tcp_tmr
void tcp_split_unsent_seg(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	if (s0 == 0x00)
		return;
	if (a1 == 0x00)
		return;
	Eq_2 s6_29 = (word32) *((word32) s0 + 8);
	if (a1 >= s6_29)
		return;
	Eq_2 s7_36 = (word32) (word16) (s6_29 - a1);
	Eq_2 a0_47;
	word32 s1_53;
	word32 s3_59;
	word32 a1_649;
	word32 a2_650;
	word32 a4_651;
	word32 s0_648;
	word32 a5_652;
	word32 a7_653;
	word32 s2_654;
	word32 s5_655;
	word32 s6_656;
	word32 s8_657;
	ptr32 mstatus_197;
	Eq_2 a3_183;
	Eq_2 s4_205;
	Eq_2 ra_198 = pbuf_alloc(ra, s0, a1, 0x00B6, (word32) (word16) ((word32) s7_36 + (((word32) (*((word32) s0 + 0x0D)) & 0x00FB) << 0x02 & 4)), 640, a3, a4, mstatus, dwLoc4C, dwLoc0C, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_648, out s1_53, out a0_47, out a1_649, out a2_650, out a3_183, out a4_651, out a5_652, out a7_653, out s2_654, out s3_59, out s4_205, out s5_655, out s6_656, out s8_657, out mstatus_197);
	Eq_2 s5_191 = a0_47;
	if (a0_47 != 0x00)
	{
		Eq_2 a0_83;
		word32 s1_90;
		Eq_2 s2_91;
		Eq_2 a4_94;
		word32 s3_97;
		word32 a1_658;
		word32 a2_659;
		word32 a5_660;
		word32 s8_661;
		pbuf_copy_partial(a0_47, (word32) *((word32) a0_47 + 4) + s3_59, s7_36, (word32) (word16) ((uint16) (*((word32) a0_47 + 8) - *((word32) (*((word32) a0_47 + 4)) + 8)) + s1_53), out s1_90, out a0_83, out a1_658, out a2_659, out a3_183, out a4_94, out a5_660, out s2_91, out s3_97, out s4_205, out s8_661);
		if (a0_83 == s7_36)
		{
			ui32 s3_132;
			struct Eq_418379 * a5_121;
			struct Eq_418380 * a4_122;
			word32 a2_662;
			word32 a4_664;
			word32 a5_665;
			word32 a3_663;
			tcp_seg_add_chksum((word32) (word16) ~inet_chksum((word32) *((word32) a0_47 + 4) + s3_97, a0_83, a4_94, out a2_662, out a3_663, out a4_664, out a5_665), a0_83, fp + -50, fp + -0x0033, out a4_122, out a5_121);
			word32 a5_666;
			Eq_2 a0_128 = lwip_htons((word32) a5_121->b000C | (word32) a5_121->b000D << 8, out a5_666);
			struct Eq_406854 * a2_131 = a0_128 & 0x00FF & 8;
			if (a2_131 == null)
				s3_132 = a0_128 & 0x00FF & 63;
			else
			{
				s3_132 = a0_128 & 0x00FF & 55;
				a2_131 = (struct Eq_406854 *) 0x08;
			}
			if ((s3_132 & 1) != 0x00)
				a2_131 |= 1;
			Eq_2 a0_180;
			Eq_2 a4_184;
			word32 s1_187;
			Eq_2 s2_188;
			Eq_2 s3_189;
			word32 s6_199;
			word32 a3_667;
			word32 a4_668;
			word32 s0_670;
			word32 a5_669;
			word32 a1_671;
			word32 a2_672;
			word32 a5_673;
			word32 s4_674;
			word32 s8_675;
			ra_198 = tcp_create_segment(ra_198, s2_91, a0_47, a2_131, (word32) lwip_htonl((word32) a4_122->b0007 << 24 | ((word32) a4_122->b0006 << 16 | ((word32) a4_122->b0005 << 8 | (word32) a4_122->b0004)), out a3_667, out a4_668, out a5_669) + s1_90, s4_205, mstatus_197, dwArg88, dwArgA8, dwArgD8, out s0_670, out s1_187, out a0_180, out a1_671, out a2_672, out a3_183, out a4_184, out a5_673, out s2_188, out s3_189, out s4_674, out s5_191, out s6_199, out s8_675, out mstatus_197);
			s4_205 = a0_180;
			if (a0_180 != 0x00)
			{
				*((word32) a0_180 + 0x0A) = 0x00;
				*((word32) a0_180 + 0x0C) = 0x00;
				*((word32) a0_180 + 0x0D) = (byte) ((word32) *((word32) a0_180 + 0x0D) | 4);
				Eq_2 a0_258 = (word32) *((word32) s2_188 + 0x0066) - pbuf_clen(a0_180);
				*((word32) s2_188 + 0x0066) = (word16) a0_258;
				Eq_2 s0_260 = *((word32) a0_258 + 4);
				word32 s1_269;
				struct Eq_418539 * s2_277;
				Eq_2 s3_278;
				struct Eq_418541 * s4_279;
				word32 s8_681;
				word32 mstatus_682;
				word32 s5_679;
				word32 s6_680;
				word32 a3_677;
				word32 a5_678;
				word32 a2_676;
				Eq_2 a4_268;
				pbuf_realloc(ra_198, s0_260, a0_258, (word32) (uint16) ((word32) *((word32) a0_258 + 8) + (word16) (s1_187 - s6_199)), a3_183, a4_184, s2_188, s3_189, a0_180, mstatus_197, s8, s5, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0118, out s1_269, out a2_676, out a3_677, out a4_268, out a5_678, out s2_277, out s3_278, out s4_279, out s5_679, out s6_680, out s8_681, out mstatus_682);
				*((word32) *((word32) a4_268 + 16) + 8) = (word16) (s1_269 + (word32) (*((word32) s0_260 + 8)));
				ui32 s1_296 = (word32) *((word32) a4_268 + 0x0D) << 8 | (word32) (*((word32) a4_268 + 0x0C));
				word32 a5_683;
				Eq_2 a0_298 = lwip_htons(s3_278, out a5_683);
				uint32 a5_303 = (word32) (word16) (s1_296 | a0_298);
				*((word32) a4_268 + 0x0C) = (byte) a5_303;
				*((word32) a4_268 + 0x0D) = (byte) (a5_303 >> 8);
				struct Eq_418615 * s0_307 = *((word32) a0_298 + 4);
				s2_277->w0066 = (word16) (pbuf_clen(a0_298) + (word32) s2_277->w0066);
				struct Eq_418630 * s3_313 = s0_307->ptr0004;
				s0_307->w000A = 0x00;
				s0_307->b000C = 0x00;
				up32 s1_320 = (word32) (uint16) (s3_313->w0008 - s0_307->w0008);
				do
				{
					up32 a1_323 = (word32) s3_313->w000A;
					if (a1_323 >= s1_320)
					{
						do
						{
							word32 a3_685;
							word32 a4_686;
							word32 a5_687;
							word32 a5_688;
							word32 a2_684;
							tcp_seg_add_chksum((word32) (word16) ~inet_chksum(s3_313->dw0004 + s1_320, (word32) (word16) ((word32) s3_313->w000A - s1_320), a4_268, out a2_684, out a3_685, out a4_686, out a5_687), (word32) (word16) ((word32) s3_313->w000A - s1_320), &s0_307->w000A, &s0_307->b000C, out a4_268, out a5_688);
							s3_313 = s3_313->ptr0000;
							s1_320 = 0x00;
						} while (s3_313 != null);
						break;
					}
					s3_313 = s3_313->ptr0000;
					s1_320 = (word32) (word16) (s1_320 - a1_323);
				} while (s3_313 != null);
				word32 a0_370 = pbuf_clen(s4_279->t0004);
				struct Eq_418713 * a5_375 = (word32) s2_277->w0066;
				s2_277->w0066 = (word16) (a5_375 + a0_370 / 4);
				struct Eq_418723 * s0_378 = a5_375->ptr0000;
				s4_279->ptr0000 = a5_375;
				s0_378->ptr0000 = s4_279;
				if (s4_279->ptr0000 != null)
					return;
				s2_277->w0068 = 0x00;
				return;
			}
		}
	}
	word32 a4_209 = (word32) g_w42026890;
	g_w42026890 = (word16) (a4_209 + 0x01);
	if (s5_191 != 0x00)
	{
		word32 s0_689;
		word32 s1_690;
		word32 a0_691;
		word32 a1_692;
		word32 a4_695;
		word32 a2_693;
		word32 a7_697;
		word32 a3_694;
		word32 s3_699;
		word32 a5_696;
		word32 s2_698;
		word32 s4_700;
		word32 s5_701;
		word32 s6_702;
		word32 s8_703;
		word32 mstatus_704;
		pbuf_free(ra_198, s5_191, a3_183, a4_209 + 0x01, s4_205, mstatus_197, dwArgD8, out s0_689, out s1_690, out a0_691, out a1_692, out a2_693, out a3_694, out a4_695, out a5_696, out a7_697, out s2_698, out s3_699, out s4_700, out s5_701, out s6_702, out s8_703, out mstatus_704);
	}
}

// 23073ED6: Register Eq_2 tcp_enqueue_flags(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_406853) s0Out, Register out (ptr32 Eq_406854) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 (ptr32 Eq_418864)) a4Out, Register out (ptr32 Eq_406860) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_input
//      tcp_send_fin
//      altcp_tcp_connect
Eq_2 tcp_enqueue_flags(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, struct Eq_406853 & s0Out, struct Eq_406854 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_418864 & a4Out, struct Eq_406860 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a0_117;
	struct Eq_406860 * a5_114;
	struct Eq_418864 ** a4_127;
	Eq_2 a4_6 = a1 >> 0x01 & 0x01;
	Eq_2 a0_25;
	Eq_2 a4_28;
	word32 a5_304;
	word32 a7_305;
	word32 s4_306;
	word32 s8_307;
	word32 a2_303;
	Eq_2 a3_197;
	ptr32 a1_185;
	ptr32 mstatus_214;
	struct Eq_406853 * s0_101;
	struct Eq_406854 * s1_100;
	ptr32 s2_230;
	ptr32 s3_234;
	ptr32 s5_240;
	ptr32 s6_246;
	Eq_2 ra_220 = pbuf_alloc(ra, a0, a1, 0x00B6, a4_6 << 0x02, 640, a3, a4_6, mstatus, dwLoc1C, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_101, out s1_100, out a0_25, out a1_185, out a2_303, out a3_197, out a4_28, out a5_304, out a7_305, out s2_230, out s3_234, out s4_306, out s5_240, out s6_246, out s8_307, out mstatus_214);
	ptr32 a2_191 = dwArgA4;
	if (a0_25 != 0x00)
	{
		struct Eq_418861 * a0_55;
		word32 s4_308;
		word32 s8_309;
		struct Eq_418864 * a5_60;
		ra_220 = tcp_create_segment(ra_220, *((word32) a3_197 + 92), a0_25, s1_100, a3_197, a4_28, mstatus_214, dwArgB8, dwArgD8, dwArg0108, out s0_101, out s1_100, out a0_55, out a1_185, out a2_191, out a3_197, out a4_127, out a5_60, out s2_230, out s3_234, out s4_308, out s5_240, out s6_246, out s8_309, out mstatus_214);
		if (a0_55 != null)
		{
			s0_101 = a5_60->ptr006C;
			if (a5_60 == null)
				a0_55->ptr006C = s0_101;
			else
			{
				do
					a5_60 = (struct Eq_418864 *) *a4_127;
				while (a4_127 != null);
				a0_55->ptr0000 = a5_60;
			}
			s0_101->w0068 = 0x00;
			if (s2_230 != 0x00)
			{
				s0_101 = a5_60->ptr005C;
				a5_60->ptr005D = s0_101;
			}
			s1_100 &= 0x01;
			if ((s1_100 & 0x01) != 0x00)
				s0_101->w001A = (word16) ((word32) s0_101->w001A | 32);
			word32 a0_111 = pbuf_clen(a0_55->t0004);
			a5_114 = (word32) s0_101->w0066;
			s0_101->w0066 = (word16) (a5_114 + a0_111 / 8);
			a0_117 = 0x00;
l23073F24:
			s0Out = s0_101;
			s1Out = s1_100;
			a0Out = a0_117;
			a1Out = a1_185;
			a2Out = a2_191;
			a3Out = a3_197;
			a4Out = a4_127;
			a5Out = a5_114;
			s2Out = s2_230;
			s3Out = s3_234;
			s4Out = dwArg04;
			s5Out = s5_240;
			s6Out = s6_246;
			s8Out = dwLoc1C;
			mstatusOut = mstatus_214;
			return ra_220;
		}
	}
	s0_101->w001A = (word16) ((word32) s0_101->w001A | 0x0080);
	word32 a4_126 = (word32) g_w42026890;
	g_w42026890 = (word16) (a4_126 + 0x01);
	a0_117 = ~0x00;
	a5_114 = (struct Eq_406860 *) &g_t420267F0;
	a4_127 = a4_126 + 0x01;
	goto l23073F24;
}

// 23073F80: Register Eq_2 tcp_send_fin(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register (ptr32 Eq_405573) a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_close_shutdown_fin
Eq_2 tcp_send_fin(Eq_2 ra, Eq_2 s1, Eq_2 a3, struct Eq_405573 * a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_12 = *((word32) s1 + 0x006C);
	if (s1 != 0x00)
	{
		do
			;
		while (a5 != null);
		struct Eq_418955 * a5_24;
		if ((lwip_htons((word32) a5->b000C | (word32) a5->b000D << 8, out a5_24) & 0x07) == 0x00)
		{
			ui32 s0_30 = (word32) a5_24->b000D << 8 | (word32) a5_24->b000C;
			struct Eq_418986 * a5_33;
			Eq_2 a0_32 = lwip_htons(0x01, out a5_33);
			ptr32 s1_34 = a5_33->ptr0010;
			uint32 a0_37 = (word32) (word16) (a0_32 | s0_30);
			a5_33->b000C = (byte) a0_37;
			a5_33->b000D = (byte) (a0_37 >> 8);
			((word32) a0_12 + 26)->u2 = (word16) ((word32) *((word32) a0_12 + 26) | 32);
			0x00 = (int8) dwArg38;
			s0Out = s0;
			s1Out = s1_34;
			a0Out = 0x00;
			a1Out = a1;
			a2Out = dwArg10;
			a3Out = a3;
			s2Out = a0_12;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s8Out = s8;
			mstatusOut = mstatus;
			return ra;
		}
	}
	0x00 = (int8) dwArg38;
	ptr32 a0_68;
	ptr32 a1_69;
	ptr32 a2_70;
	Eq_2 a3_71;
	ptr32 mstatus_76;
	ptr32 s0_78;
	ptr32 s1_79;
	Eq_2 s2_80;
	ptr32 s3_81;
	ptr32 s4_82;
	ptr32 s5_83;
	ptr32 s6_84;
	ptr32 s8_85;
	word32 a4_205;
	word32 a5_206;
	Eq_2 ra_77 = tcp_enqueue_flags(ra, a0_12, 0x01, a3, mstatus, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_78, out s1_79, out a0_68, out a1_69, out a2_70, out a3_71, out a4_205, out a5_206, out s2_80, out s3_81, out s4_82, out s5_83, out s6_84, out s8_85, out mstatus_76);
	s0Out = s0_78;
	s1Out = s1_79;
	a0Out = a0_68;
	a1Out = a1_69;
	a2Out = a2_70;
	a3Out = a3_71;
	s2Out = s2_80;
	s3Out = s3_81;
	s4Out = s4_82;
	s5Out = s5_83;
	s6Out = s6_84;
	s8Out = s8_85;
	mstatusOut = mstatus_76;
	return ra_77;
}

// 23073FFE: Register Eq_2 tcp_rexmit_rto_prepare(Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 a5, Register out Eq_2 s1Out, Register out (ptr32 Eq_410576) a0Out, Register out Eq_410577 a2Out, Register out Eq_410578 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_410576) a5Out, Register out (ptr32 Eq_410581) s2Out, Register out (ptr32 Eq_410582) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      tcp_tmr
//      tcp_rexmit_rto
Eq_2 tcp_rexmit_rto_prepare(Eq_2 s1, Eq_2 a4, Eq_2 a5, union Eq_2 & s1Out, struct Eq_405733 & a0Out, union Eq_410577 & a2Out, union Eq_410578 & a3Out, union Eq_2 & a4Out, struct Eq_405733 & a5Out, struct Eq_410581 & s2Out, struct Eq_410582 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_405733 * a5_25;
	Eq_410578 a3_109 = 0x01;
	if (s1 != 0x00)
	{
		do
		{
			s1 = *a5;
			a4 = (word32) *((word32) a4 + 0x0E);
			if (a5 == 0x00)
			{
				a3_109.u0 = 0x01;
				a5_25 = (struct Eq_405733 *) ~0x05;
				if (a4 == 0x01)
				{
					*(union Eq_2 *) ~0x05 = s1;
					Eq_2 a0_30 = *(union Eq_2 *) 0x6A;
					((word32) a0_30 + 112)->u0 = 0x00;
					*(union Eq_2 *) 0x66 = a0_30;
					((word32) a0_30 + 26)->u2 = (word16) ((word32) *((word32) a0_30 + 26) | 0x00FFF800);
					struct Eq_419112 * a5_51;
					Eq_2 a0_48 = lwip_htonl((word32) *(byte *) 0x00FFF807 << 24 | ((word32) (*((byte *) 0x00FFF806)) << 16 | ((word32) (*((byte *) 0x00FFF805)) << 8 | (word32) (*((byte *) 0x00FFF804)))), out a3_109, out a4, out a5_51);
					s1 = a5_51->t0010;
					s3 = (word32) *((word32) s1 + 8);
					s2 = a0_48 + s3;
					word32 a5_134;
					(s2 + (word32) ((lwip_htons((word32) a5_51->b000C | (word32) a5_51->b000D << 8, out a5_134) & 0x03) != 0x00))[76] = (struct Eq_410581) a0_30;
					((word32) a0_30 + 52)->u0 = 0x00;
					s0 = a0_30;
					a5_25 = null;
				}
				goto l23074096;
			}
			s1 = a5;
		} while (a4 == 0x01);
	}
	a5_25 = (struct Eq_405733 *) ~0x05;
l23074096:
	s1Out = s1;
	a0Out = a5_25;
	a2Out = dwArg48;
	a3Out = a3_109;
	a4Out = a4;
	a5Out = a5_25;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0;
}

// 230740A6: Register Eq_2 tcp_rexmit(Register Eq_2 s1, Register out Eq_2 s1Out, Register out (ptr32 Eq_416603) a0Out, Register out (ptr32 Eq_416604) a3Out, Register out (ptr32 Eq_416605) a4Out, Register out (ptr32 Eq_416603) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 uint16) s8Out)
// Called from:
//      tcp_input
//      tcp_rexmit_fast
Eq_2 tcp_rexmit(Eq_2 s1, union Eq_2 & s1Out, struct Eq_416603 & a0Out, struct Eq_416604 & a3Out, struct Eq_416605 & a4Out, struct Eq_416603 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, byte & s4Out, uint16 & s8Out)
{
	Eq_2 a0_14 = *((word32) s1 + 112);
	struct Eq_416603 * a5_15 = (struct Eq_416603 *) ~0x05;
	if (s1 != 0x00)
	{
		s1 = *(union Eq_2 *) ~0x01;
		a4 = (struct Eq_416605 *) 0x01;
		a3 = (word32) *(union Eq_2 *) 0x08;
		a5_15 = (struct Eq_416603 *) ~0x05;
		if (a3 == (struct Eq_416604 *) 0x01)
		{
			Eq_2 s1_20 = *(union Eq_2 *) ~0x05;
			*(union Eq_2 *) 0x6A = a0_14;
			s0 = a0_14;
			s2 = (word32) a0_14 + 0x006C;
			while (*s2 != 0x00)
			{
				struct Eq_419208 * a4_41;
				word32 a5_161;
				word32 a3_160;
				Eq_2 a0_39 = lwip_htonl((word32) a4->t0007 << 24 | ((word32) a4->t0006 << 16 | ((word32) a4->b0005 << 8 | (word32) a4->b0004)), out a3_160, out a4_41, out a5_161);
				s1_20 = a4_41->t0010;
				s3 = a0_39;
				word32 a5_162;
				if (a0_39 - lwip_htonl((word32) a4_41->b0007 << 24 | ((word32) a4_41->b0006 << 16 | ((word32) a4_41->b0005 << 8 | (word32) a4_41->b0004)), out a3, out a4, out a5_162) >= 0x00)
					break;
				s2 = *s2;
			}
			Eq_2 a5_63 = *s2;
			*a5_63 = s1_20;
			*s2 = s1_20;
			s1 = *a5_63;
			if (a5_63 == 0x00)
				((word32) a0_14 + 0x0068)->u0 = 0x00;
			int32 a5_74 = (word32) *((word32) a0_14 + 66);
			a4 = (struct Eq_416605 *) 0x00FF;
			if (a5_74 != 0x00FF)
				*((word32) a0_14 + 66) = (byte) (a5_74 + 0x01);
			((word32) a0_14 + 52)->u0 = 0x00;
			a5_15 = null;
		}
	}
	s1Out = s1;
	a0Out = a5_15;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_15;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0;
}

