pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307427C: Register Eq_2 tcp_output(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_405733) a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_405740) s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out ptr32 s10Out, Register out Eq_405748 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_close_shutdown_fin
//      tcp_pcb_remove
//      tcp_fasttmr
//      tcp_tmr
//      tcp_input
//      tcp_rexmit_rto
//      lwip_netconn_do_write
//      altcp_tcp_output
//      altcp_tcp_connect
//      altcp_tcp_recved
Eq_2 tcp_output(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_405733 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_405740 & s3Out, byte & s4Out, byte & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & s10Out, union Eq_405748 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_5 = g_t42026910;
	if (a5_5 == a0)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = null;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a5_1514;
	struct Eq_405733 * a0_1478;
	Eq_2 s2_1570;
	Eq_2 a0_35 = *((word32) s1 + 0x006C);
	Eq_2 s0_36 = a0_35;
	if (s1 == 0x00)
	{
		s2_1570 = s2;
		if (((word32) *((word32) a0_35 + 26) & 0x02) != 0x00)
			goto l230742B4;
	}
	else
	{
		Eq_2 a0_43;
		s6 = (word32) *((word32) a0_35 + 72);
		s2_1570 = (word32) *((word32) a0_35 + 96);
		s5 = (word32) a0_35 + 4;
		Eq_2 a0_40 = (word32) *((word32) a0_35 + 8);
		if (a0_40 != 0x00)
			a0_43 = netif_get_by_index(a0_40, out a4, out a5_1514);
		else
		{
			word32 a3_1747;
			word32 a2_1746;
			a0_43 = ip4_route(a2, a5_5, out a2_1746, out a3_1747, out a4, out a5_1514);
		}
		Eq_2 s4_226 = a0_43;
		if (a0_43 == 0x00)
		{
			a0_1478 = (struct Eq_405733 *) ~0x03;
l2307458E:
			0x00 = (int8) dwArg010C;
			s0Out = dwArgCC;
			s1Out = dwLoc4C;
			a0Out = a0_1478;
			a1Out = a1;
			a2Out = dwArg01A8;
			a3Out = s2;
			a4Out = a4;
			a5Out = a5_1514;
			s2Out = s2_1570;
			s3Out = s3;
			s4Out = dwArg0168;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = dwArg0148;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return dwLoc08;
		}
		word32 s0_56 = *a5_1514;
		if (a5_1514 == 0x00)
			*a5_1514 = s0_56;
		Eq_2 s3_61 = s6;
		if (s2_1570 < s6)
			s3_61 = s2_1570;
		Eq_2 s1_70 = *((word32) a4 + 16);
		uint32 s3_72 = s3_61 << 16;
		word32 a3_1748;
		word32 a5_1749;
		Eq_2 a0_84 = lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_1748, out a4, out a5_1749);
		s3 = s3_72 >> 0x10;
		s0_36 = *((word32) a4 + 0x0044);
		if (s3_72 >> 0x10 < (word32) a0_84 + ((word32) (*((word32) s1_70 + 8)) - a4))
		{
			struct Eq_419761 * a5_665 = (word32) *((word32) s0_36 + 96);
			if (a5_665 == s3_72 >> 0x10)
			{
				s0_36 = a5_665->t0070;
				if (a5_665 == null && (word32) (*((word32) s0_36 + 161)) == 0x00)
				{
					*((word32) s0_36 + 0x00A0) = 0x0100;
					*((word32) s0_36 + 0x00A2) = 0x00;
				}
			}
			if (((word32) *((word32) s0_36 + 26) & 0x02) != 0x00)
			{
				a0_35 = s0_36;
l230742B4:
				0x00 = (int8) dwArg010C;
				struct Eq_405733 * a0_736;
				ptr32 a1_737;
				Eq_2 a2_738;
				Eq_2 a3_739;
				Eq_2 a4_740;
				Eq_2 a5_741;
				ptr32 mstatus_744;
				Eq_2 s1_746;
				Eq_2 s2_747;
				struct Eq_405740 * s3_748;
				byte * s4_749;
				byte * s5_750;
				Eq_2 s6_751;
				Eq_2 s7_752;
				ptr32 s8_753;
				Eq_2 s9_754;
				Eq_2 ra_745 = tcp_send_empty_ack(dwLoc08, dwArgCC, a0_35, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s1_746, out a0_736, out a1_737, out a2_738, out a3_739, out a4_740, out a5_741, out s2_747, out s3_748, out s4_749, out s5_750, out s6_751, out s7_752, out s8_753, out s9_754, out mstatus_744);
				s0Out = dwArgCC;
				s1Out = s1_746;
				a0Out = a0_736;
				a1Out = a1_737;
				a2Out = a2_738;
				a3Out = a3_739;
				a4Out = a4_740;
				a5Out = a5_741;
				s2Out = s2_747;
				s3Out = s3_748;
				s4Out = s4_749;
				s5Out = s5_750;
				s6Out = s6_751;
				s7Out = s7_752;
				s8Out = s8_753;
				s9Out = s9_754;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus_744;
				return ra_745;
			}
		}
		else
		{
			s2_1570 = *((word32) s0_36 + 112);
			*((word32) s0_36 + 161) = 0x00;
			if (s2_1570 != 0x00)
			{
				while (true)
				{
					Eq_2 a5_96 = *s2_1570;
					if (a5_96 == 0x00)
						break;
					s2_1570 = a5_96;
				}
			}
			s9.u0 = 0x0F;
			s7.u0 = 0x02;
			struct Eq_419803 * s8_101 = (struct Eq_419803 *) 0x01;
			s6.u0 = 0x420267F0;
			s10 = 0x42027000;
			s11.u0 = 0x02040000;
			do
			{
				Eq_2 s1_107 = *((word32) a4 + 16);
				union Eq_2 * a3_119;
				word32 a5_121;
				up32 a0_123 = lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_119, out a4, out a5_121) - a5_121;
				struct Eq_419846 * a5_124 = (word32) *((word32) s1_107 + 8);
				if (s3 < a5_124 + a0_123 / 112)
				{
l2307478C:
					s0_36 = a5_124->t006C;
					if (a5_124 == null)
						break;
					goto l23074794;
				}
				struct Eq_419858 * a5_133;
				Eq_2 a0_132 = lwip_htons((word32) a5_124->b000C | (word32) a5_124->b000D << 8, out a5_133);
				Eq_2 s0_134 = a5_133->t0070;
				if (a5_133 != null)
				{
					ui32 a5_135 = (word32) *((word32) s0_134 + 26);
					a4 = a5_135 & 0x0044;
					if ((a5_135 & 0x0044) != 0x00)
						goto l23074398;
					s0_134 = (a5_135 & 0x0044)->t006C;
					if ((a5_135 & 0x0044) != 0x00)
					{
						a4 = *a3_119;
						if (a3_119 != null)
							goto l23074398;
						a4 = (word32) *((word32) s0_134 + 50);
						if ((word32) *((word32) a4 + 8) < a4)
							goto l23074774;
						goto l23074398;
					}
l23074774:
					a4 = (word32) *((word32) s0_134 + 100);
					if (a4 == 0x00)
						goto l23074398;
					a4 = (word32) *((word32) s0_134 + 0x0066);
					if (s9 < a4)
						goto l23074398;
					a5_124 = a5_135 & 0x00A0;
					if ((a5_135 & 0x00A0) == 0x00)
						goto l2307478C;
				}
l23074398:
				Eq_2 a5_167;
				Eq_2 a5_151 = (word32) *((word32) s0_134 + 20);
				if (a5_151 != s7)
				{
					uint32 a0_172 = (word32) (word16) (lwip_htons(0x10, out a5_167) | a5_167);
					*((word32) a4 + 0x0C) = (byte) a0_172;
					*((word32) a4 + 0x0D) = (byte) (a0_172 >> 8);
					s0_134 = dwArg94;
					a0_132 = a0_172 >> 8;
					a5_151 = a5_167;
				}
				struct Eq_419803 * a5_179 = (word32) *((word32) a5_151 + 0x0E);
				if (a5_179 == s8_101)
				{
					struct Eq_419971 * a5_194;
					word32 a4_1750;
					struct Eq_419973 * a3_192;
					Eq_2 a0_191 = lwip_htonl(a0_132, out a3_192, out a4_1750, out a5_194);
					a5_194->b0008 = (byte) a0_191;
					a5_194->b0009 = (byte) (a0_191 >> 0x08);
					a5_194->b000A = (byte) (a0_191 >> 0x10);
					a5_194->b000B = (byte) (a0_191 >> 24);
					struct Eq_420002 * s1_203 = a5_194->ptr0010;
					struct Eq_420006 * a5_207;
					Eq_2 a0_206 = lwip_htons((word32) *((word32) dwArg94 + 42), out a5_207);
					a5_207->b000E = (byte) a0_206;
					a5_207->b000F = (byte) (a0_206 >> 8);
					struct Eq_420025 * a4_212 = (word32) *((word32) dwArg94 + 42);
					Eq_2 s0_213 = a5_207->t0024;
					Mem215[a5_207 + a4_212 + 44:word32] = s0_213;
					if (((word32) s1_203->b000D & 0x01) != 0x00)
					{
						word32 a5_243;
						word32 a3_1751;
						*((word32) lwip_htonl(tcp_eff_send_mss_netif((int32 *) 688, s4_226, out a3_1751) | 0x02040000, out a3_192, out a4_212, out a5_243) + 20) = a5_243;
						s0_213 = dwArg94;
					}
					struct Eq_420046 * a5_248 = (int32) *((word32) s0_213 + 48);
					if (a5_248 < null)
						((word32) s0_213 + 48)->u1 = 0x00;
					Eq_2 s0_252 = a5_248->t0034;
					if (a5_248 == null)
					{
						*((word32) g_t420268FC + 52) = s0_252;
						word32 a4_1754;
						*((word32) lwip_htonl((word32) a4_212->b0007 << 24 | ((word32) a4_212->b0006 << 16 | ((word32) a4_212->b0005 << 8 | (word32) a4_212->b0004)), out a3_192, out a4_1754, out a5_248) + 56) = s0_252;
					}
					Eq_420167 a4_287 = a3_192->t0004;
					word32 a5_291 = (word32) (word16) (a5_248 - a3_192);
					struct Eq_420175 * a3_292 = (word32) *((word32) a4_287 + 0x0A) - a5_291;
					*((word32) a4_287 + 0x0A) = (word16) a3_292;
					struct Eq_420185 * a4_295 = (word32) a3_292->w0008;
					struct Eq_420190 * a5_296 = a4_295 - a5_291;
					a3_292->w0008 = (word16) a5_296;
					struct Eq_420196 * s1_299 = a4_295->ptr0004;
					a5_296->ptr0004 = a4_295;
					a5_296->b0010 = 0x00;
					a5_296->b0011 = 0x00;
					ui32 a5_303 = (word32) s1_299->b000D;
					struct Eq_420216 * a5_304 = a5_303 & 0x04;
					if ((a5_303 & 0x04) == 0x00)
					{
						s1_299 = (a5_303 & 0x04)->ptr0010;
						lwip_htons((word32) (a5_303 & 0x04)->b000C | (word32) (a5_303 & 0x04)->b000D << 8, out a5_304);
					}
					Eq_2 a6_314 = s1_299->t0004;
					word32 a0_342;
					struct Eq_420300 * s1_350;
					Eq_2 s4_353;
					Eq_2 s5_354;
					Eq_2 s6_355;
					word32 a5_1755;
					word32 s3_1756;
					struct Eq_420306 * a4_346;
					Eq_2 s0_349 = ip_chksum_pseudo_partial(a6_314, 0x06, dwLoc48, lwip_htons((word32) a5_304->b000C | (word32) a5_304->b000D << 8, out a5_1755) >> 0x0A & 252, a6_314, dwArgD8, out s1_350, out a0_342, out a4_346, out s3_1756, out s4_353, out s5_354, out s6_355);
					Eq_2 a7_360 = 0x00;
					if ((word32) s1_350->b000C != 0x00)
					{
						uint32 a5_361 = (word32) s1_350->w000A;
						s1_350->b000C = 0x00;
						s1_350->w000A = (word16) (a5_361 >> 8 | a5_361 << 0x08);
						a7_360.u0 = 0x01;
						a4_346 = a5_361 << 0x08;
					}
					Eq_2 a0_377 = (uint16) (s1_350->w000A + (word16) (~a0_342));
					uint32 a5_382 = (word32) (word16) ~((word32) a0_377 + (a0_377 >> 0x10));
					a4_346->b0010 = (byte) a5_382;
					a4_346->b0011 = (byte) (a5_382 >> 8);
					((word32) s6_355 + 0x0094)->u2 = (word16) ((word32) *((word32) s6_355 + 0x0094) + 0x01);
					dwLoc4C = a7_360;
					word32 a7_425;
					struct Eq_420509 * s1_428;
					word32 a3_1766;
					word32 s0_1765;
					ra = ip4_output_if(ra, s0_349, *((word32) a0_377 + 4), a0_377, s0_349, s5_354, (word32) *((word32) s0_349 + 11), (word32) *((word32) s0_349 + 0x0A), 0x06, s4_353, s4_353, s5_354, s6_355, s7, out s0_1765, out s1_428, out a0_1478, out a1, out a3_1766, out a4, out a5_179, out a7_425, out s2_1570, out s3, out s4_226, out s5, out s6, out s7, out s8_101, out s9);
					s0_134 = dwLoc28;
					if (a7_425 != 0x00)
					{
						uint32 a5_445 = (word32) s1_428->w000A;
						s1_428->b000C = (byte) s8_101;
						a5_179 = a5_445 >> 8 | a5_445 << 0x08;
						s1_428->w000A = (word16) a5_179;
						a4 = a5_445 << 0x08;
					}
					if (a0_1478 != null)
					{
						ui32 a5_657 = (word32) *((word32) dwLoc28 + 26);
						((word32) dwLoc28 + 26)->u2 = (word16) (a5_657 | 0x0080);
						a5_1514 = a5_657 | 0x0080;
						goto l2307458E;
					}
				}
				a5_179->t006C = s0_134;
				if ((word32) *((word32) s0_134 + 20) != s7)
					((word32) s0_134 + 26)->u2 = (word16) ((word32) *((word32) s0_134 + 26) & ~0x03);
				Eq_2 s1_472 = *((word32) a4 + 16);
				struct Eq_420083 * a4_485;
				word32 a3_1752;
				word32 a5_1753;
				lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_1752, out a4_485, out a5_1753);
				Eq_2 a3_487 = (word32) *((word32) s1_472 + 8);
				struct Eq_420121 * s1_488 = a4_485->ptr0010;
				struct Eq_420125 * a5_504 = (word32) a3_487 + a5_499;
				word32 a5_499;
				struct Eq_420128 * a0_505 = a5_504 + (word32) ((lwip_htons((word32) a4_485->b000C | (word32) a4_485->b000D << 8, out a5_499) & 0x03) != 0x00) / 84;
				word32 s0_506 = a5_504->dw0050;
				struct Eq_420153 * a5_507 = a5_504 - a0_505;
				if (a5_507 < null)
					a0_505->dw0050 = s0_506;
				a4 = (word32) s1_488->w0008;
				Eq_2 s1_513 = a5_507->t0010;
				dwLoc4C = a4;
				struct Eq_420269 * a5_521;
				if ((word32) a4 + (word32) ((lwip_htons((word32) a5_507->b000C | (word32) a5_507->b000D << 8, out a5_521) & 0x03) != 0x00) != 0x00)
				{
					s1_513->u0 = 0x00;
					Eq_2 s0_558 = a5_521->t0070;
					if (a5_521 == null)
					{
						*((word32) s1_513 + 112) = s0_558;
						goto l23074646;
					}
					s1_513 = *((word32) a4 + 16);
					word32 a5_1763;
					word32 a3_1761;
					word32 a4_1762;
					Eq_2 a0_570 = lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_1761, out a4_1762, out a5_1763);
					struct Eq_420425 * a4_582 = *((word32) s2_1570 + 16);
					dwLoc4C = a0_570;
					a3_604 = a3_595;
					struct Eq_420429 * a3_595;
					word32 a5_1764;
					if (a3_595 - lwip_htonl((word32) a4_582->b0007 << 24 | ((word32) a4_582->b0006 << 16 | ((word32) a4_582->b0005 << 8 | (word32) a4_582->b0004)), out a3_595, out a4, out a5_1764) >= 0x00)
					{
						*s2_1570 = s1_513;
l23074646:
						s2_1570 = s1_513;
					}
					else
					{
						do
						{
							struct Eq_420429 * a3_604;
							if (a4 == 0x00)
								break;
							struct Eq_420591 * a3_619;
							word32 a5_1768;
							word32 a4_1767;
							Eq_2 a0_618 = lwip_htonl((word32) a3_604->b0007 << 24 | ((word32) a3_604->b0006 << 16 | ((word32) a3_604->b0005 << 8 | (word32) a3_604->t0004)), out a3_619, out a4_1767, out a5_1768);
							s1_513 = a3_619->t0010;
							dwLoc4C = a0_618;
							word32 a5_1769;
						} while (dwArg94 - lwip_htonl((word32) a3_619->b0007 << 24 | ((word32) a3_619->b0006 << 16 | ((word32) a3_619->b0005 << 8 | (word32) a3_619->b0004)), out a3_604, out a4, out a5_1769) < 0x00);
						Eq_2 a5_644 = *a4;
						*a4 = s1_513;
						*s1_513 = a5_644;
					}
				}
				else
				{
					word32 a0_1757;
					word32 a5_1760;
					word32 a2_1758;
					word32 a3_1759;
					s1_513 = tcp_seg_free(ra, s1_513, a3_487, a4, s4_226, mstatus, dwArgB8, out a0_1757, out a1, out a2_1758, out a3_1759, out a4, out a5_1760);
				}
				s0_36 = *((word32) s1_513 + 0x006C);
			} while (s1_513 != 0x00);
			((word32) s0_36 + 0x0068)->u0 = 0x00;
		}
	}
l23074794:
	ui32 a5_680 = (word32) *((word32) s0_36 + 26);
	((word32) s0_36 + 26)->u2 = (word16) (a5_680 & -0x0081);
	a0_1478 = null;
	a5_1514 = a5_680 & -0x0081;
	goto l2307458E;
}

