pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 230747B4: Register Eq_2 tcp_rexmit_rto_commit(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_410718) s0Out, Register out Eq_410719 s1Out, Register out (ptr32 Eq_410720) a0Out, Register out Eq_410721 a2Out, Register out Eq_410722 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_410724) s2Out, Register out (ptr32 Eq_410725) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 Eq_410728) s6Out, Register out (ptr32 Eq_410729) s7Out, Register out Eq_410730 s8Out, Register out ptr32 s9Out, Register out Eq_410732 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_tmr
//      tcp_rexmit_rto
Eq_2 tcp_rexmit_rto_commit(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, struct Eq_410718 & s0Out, union Eq_410719 & s1Out, struct Eq_405733 & a0Out, union Eq_410721 & a2Out, union Eq_410722 & a3Out, ptr32 & a4Out, struct Eq_410724 & s2Out, struct Eq_410725 & s3Out, ptr32 & s4Out, byte & s5Out, struct Eq_410728 & s6Out, struct Eq_410729 & s7Out, union Eq_410730 & s8Out, ptr32 & s9Out, union Eq_410732 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	int32 a5_5 = (word32) *((word32) a0 + 66);
	if (a5_5 != 0x00FF)
		*((word32) a0 + 66) = (byte) (a5_5 + 0x01);
	struct Eq_405733 * a0_22;
	Eq_410721 a2_24;
	Eq_410722 a3_25;
	ptr32 a4_26;
	struct Eq_410718 * s0_29;
	Eq_410719 s1_30;
	struct Eq_410724 * s2_31;
	ptr32 s4_32;
	byte * s5_33;
	struct Eq_410728 * s6_34;
	Eq_410730 s8_35;
	Eq_410732 s10_39;
	ptr32 s11_40;
	struct Eq_410725 * s3_41;
	struct Eq_410729 * s7_42;
	ptr32 s9_43;
	ptr32 mstatus_50;
	word32 a1_96;
	word32 a5_97;
	Eq_2 ra_28 = tcp_output(ra, s1, a0, a2, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_29, out s1_30, out a0_22, out a1_96, out a2_24, out a3_25, out a4_26, out a5_97, out s2_31, out s3_41, out s4_32, out s5_33, out s6_34, out s7_42, out s8_35, out s9_43, out s10_39, out s11_40, out mstatus_50);
	s0Out = s0_29;
	s1Out = s1_30;
	a0Out = a0_22;
	a2Out = a2_24;
	a3Out = a3_25;
	a4Out = a4_26;
	s2Out = s2_31;
	s3Out = s3_41;
	s4Out = s4_32;
	s5Out = s5_33;
	s6Out = s6_34;
	s7Out = s7_42;
	s8Out = s8_35;
	s9Out = s9_43;
	s10Out = s10_39;
	s11Out = s11_40;
	mstatusOut = mstatus_50;
	return ra_28;
}

// 230747CA: Register Eq_2 tcp_rexmit_rto(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_416547) s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_416549) a0Out, Register out (ptr32 Eq_416550) a3Out, Register out (ptr32 Eq_416551) a4Out, Register out (ptr32 int32) s2Out, Register out (ptr32 Eq_416553) s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 Eq_2) s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out (ptr32 uint16) s8Out, Register out (ptr32 Eq_2) s9Out, Register out (ptr32 Eq_416560) s10Out, Register out (ptr32 Eq_2) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_input
Eq_2 tcp_rexmit_rto(Eq_2 ra, Eq_2 s1, Eq_2 a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, struct Eq_416547 & s0Out, union Eq_2 & s1Out, struct Eq_416549 & a0Out, struct Eq_416550 & a3Out, struct Eq_416551 & a4Out, int32 & s2Out, struct Eq_416553 & s3Out, byte & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, uint16 & s8Out, union Eq_2 & s9Out, struct Eq_416560 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_416549 * a0_13;
	struct Eq_416550 * a3_15;
	struct Eq_416551 * a4_16;
	Eq_2 s1_19;
	byte * s4_20;
	uint16 * s8_21;
	int32 * s2_24;
	struct Eq_416553 * s3_25;
	word32 a2_140;
	word32 a5_141;
	Eq_2 s0_23 = tcp_rexmit_rto_prepare(s1, a4, a5, out s1_19, out a0_13, out a2_140, out a3_15, out a4_16, out a5_141, out s2_24, out s3_25, out s4_20, out s8_21);
	if (a0_13 != null)
	{
		s0Out = s0;
		s1Out = s1_19;
		a0Out = a0_13;
		a3Out = a3_15;
		a4Out = a4_16;
		s2Out = s2_24;
		s3Out = s3_25;
		s4Out = s4_20;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8_21;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_416549 * a0_35;
		struct Eq_416550 * a3_38;
		struct Eq_416551 * a4_39;
		ptr32 mstatus_43;
		struct Eq_416547 * s0_45;
		Eq_2 s1_46;
		struct Eq_416560 * s10_47;
		union Eq_2 * s11_48;
		int32 * s2_49;
		struct Eq_416553 * s3_50;
		byte * s4_51;
		union Eq_2 * s5_52;
		ptr32 s6_53;
		Eq_2 s7_54;
		uint16 * s8_55;
		union Eq_2 * s9_56;
		word32 a2_142;
		Eq_2 ra_44 = tcp_rexmit_rto_commit(ra, s1_19, s0_23, dwArg10, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_45, out s1_46, out a0_35, out a2_142, out a3_38, out a4_39, out s2_49, out s3_50, out s4_51, out s5_52, out s6_53, out s7_54, out s8_55, out s9_56, out s10_47, out s11_48, out mstatus_43);
		s0Out = s0_45;
		s1Out = s1_46;
		a0Out = a0_35;
		a3Out = a3_38;
		a4Out = a4_39;
		s2Out = s2_49;
		s3Out = s3_50;
		s4Out = s4_51;
		s5Out = s5_52;
		s6Out = s6_53;
		s7Out = s7_54;
		s8Out = s8_55;
		s9Out = s9_56;
		s10Out = s10_47;
		s11Out = s11_48;
		mstatusOut = mstatus_43;
		return ra_44;
	}
}

// 230747EC: void tcp_keepalive(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      tcp_tmr
void tcp_keepalive(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a0_20;
	Eq_2 a5_25;
	ptr32 mstatus_28;
	Eq_2 s6_35;
	word32 a3_124;
	word32 a4_125;
	word32 a5_126;
	word32 s1_127;
	word32 a3_128;
	word32 a4_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s5_133;
	word32 s8_134;
	Eq_2 ra_29 = tcp_output_alloc_header.constprop.5(ra, a0, 0x00, lwip_htonl((word32) *((word32) a0 + 80) - 1, out a3_124, out a4_125, out a5_126), mstatus, s0, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s1_127, out a0_20, out a3_128, out a4_129, out a5_25, out s2_130, out s3_131, out s4_132, out s5_133, out s6_35, out s8_134, out mstatus_28);
	if (a0_20 == 0x00)
		return;
	word32 s0_135;
	word32 s1_136;
	word32 a0_137;
	word32 a3_138;
	word32 a4_139;
	word32 a5_140;
	word32 s2_141;
	word32 s3_142;
	word32 s4_143;
	word32 s5_144;
	word32 s6_145;
	word32 s7_146;
	word32 s8_147;
	word32 s9_148;
	word32 mstatus_149;
	tcp_output_control_segment(ra_29, a0, a0_20, dwArg10, (word32) a0 + 4, a5_25, s6_35, s7, mstatus_28, dwArgF8, dwArg0128, out s0_135, out s1_136, out a0_137, out a3_138, out a4_139, out a5_140, out s2_141, out s3_142, out s4_143, out s5_144, out s6_145, out s7_146, out s8_147, out s9_148, out mstatus_149);
}

// 23074826: void tcp_zero_window_probe(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      tcp_tmr
void tcp_zero_window_probe(Eq_2 ra, Eq_2 a0, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	Eq_2 s2_17 = *((word32) a0 + 0x006C);
	if (s2_17 == 0x00)
		return;
	int32 a5_19 = (word32) *((word32) a0 + 0x00A2);
	if (a5_19 != 0x00FF)
		*((word32) a0 + 0x00A2) = (byte) (a5_19 + 0x01);
	struct Eq_420931 * a5_25 = *((word32) s2_17 + 16);
	word32 s0_28 = 0x00;
	word32 a5_353;
	if ((lwip_htons((word32) a5_25->b000C | (word32) a5_25->b000D << 8, out a5_353) & 0x01) != 0x00)
		s0_28 = (word32) ((word32) *((word32) s2_17 + 8) < 1);
	struct Eq_420931 * a4_40 = *((word32) s2_17 + 16);
	word32 a4_356;
	word32 s1_354;
	Eq_2 a0_62;
	ptr32 mstatus_70;
	Eq_2 s6_77;
	word32 a3_355;
	word32 a5_357;
	word32 s3_358;
	word32 s4_359;
	word32 s5_360;
	word32 s8_361;
	struct Eq_420977 * s2_114;
	Eq_2 ra_71 = tcp_output_alloc_header.constprop.5(ra, a0, s0_28 ^ 1, (word32) a4_40->b0007 << 24 | ((word32) a4_40->b0006 << 16 | ((word32) a4_40->b0005 << 8 | (word32) a4_40->b0004)), mstatus, s4, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s1_354, out a0_62, out a3_355, out a4_356, out a5_357, out s2_114, out s3_358, out s4_359, out s5_360, out s6_77, out s8_361, out mstatus_70);
	Eq_2 s3_120 = a0_62;
	if (a0_62 == 0x00)
		return;
	struct Eq_421030 * s4_97 = *((word32) a0_62 + 4);
	if (s0_28 != 0x00)
	{
		word32 a5_371;
		uint32 a5_140 = (word32) (word16) ((int32) (word16) (((word32) s4_97->b000D << 8 | (word32) s4_97->b000C) & 0xFC0000FF) | lwip_htons(0x11, out a5_371));
		s4_97->b000C = (byte) a5_140;
		s4_97->b000D = (byte) (a5_140 >> 8);
	}
	else
	{
		Eq_2 a0_98 = s2_114->t0004;
		word32 s1_362;
		word32 a0_363;
		word32 a1_364;
		word32 a2_365;
		word32 a3_366;
		word32 a4_367;
		word32 a5_368;
		word32 s4_369;
		word32 s8_370;
		pbuf_copy_partial(a0_98, &s4_97->b000D + 7, 0x01, (word32) (uint16) (*((word32) a0_98 + 8) - s2_114->w0008), out s1_362, out a0_363, out a1_364, out a2_365, out a3_366, out a4_367, out a5_368, out s2_114, out s3_120, out s4_369, out s8_370);
	}
	struct Eq_421113 * a4_146 = s2_114->ptr0010;
	struct Eq_421117 * a5_160;
	word32 a3_372;
	word32 a4_373;
	Eq_2 a0_157 = lwip_htonl((word32) a4_146->b0007 << 24 | ((word32) a4_146->b0006 << 16 | ((word32) a4_146->b0005 << 8 | (word32) a4_146->b0004)), out a3_372, out a4_373, out a5_160);
	Eq_2 s1_161 = a5_160->t0050;
	Eq_2 a5_163 = a5_160 - ((word32) a0_157 + 1);
	if (a5_163 < 0x00)
		*((word32) a0_157 + 81) = s1_161;
	word32 s0_374;
	word32 s1_375;
	word32 a0_376;
	word32 a3_377;
	word32 a4_378;
	word32 a5_379;
	word32 s2_380;
	word32 s3_381;
	word32 s4_382;
	word32 s5_383;
	word32 s6_384;
	word32 s7_385;
	word32 s8_386;
	word32 s9_387;
	word32 mstatus_388;
	tcp_output_control_segment(ra_71, s1_161, s3_120, dwArg48, (word32) s1_161 + 4, a5_163, s6_77, s7, mstatus_70, dwArgF8, dwArg0128, out s0_374, out s1_375, out a0_376, out a3_377, out a4_378, out a5_379, out s2_380, out s3_381, out s4_382, out s5_383, out s6_384, out s7_385, out s8_386, out s9_387, out mstatus_388);
}

// 23074956: Register (ptr32 Eq_421193) sys_timeout_abs(Register Eq_2 s1, Register (ptr32 Eq_421193) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_421201) a0Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_421203) a3Out, Register out (ptr32 Eq_421201) a4Out, Register out ptr32 s8Out)
// Called from:
//      lwip_cyclic_timer
//      sys_timeout
struct Eq_421193 * sys_timeout_abs(Eq_2 s1, struct Eq_421193 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, union Eq_2 & s1Out, struct Eq_421201 & a0Out, union Eq_2 & a2Out, struct Eq_421203 & a3Out, struct Eq_421201 & a4Out, ptr32 & s8Out)
{
	struct Eq_421193 * s0_28 = a0;
	struct Eq_421201 * a0_19;
	struct Eq_421201 ** a5_20;
	struct Eq_421203 * a3_22;
	Eq_2 a2_21;
	struct Eq_421201 * a4_23;
	Eq_2 s1_24 = memp_malloc(s1, 11, a3, a4, mstatus, out a0_19, out a2_21, out a3_22, out a4_23, out a5_20);
	if (a0_19 != null)
	{
		a4_23 = (struct Eq_421201 *) *a5_20;
		a0_19->ptr0000 = null;
		a1->ptr0008 = a0_19;
		*((word32) dwArg44 + 0x0C) = a0_19;
		a1->ptr0004 = a0_19;
		a2_21 = dwArg44;
		s0_28 = a1;
		if (a5_20 == null)
		{
l23074984:
			a0_19->ptr0000 = a4_23;
			goto l23074986;
		}
		struct Eq_421201 * a5_34 = a3_22->ptr0004;
		a3_22 = a1 - a3_22;
		if (a3_22 < null)
		{
			a5_34->ptr0000 = a0_19;
			goto l23074984;
		}
		do
		{
			struct Eq_421201 * a5_38 = a4_23->ptr0000;
			if (a4_23 == null)
				break;
			a4_23 = a3_22->ptr0004;
			a3_22 = a1 - a3_22;
		} while (a3_22 >= null);
		a4_23->ptr0000 = a0_19;
		a0_19->ptr0000 = a5_38;
	}
l23074986:
	s1Out = s1_24;
	a0Out = a0_19;
	a2Out = a2_21;
	a3Out = a3_22;
	a4Out = a4_23;
	s8Out = a2;
	return s0_28;
}

// 230749B2: void lwip_cyclic_timer(Register word32 ra, Register Eq_2 s1, Register (ptr32 Eq_421276) a5, Register ptr32 mstatus, Stack Eq_2 dwArg44)
void lwip_cyclic_timer(word32 ra, Eq_2 s1, struct Eq_421276 * a5, ptr32 mstatus, Eq_2 dwArg44)
{
	word32 a0_7 = a5->dw0004;
	Eq_2 a4_14;
	a5();
	word32 a5_64;
	Eq_2 a3_27 = (word32) a4_14 + g_dw4200F68C - sys_now(out a5_64);
	word32 s1_65;
	word32 a0_66;
	word32 a2_67;
	word32 a3_68;
	word32 a4_69;
	word32 s8_70;
	sys_timeout_abs(s1, &g_t230749B2, a3_27, a4_14, mstatus, dwArg44, out s1_65, out a0_66, out a2_67, out a3_68, out a4_69, out s8_70);
}

// 230749EA: Register word32 sys_timeout(Register Eq_2 s1, Register (ptr32 Eq_421193) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s8Out)
// Called from:
//      lwip_init
//      tcp_timer_needed
//      tcpip_tcp_timer
//      sntp_recv
//      sntp_request
//      sntp_dns_found
//      sntp_init
word32 sys_timeout(Eq_2 s1, struct Eq_421193 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s8Out)
{
	word32 a5_48;
	sys_now(out a5_48);
	ptr32 a0_26;
	ptr32 a2_27;
	ptr32 a3_28;
	ptr32 a4_29;
	ptr32 s1_32;
	ptr32 s8_33;
	word32 s0_31 = sys_timeout_abs(s1, a1, a3, a4, mstatus, dwArg44, out s1_32, out a0_26, out a2_27, out a3_28, out a4_29, out s8_33);
	s1Out = s1_32;
	a0Out = a0_26;
	a2Out = a2_27;
	a3Out = a3_28;
	a4Out = a4_29;
	s8Out = s8_33;
	return s0_31;
}

