pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23074A0A: Register word32 tcp_timer_needed(Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_405940) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 uint16) s8Out)
// Called from:
//      tcp_listen_with_backlog_and_err
//      tcp_input
//      altcp_tcp_connect
//      altcp_tcp_bind
word32 tcp_timer_needed(Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg44, union Eq_2 & s1Out, struct Eq_405940 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, uint16 & s8Out)
{
	Eq_2 a4_10 = g_t4200F694;
	if (a4_10 == 0x00)
	{
		if (g_t42026904 != 0x00)
		{
l23074A2C:
			((union Eq_2 *) 0x01)->u0 = 0x4200F694;
			struct Eq_405940 * a0_25;
			ptr32 a2_26;
			Eq_2 a3_27;
			Eq_2 a4_28;
			Eq_2 s1_31;
			uint16 * s8_32;
			word32 s0_30 = sys_timeout(s1, &g_t23074A44, a3, 0x01, mstatus, dwArg44, out s1_31, out a0_25, out a2_26, out a3_27, out a4_28, out s8_32);
			s1Out = s1_31;
			a0Out = a0_25;
			a2Out = a2_26;
			a3Out = a3_27;
			a4Out = a4_28;
			s8Out = s8_32;
			return s0_30;
		}
		a4_10 = g_t420268F8;
		if (a4_10 != 0x00)
			goto l23074A2C;
	}
	s1Out = s1;
	a0Out = a0;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4_10;
	s8Out = s8;
	return s0;
}

// 23074A44: void tcpip_tcp_timer(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArgFC)
void tcpip_tcp_timer(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArgFC)
{
	Eq_2 a3_15;
	Eq_2 a4_16;
	ptr32 mstatus_20;
	Eq_2 s1_23 = tcp_tmr(ra, s1, a2, s2, s3, s7, mstatus, dwLoc08, dwArg00, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArgFC, out a3_15, out a4_16, out mstatus_20);
	if (g_t42026904 != 0x00 || g_t420268F8 != 0x00)
	{
		word32 a4_154;
		word32 s8_155;
		word32 a2_152;
		word32 a3_153;
		word32 s1_150;
		word32 a0_151;
		sys_timeout(s1_23, &g_t23074A44, a3_15, a4_16, mstatus_20, dwArg44, out s1_150, out a0_151, out a2_152, out a3_153, out a4_154, out s8_155);
	}
	else
		g_t4200F694.u0 = 0x00;
}

// 23074A84: Register (ptr32 word32) sys_timeouts_init(Register (ptr32 word32) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      lwip_init
word32 * sys_timeouts_init(word32 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg38, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	do
	{
		a0_64 = a0;
		a4_65 = a4;
		a3_66 = a3;
		word32 s1_34;
		word32 s8_63;
		word32 a2_62;
	} while (s1_34 != sys_timeout(*a0_64 + 0x08, &g_t230749B2, a3_66, a4_65, mstatus, dwArg34, out s1_34, out a0, out a2_62, out a3, out a4, out s8_63));
	0x00 = (int8) dwArg38;
	a1Out = 587680178;
	a3Out = a3;
	a4Out = a4;
	return a0;
}

// 23074AC0: Register Eq_2 sys_untimeout(Register int32 a0, Register int32 a1, Register ptr32 mstatus, Register out ptr32 a3Out)
// Called from:
//      sntp_recv
Eq_2 sys_untimeout(int32 a0, int32 a1, ptr32 mstatus, ptr32 & a3Out)
{
	struct Eq_421481 * a5_19 = g_ptr4200F690;
	Eq_2 a2_17 = 0x00;
	if (a5_19 != null)
	{
		while (true)
		{
			Eq_2 a5_12 = g_t4200F000;
			if (a5_19->dw0008 == a0 && *((word32) a5_12 + 0x0C) == a1)
				break;
			a2_17 = a5_12;
			if (false)
				goto l23074AD0;
			a5_19 = (struct Eq_421481 *) &g_t4200F000;
		}
		if (a2_17 == 0x00)
			g_t4200F000.u0 = 0x4200F690;
		else
			g_t4200F000 = a2_17;
		ptr32 a3_37;
		word32 a4_81;
		word32 a5_82;
		word32 a0_79;
		word32 a2_80;
		Eq_2 s1_39 = memp_free(11, a5_12, 0x4200F690, 0x4200F000, mstatus, out a0_79, out a2_80, out a3_37, out a4_81, out a5_82);
		a3Out = a3_37;
		return s1_39;
	}
	else
	{
l23074AD0:
		a3Out = 0x4200F690;
		return s1;
	}
}

// 23074AFA: Register Eq_2 sys_check_timeouts(Register word32 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register ptr32 mstatus, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_387862) a5Out, Register out Eq_387863 s2Out, Register out ptr32 s3Out)
// Called from:
//      tcpip_thread
Eq_2 sys_check_timeouts(word32 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, ptr32 mstatus, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_387862 & a5Out, union Eq_387863 & s2Out, ptr32 & s3Out)
{
	struct Eq_387862 * a5_17;
	Eq_387863 s2_18 = sys_now(out a5_17);
	ptr32 s3_19 = 0x4200F000;
	struct Eq_421532 * s4_20 = &g_t4200F000;
	s1_43 = s1;
	while (true)
	{
		ptr32 mstatus_74;
		Eq_2 a3_69;
		Eq_2 a1_67;
		Eq_2 s1_43;
		Eq_2 a4_23 = *a1;
		if (a1 == 0x00)
			break;
		a1 = a5_17->t0004;
		a3 = s2_18 - a5_17;
		if (a3 < 0x00)
			break;
		*a3 = a4_23;
		a1 = *((word32) s1_43 + 0x0C);
		s4_20->ptr068C = a5_17;
		word32 a2_123;
		word32 a4_124;
		word32 a0_122;
		s1_43 = memp_free(11, a1, a3, a4_23, mstatus, out a0_122, out a2_123, out a3, out a4_124, out a5_17);
		if (s0 != 0x00)
		{
			word32 tp_75;
			s0();
			a1 = a1_67;
			mstatus = mstatus_74;
			a3 = a3_69;
		}
	}
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_23;
	a5Out = a5_17;
	s2Out = s2_18;
	s3Out = s3_19;
	return s1;
}

