pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23074B52: Register int32 sys_timeouts_sleeptime(Register (ptr32 code) a5)
// Called from:
//      tcpip_thread
int32 sys_timeouts_sleeptime(<anonymous> * a5)
{
	int32 a0_11 = ~0x00;
	if (a5 != null)
	{
		struct Eq_421579 * a5_13;
		a0_11 = a5_13->dw0004 - sys_now(out a5_13);
		if (a0_11 < 0x00)
			a0_11 = 0x00;
	}
	return a0_11;
}

// 23074B80: Register Eq_2 udp_init(Register Eq_2 a0, Register (ptr32 Eq_64398) a2, Register out ptr32 a2Out)
// Called from:
//      lwip_init
Eq_2 udp_init(Eq_2 a0, struct Eq_64398 * a2, ptr32 & a2Out)
{
	word32 a0_8;
	word32 a1_30;
	word32 a2_31;
	word32 a3_32;
	word32 a4_33;
	word32 a5_34;
	word32 s4_35;
	word32 s8_36;
	bl_rand(a0, a2, out a0_8, out a1_30, out a2_31, out a3_32, out a4_33, out a5_34, out s4_35, out s8_36);
	word32 a0_22 = (word32) (word14) a0_8;
	g_w4200FCC2 = (word16) (a0_22 + 0xFC000000);
	a2Out = dwArg10;
	return a0_22 + 0xFC000000;
}

// 23074B9E: Register word32 udp_input(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0128)
// Called from:
//      ip4_input
word32 udp_input(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgE4, Eq_2 dwArgE8, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0128)
{
	Eq_2 a4_113;
	g_w4202686E = (word16) ((word32) g_w4202686E + 0x01);
	Eq_2 a3_211 = (word32) *((word32) a0 + 0x0A);
	if (a3_211 <= 0x07)
	{
		g_w42026876 = (word16) ((word32) g_w42026876 + 0x01);
		word32 a4_419 = (word32) g_w42026872;
		g_w42026872 = (word16) (a4_419 + 0x01);
		a4_113 = a4_419 + 0x01;
		goto l23074BE2;
	}
	struct Eq_421635 * s3_218 = *((word32) a0 + 4);
	word32 a5_782;
	word32 a3_781;
	struct Eq_396393 * a0_40 = ip4_addr_isbroadcast_u32(g_t4202692C, g_t42026918, out a3_781, out a4_113, out a5_782);
	word32 a5_783;
	Eq_2 a0_50 = lwip_htons((word32) s3_218->t0000 | (word32) s3_218->b0001 << 8, out a5_783);
	word32 a5_784;
	Eq_2 a0_57 = lwip_htons((word32) s3_218->b0002 | (word32) s3_218->b0003 << 8, out a5_784);
	Eq_2 a7_60 = g_t42026914;
	Eq_2 s1_216 = a0;
	Eq_2 s5_220 = a1;
	Eq_2 s0_215 = 0x420267F0;
	struct Eq_421690 * s4_219 = &g_t42026918;
	struct Eq_393067 * t3_61 = g_ptr4202691C;
	a3_211 = g_t4202692C;
	Eq_2 t4_63 = g_t42026928;
	Eq_2 a5_120 = a7_60;
	Eq_2 s2_108 = 0x00;
	Eq_2 a6_128 = 0x00;
	while (a5_120 != 0x00)
	{
		a4_113 = (word32) *((word32) a5_120 + 18);
		if (a4_113 == a0_57)
		{
			a2 = (word32) *((word32) a5_120 + 8);
			if (a2 != 0x00)
			{
				a4_113 = (word32) t3_61->b0044 + 0x01 & 0x00FF;
				if (a2 == a4_113)
					goto l23074C8C;
				goto l23074CD4;
			}
l23074C8C:
			a5_120 = *a4_113;
			if (a0_40 != null)
			{
				if (a4_113 == 0x00 || a3_211 == ~0x00)
					goto l23074CA6;
				a2 = (a4_113 ^ a3_211) & *((word32) a1 + 8);
				if (a2 == 0x00)
					goto l23074CA6;
				goto l23074CD4;
			}
			if (a4_113 != 0x00 && a4_113 != a3_211)
				goto l23074CD4;
l23074CA6:
			ui32 a2_93 = (word32) *((word32) a5_120 + 16);
			a2 = a2_93 & 0x04;
			if ((a2_93 & 0x04) == 0x00)
			{
				if (s2_108 != 0x00)
				{
					if (a0_40 != null && a3_211 == ~0x00)
					{
						a2 = *((word32) a1 + 4);
						if (*s2_108 != a2 && a2 == a4_113)
							goto l23074CCA;
						goto l23074CDC;
					}
					if (a4_113 == 0x00)
						goto l23074CDC;
				}
l23074CCA:
				s2_108 = a5_120;
			}
l23074CDC:
			a4_113 = (word32) *((word32) a5_120 + 20);
			if (a4_113 == a0_50)
			{
				a5_120 = *((word32) a4_113 + 4);
				if (a4_113 == 0x00 || a4_113 == t4_63)
				{
					if (a6_128 != 0x00)
					{
						a5_120 = *((word32) a4_113 + 0x0C);
						g_t42027914 = a5_120;
						*((word32) a6_128 + 0x0C) = a4_113;
						*((word32) a5_120 + 0x0C) = a7_60;
					}
					else
						g_w42026882 = (word16) ((word32) g_w42026882 + 0x01);
					s2_108 = a5_120;
					goto l23074D00;
				}
			}
		}
l23074CD4:
		a6_128 = a5_120;
		a5_120 = *((word32) a5_120 + 0x0C);
	}
	if (s2_108 == 0x00 && *((word32) a1 + 4) != a3_211)
	{
l23074C6C:
		a0 = s1_216;
l23074BE2:
		0x00 = (int8) dwArg0128;
		word32 a2_788;
		word32 a1_787;
		word32 a7_792;
		word32 s2_793;
		word32 s8_798;
		word32 s5_796;
		word32 mstatus_799;
		word32 s6_797;
		word32 a5_791;
		word32 s4_795;
		word32 s3_794;
		word32 s1_465;
		word32 s0_785;
		word32 a4_790;
		word32 a0_786;
		word32 a3_789;
		pbuf_free(ra, a0, a3_211, a4_113, dwArg78, mstatus, dwArg0128, out s0_785, out s1_465, out a0_786, out a1_787, out a2_788, out a3_789, out a4_790, out a5_791, out a7_792, out s2_793, out s3_794, out s4_795, out s5_796, out s6_797, out s8_798, out mstatus_799);
		return s1_465;
	}
l23074D00:
	if (((word32) s3_218->b0007 << 8 | (word32) s3_218->b0006) != 0x00)
	{
		word32 a6_802;
		word32 a0_208;
		s0_215 = ip_chksum_pseudo(a0, 0x11, (word32) *((word32) a0 + 8), 0x42026928, 0x4202692C, out s1_216, out a0_208, out a2, out a3_211, out a4_113, out a6_802, out s2_108, out s3_218, out s4_219, out s5_220);
		if (a0_208 != 0x00)
		{
			*((word32) s0_215 + 0x0084) = (word16) ((word32) *((word32) s0_215 + 0x0084) + 0x01);
l23074D36:
			((word32) s0_215 + 0x0082)->u2 = (word16) ((word32) *((word32) s0_215 + 0x0082) + 0x01);
			goto l23074C6C;
		}
	}
	word32 a1_800;
	word32 a5_801;
	if (pbuf_remove_header(s1_216, 0x08, a2, out a1_800, out a3_211, out a4_113, out a5_801) == 0x00)
	{
		if (s2_108 != 0x00)
		{
			<anonymous> * t1_353 = *((word32) s2_108 + 32);
			if (t1_353 != null)
			{
				Eq_2 a0_355 = *((word32) s2_108 + 36);
				0x00 = (int8) dwArg0128;
				word32 s1_379;
				word32 s9_403;
				t1_353();
				return s1_379;
			}
			goto l23074C6C;
		}
		if (a0_40 == null)
		{
			a4_113.u0 = 224;
			if ((s4_219->dw0014 & 0x00F0) != 224)
			{
				word32 s4_804;
				word32 s2_803;
				Eq_2 a4_276;
				ra = icmp_dest_unreach(ra, s0_215, s1_216, pbuf_header_force(s1_216, (int32) (word16) ((word32) s4_219->w000C + 0x08), a2, out a4_276), a4_276, a0_50, mstatus, dwLoc2C, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_215, out s1_216, out a3_211, out a4_113, out s2_803, out s4_804, out mstatus);
			}
		}
		((word32) s0_215 + 0x008C)->u2 = (word16) ((word32) *((word32) s0_215 + 0x008C) + 0x01);
	}
	goto l23074D36;
}

