pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23074DC4: Register Eq_2 udp_bind(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      dns_server_init
//      dns_init
//      dhcp_inc_pcb_refcount
//      udp_sendto
//      udp_connect
//      lwip_netconn_do_bind
//      dhcp_server_start
//      iperf_server_udp
//      sntp_init
//      bl_cipstart
Eq_2 udp_bind(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a1 == 0x00)
		a1.u0 = 588036828;
	Eq_2 a0_109 = ~0x0F;
	if (a0 != 0x00)
	{
		a5 = g_t42026914;
		a3 = 0x42027000;
		Eq_2 a0_14 = a5;
		while (true)
		{
			word32 t3_17;
			if (a0_14 == 0x00)
				break;
			if (a0_14 == a0)
			{
				t3_17 = 0x01;
				goto l23074DE2;
			}
			a0_14 = *((word32) a0_14 + 0x0C);
		}
		t3_17 = 0x00;
l23074DE2:
		if (a2 == null)
		{
			a2 = (word32) g_w4200ECC2;
			word32 a6_48 = 0x04000000;
l23074DF6:
			if (a2 != (union Eq_2 *) 0x0FFFFFFF)
				a2 = (word32) (word16) ((char *) a2 + 1);
			else
				a2 = (union Eq_2 *) 0x0C000000;
			Eq_2 a7_59 = a5;
			while (a7_59 != 0x00)
			{
				if ((word32) *((word32) a7_59 + 18) == a2)
				{
					a6_48 = (word32) (word16) (a6_48 + ~0x00);
					if (a6_48 != 0x00)
						goto l23074DF6;
					g_w4200ECC2 = (word16) a2;
					goto l23074E4C;
				}
				a7_59 = *((word32) a7_59 + 0x0C);
			}
			g_w4200ECC2 = (word16) a2;
		}
		else
		{
			while (a5 != 0x00)
			{
				if (a5 != a0 && (((word32) (*((word32) a0 + 9)) & 0x04) == 0x00 || ((word32) (*((word32) a5 + 9)) & 0x04) == 0x00))
				{
					union Eq_2 * a0_34 = (word32) *((word32) a5 + 18);
					if (a0_34 == a2)
					{
						union Eq_2 * a6_39 = *a1.u0;
						a5 = *a0_34;
						if (a0_34 == a6_39 || (a6_39 == null || a0_34 == null))
						{
l23074E4C:
							a3Out = 0x42027000;
							a4Out.u0 = <invalid>;
							a5Out = a5;
							return ~0x07;
						}
					}
				}
				a5 = *((word32) a5 + 0x0C);
			}
		}
		*((word32) a0 + 18) = (word16) a2;
		*a5 = a0;
		if (t3_17 == 0x00)
		{
			a5 = g_t42026914;
			g_t42027914 = a0;
			*((word32) a5 + 0x0C) = a0;
		}
		a0_109.u0 = 0x00;
	}
	a3Out = a3;
	a4Out.u0 = <invalid>;
	a5Out = a5;
	return a0_109;
}

// 23074E88: Register Eq_2 udp_sendto_if_src_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_422116 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_422116 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_sendto_if_chksum
//      udp_sendto_if_src
Eq_2 udp_sendto_if_src_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_422116 a5, Eq_2 a6, Eq_2 a7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_422116 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s5_176;
	Eq_2 s7_26 = ~0x0F;
	s5_176 = s5;
	if (a0 != 0x00)
	{
		s5_176 = s5;
		if (a1 == 0x00)
			goto l23074EE0;
		s5_176 = s5;
		if (a2 != 0x00)
		{
			s5_176 = s5;
			if (a7 == 0x00)
				goto l23074EE0;
			s5_176 = s5;
			if (a4 != 0x00)
			{
				Eq_422116 s8_154 = a5;
				s1 = a0;
				Eq_2 s4_159 = a7;
				Eq_2 s0_171 = a6;
				s5_176 = a4;
				s9 = a3;
				s3 = a2;
				s2 = a1;
				if ((word32) *((word32) a0 + 18) == 0x00)
				{
					Eq_2 a0_46 = udp_bind(a0, a0, null, out a3, out a4, out a5);
					s7_26 = a0_46;
					if (a0_46 != 0x00)
						goto l23074EE0;
				}
				a4 = (word32) *((word32) a1 + 8);
				a5.u0 = 0x0FFFFFF7;
				if (a4 > 0x0FFFFFF7)
				{
l23074ED0:
					s7_26.u0 = ~0x00;
					goto l23074EE0;
				}
				Eq_2 s6_102;
				Eq_2 a3_64;
				Eq_2 a4_65;
				word32 a5_593;
				word32 a1_591;
				word32 a2_592;
				if (pbuf_add_header(a1, 0x08, out a1_591, out a2_592, out a3_64, out a4_65, out a5_593) != 0x00)
				{
					word32 a7_596;
					Eq_2 a0_77;
					word32 s6_597;
					word32 a2_595;
					word32 a1_594;
					ra = pbuf_alloc(ra, a6, a0, 0x00A2, 0x08, 640, a3_64, a4_65, mstatus, s8, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_171, out s1, out a0_77, out a1_594, out a2_595, out a3, out a4, out a5, out a7_596, out s2, out s3, out s4_159, out s5_176, out s6_597, out s8_154, out mstatus);
					s6_102 = a0_77;
					if (a0_77 == 0x00)
						goto l23074ED0;
					if ((word32) *((word32) s2 + 8) != 0x00)
						pbuf_chain(a0_77, s2, a3, a4, mstatus);
				}
				else
					s6_102 = a1;
				Eq_2 s7_114 = *((word32) s6_102 + 4);
				word32 a5_598;
				Eq_2 a0_115 = lwip_htons((word32) *((word32) s1 + 18), out a5_598);
				*s7_114 = (byte) a0_115;
				*((word32) s7_114 + 1) = (byte) (a0_115 >> 8);
				word32 a5_599;
				Eq_2 a0_123 = lwip_htons(a3, out a5_599);
				*((word32) s7_114 + 2) = (byte) a0_123;
				*((word32) s7_114 + 3) = (byte) (a0_123 >> 8);
				*((word32) s7_114 + 6) = 0x00;
				((word32) s7_114 + 7)->u0 = 0x00;
				if (((word32) *((word32) s1 + 16) & 0x08) != 0x00 && (*s3 & 0x00F0) == 224)
					*((word32) s6_102 + 0x0D) = (byte) ((word32) *((word32) s6_102 + 0x0D) | 4);
				word32 a5_600;
				Eq_2 a0_143 = lwip_htons((word32) *((word32) s6_102 + 8), out a5_600);
				*((word32) s7_114 + 4) = (byte) a0_143;
				*((word32) s7_114 + 5) = (byte) (a0_143 >> 8);
				if (((word32) *((word32) s1 + 16) & 0x01) == 0x00)
				{
					uint32 a0_164;
					Eq_2 a2_152 = (word32) *((word32) s6_102 + 8);
					if (s8_154 != 0x00)
					{
						word32 a0_191;
						word32 a4_601;
						Eq_2 s0_198 = ip_chksum_pseudo_partial(s6_102, 0x11, a2_152, 0x08, s4_159, dwArgF8, out s1, out a0_191, out a4_601, out s3, out s4_159, out s5_176, out s6_102);
						uint32 a0_209 = a0_191 + (s0_198 >> 16);
						s0_171 = s0_198 >> 16;
						a0_164 = (word32) (word16) (a0_209 + (a0_209 >> 0x10));
					}
					else
					{
						word32 a3_613;
						word32 a2_612;
						word32 a6_615;
						word32 a4_614;
						word32 s2_616;
						s0_171 = ip_chksum_pseudo(s6_102, 0x11, a2_152, s4_159, s3, out s1, out a0_164, out a2_612, out a3_613, out a4_614, out a6_615, out s2_616, out s3, out s4_159, out s5_176);
					}
					if (a0_164 == 0x00)
						a0_164 = 0x0FFFFFFF;
					*((word32) s7_114 + 6) = (byte) a0_164;
					*((word32) s7_114 + 7) = (byte) (a0_164 >> 8);
				}
				Eq_2 a3_233;
				if ((*s3 & 0x00F0) == 224)
					a3_233 = (word32) *((word32) s1 + 29);
				else
					a3_233 = (word32) *((word32) s1 + 11);
				Eq_2 a0_272;
				Eq_2 a4_276;
				Eq_2 s4_285;
				Eq_2 s6_287;
				ra = ip4_output_if_src(ra, s0_171, s1, s6_102, s4_159, s3, a3_233, (word32) *((word32) s1 + 0x0A), 0x11, s5_176, s4_159, s5_176, s6_102, s7_114, out s1, out a0_272, out a3, out a4_276, out s2, out s3, out s4_285, out s5_176, out s6_287);
				s7_26 = a0_272;
				if (s6_287 != s2)
				{
					word32 a1_604;
					word32 s8_611;
					word32 s6_610;
					word32 s4_609;
					word32 a5_607;
					word32 a7_608;
					word32 a4_606;
					word32 a2_605;
					word32 s0_602;
					word32 a0_603;
					ra = pbuf_free(ra, s6_287, a3, a4_276, s4_285, mstatus, dwArgF8, out s0_602, out s1, out a0_603, out a1_604, out a2_605, out a3, out a4_606, out a5_607, out a7_608, out s2, out s3, out s4_609, out s5_176, out s6_610, out s8_611, out mstatus);
				}
				word32 a4_338 = (word32) g_w4202686C;
				g_w4202686C = (word16) (a4_338 + 0x01);
				a5.u0 = 0x420267F0;
				a4 = a4_338 + 0x01;
			}
		}
	}
l23074EE0:
	0x00 = (int8) dwArg0128;
	s0Out = s4;
	s1Out = s1;
	a0Out = s7_26;
	a2Out = dwArgB8;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = s5_176;
	s7Out = s7_26;
	s8Out = s5;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra;
}

// 2307502A: Register Eq_2 udp_sendto_if_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_422116 a5, Register Eq_2 a6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_422116 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_sendto_chksum
//      udp_sendto_if
Eq_2 udp_sendto_if_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_422116 a5, Eq_2 a6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_422116 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a1 == 0x00 || (a2 == 0x00 || a4 == 0x00)))
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0F;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a7_14;
		int32 a7_9 = *a0;
		if (a7_9 != 0x00 && (a7_9 & 0x00F0) != 224)
		{
			if (a7_9 != *((word32) a4 + 4))
			{
				s0Out = s0;
				s1Out = s1;
				a0Out = ~0x03;
				a2Out = a2;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s7Out = s7;
				s8Out = s8;
				s9Out = s9;
				mstatusOut = mstatus;
				return ra;
			}
			a7_14 = a0;
		}
		else
			a7_14 = (word32) a4 + 4;
		ptr32 a0_47;
		Eq_2 a2_48;
		ptr32 s0_50;
		ptr32 s4_51;
		ptr32 s7_52;
		Eq_2 s8_53;
		Eq_2 a3_57;
		Eq_2 a4_58;
		Eq_422116 a5_59;
		ptr32 s1_60;
		ptr32 s2_61;
		ptr32 s3_62;
		ptr32 s5_63;
		ptr32 s9_64;
		ptr32 mstatus_73;
		Eq_2 ra_66 = udp_sendto_if_src_chksum(ra, a0, a1, a2, a3, a4, a5, a6, a7_14, s8, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_50, out s1_60, out a0_47, out a2_48, out a3_57, out a4_58, out a5_59, out s2_61, out s3_62, out s4_51, out s5_63, out s7_52, out s8_53, out s9_64, out mstatus_73);
		s0Out = s0_50;
		s1Out = s1_60;
		a0Out = a0_47;
		a2Out = a2_48;
		a3Out = a3_57;
		a4Out = a4_58;
		a5Out = a5_59;
		s2Out = s2_61;
		s3Out = s3_62;
		s4Out = s4_51;
		s5Out = s5_63;
		s7Out = s7_52;
		s8Out = s8_53;
		s9Out = s9_64;
		mstatusOut = mstatus_73;
		return ra_66;
	}
}

// 23075062: Register Eq_2 udp_sendto_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_422116 a4, Register (ptr32 Eq_422590) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_422116 a4Out, Register out (ptr32 Eq_422590) a5Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_422590) s5Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_send_chksum
//      udp_sendto
//      lwip_netconn_do_send
Eq_2 udp_sendto_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_422116 a4, struct Eq_422590 * a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_422116 & a4Out, struct Eq_422590 & a5Out, union Eq_2 & s3Out, union Eq_2 & s4Out, struct Eq_422590 & s5Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a1 == 0x00 || a2 == 0x00))
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0F;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a3_242;
	Eq_2 a0_40;
	Eq_2 s0_22 = a0;
	Eq_2 a0_23 = (word32) *((word32) a0 + 8);
	if (a0_23 != 0x00)
	{
		word32 a5_349;
		word32 a4_348;
		a0_40 = netif_get_by_index(a0_23, out a4_348, out a5_349);
		a3_242 = a3;
		goto l2307508E;
	}
	Eq_2 a2_32 = a5->t0000;
	Eq_2 a5_34 = a5 & 0x00F0;
	if ((a5 & 0x00F0) == 224)
	{
		Eq_2 a0_35 = (word32) *((word32) a0 + 28);
		if (a0_35 != 0x00)
		{
			word32 a4_353;
			a0_40 = netif_get_by_index(a0_35, out a4_353, out a5_34);
		}
		else
		{
			s0_22 = (a5 & 0x00F0)->t0018;
			if ((a5 & 0x00F0) == 0x00 || (a5 & 0x00F0) == g_dw230CBAE0)
				goto l230750C4;
			word32 a4_355;
			word32 a3_354;
			a0_40 = ip4_route(a2_32, a5 & 0x00F0, out a2_32, out a3_354, out a4_355, out a5_34);
		}
		if (a0_40 != 0x00)
		{
l230750D8:
			ptr32 a0_112;
			Eq_2 a2_114;
			Eq_2 a3_115;
			Eq_422116 a4_116;
			struct Eq_422590 * a5_117;
			ptr32 mstatus_120;
			Eq_2 s0_122;
			Eq_2 s1_123;
			Eq_2 s3_125;
			Eq_2 s4_126;
			struct Eq_422590 * s5_127;
			ptr32 s9_131;
			word32 s8_358;
			word32 s2_356;
			word32 s7_357;
			Eq_2 ra_121 = udp_sendto_if_chksum(ra, s0_22, a1, dwArg48, a3, a0_40, a4, dwArg28, s4, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_122, out s1_123, out a0_112, out a2_114, out a3_115, out a4_116, out a5_117, out s2_356, out s3_125, out s4_126, out s5_127, out s7_357, out s8_358, out s9_131, out mstatus_120);
			s0Out = s0_122;
			s1Out = s1_123;
			a0Out = a0_112;
			a2Out = a2_114;
			a3Out = a3_115;
			a4Out = a4_116;
			a5Out = a5_117;
			s3Out = s3_125;
			s4Out = s4_126;
			s5Out = s5_127;
			s9Out = s9_131;
			mstatusOut = mstatus_120;
			return ra_121;
		}
		goto l230750C4;
	}
	else
	{
l230750C4:
		word32 a4_351;
		word32 a5_352;
		word32 a2_350;
		a0_40 = ip4_route(a2_32, a5_34, out a2_350, out a3_242, out a4_351, out a5_352);
l2307508E:
		if (a0_40 == 0x00)
		{
			word32 a4_141 = (word32) g_w4202687A;
			g_w4202687A = (word16) (a4_141 + 0x01);
			s0Out = s1;
			s1Out = a2;
			a0Out = ~0x03;
			a2Out = dwArg48;
			a3Out = a3_242;
			a4Out = a4_141 + 0x01;
			a5Out = (struct Eq_422590 *) &g_t420267F0;
			s3Out = a3;
			s4Out = dwArg04;
			s5Out = a5;
			s9Out = s9;
			mstatusOut = mstatus;
			return ra;
		}
		goto l230750D8;
	}
}

// 23075118: Register word32 udp_send_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_422116 a2, Register (ptr32 Eq_422590) a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out Eq_422116 a4Out, Register out (ptr32 Eq_422590) a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_send
word32 udp_send_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_422116 a2, struct Eq_422590 * a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a0Out, union Eq_422116 & a4Out, struct Eq_422590 & a5Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		a0Out = ~0x0F;
		a4Out = a2;
		a5Out = a3;
		mstatusOut = mstatus;
		return s0;
	}
	else
	{
		Eq_2 a3_11 = (word32) *((word32) a0 + 20);
		ptr32 a0_16;
		Eq_422116 a4_20;
		struct Eq_422590 * a5_21;
		ptr32 mstatus_24;
		word32 s0_26;
		word32 s9_137;
		word32 s5_136;
		word32 s3_134;
		word32 s4_135;
		word32 a3_133;
		word32 a2_132;
		word32 s1_131;
		udp_sendto_chksum(ra, a0, a1, (word32) a0 + 4, a3_11, a2, a3, s4, mstatus, dwArg14, dwArg28, dwArg48, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_26, out s1_131, out a0_16, out a2_132, out a3_133, out a4_20, out a5_21, out s3_134, out s4_135, out s5_136, out s9_137, out mstatus_24);
		a0Out = a0_16;
		a4Out = a4_20;
		a5Out = a5_21;
		mstatusOut = mstatus_24;
		return s0_26;
	}
}

// 23075130: Register Eq_2 udp_sendto(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_348252 a3Out, Register out ptr32 a4Out, Register out Eq_348254 s3Out, Register out (ptr32 Eq_348255) s4Out, Register out ptr32 s5Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      get_dns_request
//      dns_check_entry
//      udp_send
//      iperf_server_udp_recv_fn
//      sntp_dns_found
Eq_2 udp_sendto(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_348252 & a3Out, ptr32 & a4Out, union Eq_348254 & s3Out, struct Eq_348255 & s4Out, ptr32 & s5Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a0_13;
	ptr32 a2_15;
	Eq_348252 a3_16;
	ptr32 a4_17;
	ptr32 mstatus_21;
	ptr32 s0_23;
	ptr32 s1_24;
	Eq_348254 s3_26;
	struct Eq_348255 * s4_27;
	ptr32 s5_28;
	ptr32 s9_32;
	word32 a5_62;
	Eq_2 ra_22 = udp_sendto_chksum(ra, a0, a1, a2, a3, 0x00, null, s4, mstatus, dwArg14, dwArg28, dwArg48, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_23, out s1_24, out a0_13, out a2_15, out a3_16, out a4_17, out a5_62, out s3_26, out s4_27, out s5_28, out s9_32, out mstatus_21);
	s0Out = s0_23;
	s1Out = s1_24;
	a0Out = a0_13;
	a2Out = a2_15;
	a3Out = a3_16;
	a4Out = a4_17;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5_28;
	s9Out = s9_32;
	mstatusOut = mstatus_21;
	return ra_22;
}

