pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23075138: Register Eq_2 udp_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_send_data
Eq_2 udp_send(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a3_7 = (word32) *((word32) a0 + 20);
		ptr32 a0_12;
		ptr32 a2_14;
		ptr32 a3_15;
		ptr32 a4_16;
		ptr32 mstatus_20;
		ptr32 s1_23;
		ptr32 s3_25;
		word32 s9_137;
		word32 s5_136;
		word32 s0_134;
		word32 s4_135;
		Eq_2 ra_21 = udp_sendto(ra, a0, a1, (word32) a0 + 4, a3_7, s4, mstatus, dwArg14, dwArg28, dwArg48, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_134, out s1_23, out a0_12, out a2_14, out a3_15, out a4_16, out s3_25, out s4_135, out s5_136, out s9_137, out mstatus_20);
		s1Out = s1_23;
		a0Out = a0_12;
		a2Out = a2_14;
		a3Out = a3_15;
		a4Out = a4_16;
		s3Out = s3_25;
		mstatusOut = mstatus_20;
		return ra_21;
	}
}

// 2307514C: Register Eq_2 udp_sendto_if(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_392408) s2Out, Register out ptr32 s3Out, Register out Eq_392410 s4Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_network_changed
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
//      dhcp_server_recv
Eq_2 udp_sendto_if(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, struct Eq_392408 & s2Out, ptr32 & s3Out, union Eq_392410 & s4Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a3_17;
	ptr32 a4_18;
	ptr32 mstatus_22;
	struct Eq_392408 * s2_26;
	ptr32 s3_27;
	Eq_392410 s4_28;
	ptr32 s7_31;
	ptr32 s8_32;
	word32 s0_58;
	word32 s1_59;
	word32 a0_60;
	word32 a2_61;
	word32 a5_62;
	word32 s5_63;
	word32 s9_64;
	Eq_2 ra_23 = udp_sendto_if_chksum(ra, a0, a1, a2, a3, a4, 0x00, 0x00, s8, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_58, out s1_59, out a0_60, out a2_61, out a3_17, out a4_18, out a5_62, out s2_26, out s3_27, out s4_28, out s5_63, out s7_31, out s8_32, out s9_64, out mstatus_22);
	a3Out = a3_17;
	a4Out = a4_18;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s7Out = s7_31;
	s8Out = s8_32;
	mstatusOut = mstatus_22;
	return ra_23;
}

// 23075154: Register Eq_2 udp_sendto_if_src(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
Eq_2 udp_sendto_if_src(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 s4_20;
	ptr32 a3_26;
	ptr32 a4_27;
	ptr32 s2_30;
	ptr32 s3_31;
	ptr32 mstatus_42;
	word32 s0_58;
	word32 s1_59;
	word32 a0_60;
	word32 a2_61;
	word32 a5_62;
	word32 s5_63;
	word32 s7_64;
	word32 s8_65;
	word32 s9_66;
	Eq_2 ra_35 = udp_sendto_if_src_chksum(ra, a0, a1, a2, a3, a4, 0x00, 0x00, a5, s8, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_58, out s1_59, out a0_60, out a2_61, out a3_26, out a4_27, out a5_62, out s2_30, out s3_31, out s4_20, out s5_63, out s7_64, out s8_65, out s9_66, out mstatus_42);
	a3Out = a3_26;
	a4Out = a4_27;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = s4_20;
	mstatusOut = mstatus_42;
	return ra_35;
}

// 2307515E: Register ui32 udp_bind_netif(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_setsockopt_callback
ui32 udp_bind_netif(Eq_2 a0, Eq_2 a1)
{
	ui32 a5_3 = 0x00;
	if (a1 != 0x00)
		a5_3 = (word32) *((word32) a1 + 0x0044) + 0x01 & 0x00FF;
	*((word32) a0 + 8) = (byte) a5_3;
	return a5_3;
}

// 23075172: Register Eq_2 udp_connect(Register Eq_2 a0, Register (ptr32 Eq_392074) a1, Register (ptr32 Eq_392075) a2, Stack Eq_2 dwArg38, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_392075) s2Out)
// Called from:
//      dhcp_inc_pcb_refcount
//      lwip_netconn_do_connect
//      bl_cipstart
Eq_2 udp_connect(Eq_2 a0, struct Eq_392074 * a1, struct Eq_392075 * a2, Eq_2 dwArg38, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_392075 & s2Out)
{
	if (a0 == 0x00 || a1 == null)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out.u0 = ~0x0F;
		s2Out = s2;
		return ~0x0F;
	}
	Eq_2 a4_106;
	Eq_2 a3_101;
	Eq_2 a5_17 = (word32) *((word32) a0 + 18);
	if (a5_17 == 0x00)
	{
		word32 a5_144;
		Eq_2 a0_24 = udp_bind(a0, a0, null, out a3_101, out a4_106, out a5_144);
		a5_17 = a0_24;
		if (a0_24 != 0x00)
			goto l230751C4;
	}
	*((word32) a0 + 20) = (word16) a2;
	*((word32) a5_17 + 4) = a0;
	*((word32) a0 + 16) = (byte) ((word32) *((word32) a0 + 16) | 4);
	a3_101 = g_t42026914;
	a4_106 = a3_101;
	while (a4_106 != 0x00)
	{
		if (a4_106 == a0)
			goto l230751B4;
		a4_106 = *((word32) a4_106 + 0x0C);
	}
	*((word32) a3_101 + 0x0C) = a0;
	g_t42027914 = a0;
l230751B4:
	a5_17.u0 = 0x00;
l230751C4:
	0x00 = (int8) dwArg38;
	a3Out = a3_101;
	a4Out = a4_106;
	a5Out = a5_17;
	s2Out = a2;
	return a5_17;
}

// 230751DE: Register ui32 udp_disconnect(Register Eq_423050 a0)
// Called from:
//      lwip_netconn_do_disconnect
ui32 udp_disconnect(Eq_423050 a0)
{
	if (a0 != 0x00)
	{
		ui32 a5_5 = (word32) *((word32) a0 + 16);
		*((word32) a0 + 4) = 0x00;
		*((word32) a0 + 20) = 0x00;
		((word32) a0 + 8)->u0 = 0x00;
		((word32) a0 + 16)->u0 = (byte) (a5_5 & ~0x04);
		a5 = a5_5 & ~0x04;
	}
	return a5;
}

// 230751F8: void udp_recv(Register Eq_2 a0, Register (ptr32 Eq_348470) a1, Register Eq_2 a2)
// Called from:
//      dns_server_init
//      dns_init
//      dhcp_inc_pcb_refcount
//      lwip_netconn_do_newconn
//      dhcp_server_start
//      iperf_server_udp
//      sntp_init
//      bl_cipstart
void udp_recv(Eq_2 a0, struct Eq_348470 * a1, Eq_2 a2)
{
	if (a0 != 0x00)
	{
		a1->t0020 = a0;
		*((word32) a2 + 36) = a0;
	}
}

// 23075200: Register Eq_2 udp_remove(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 byte) a4Out, Register out (ptr32 Eq_348488) a5Out)
// Called from:
//      dns_server_init
//      dhcp_dec_pcb_refcount
//      lwip_netconn_do_delconn
//      dhcp_server_stop
//      iperf_server_udp
//      bl_cipstart
//      bl_cipclose
Eq_2 udp_remove(Eq_2 a0, Eq_2 a3, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, byte & a4Out, struct Eq_348488 & a5Out)
{
	Eq_2 a1_14 = a0;
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a5_13 = g_t42026914;
		if (a5_13 == a0)
			g_t42027914 = a5_13;
		else
		{
			while (a5_13 != 0x00)
			{
				Eq_2 a5_11 = g_t4202700C;
				if (false)
					break;
				if (a0 == 0x42027000)
				{
					a1_14 = g_t4202700C;
					g_t4202700C = a5_11;
					break;
				}
				a5_13.u0 = 0x42027000;
			}
		}
		struct Eq_348488 * a5_27;
		Eq_2 a0_28;
		ptr32 a2_29;
		Eq_2 a3_30;
		byte * a4_31;
		Eq_2 s1_32 = memp_free(0x01, a1_14, a3, 0x42027000, mstatus, out a0_28, out a2_29, out a3_30, out a4_31, out a5_27);
		a0Out = a0_28;
		a2Out = a2_29;
		a3Out = a3_30;
		a4Out = a4_31;
		a5Out = a5_27;
		return s1_32;
	}
}

// 23075230: Register Eq_2 udp_new(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      dns_server_init
//      dhcp_inc_pcb_refcount
//      udp_new_ip_type
//      dhcp_server_start
//      iperf_server_udp
Eq_2 udp_new(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_13;
	word32 a2_63;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_14;
	Eq_2 s1_18 = memp_malloc(s1, 0x01, a3, a4, mstatus, out a0_13, out a2_63, out a3_16, out a4_17, out a5_14);
	if (a0_13 != 0x00)
	{
		word32 t1_64;
		word32 a0_65;
		word32 a1_66;
		word32 a2_67;
		word32 a5_68;
		ra = memset(ra, a0_13, 0x00, 40, out t1_64, out a0_65, out a1_66, out a2_67, out a3_16, out a4_17, out a5_68);
		*((word32) a0_13 + 11) = ~0x00;
		*((word32) a0_13 + 29) = ~0x00;
		a5_14 = ~0x00;
	}
	s1Out = s1_18;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_14;
	return ra;
}

// 2307525E: Register Eq_2 udp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      dns_init
//      lwip_netconn_do_newconn
//      sntp_init
//      bl_cipstart
Eq_2 udp_new_ip_type(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_9;
	ptr32 a4_10;
	ptr32 a5_11;
	ptr32 s1_12;
	Eq_2 ra_15 = udp_new(ra, s1, a3, a4, mstatus, out s1_12, out a3_9, out a4_10, out a5_11);
	s1Out = s1_12;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	return ra_15;
}

