pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23075262: Register Eq_2 udp_netif_ip_addr_changed(Register word32 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      netif_do_set_ipaddr
//      netif_remove
Eq_2 udp_netif_ip_addr_changed(word32 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5)
{
	if (a0 != 0x00 && (a5 != 0x00 && (a1 != 0x00 && a5 != 0x00)))
	{
		a5 = g_t42026914;
		while (a5 != 0x00)
		{
			struct Eq_423188 * a5_14 = *a3;
			if (a3 == a4)
				*a4 = a5_14;
			a5 = a5_14->t000C;
		}
	}
	return a5;
}

// 2307528A: void ethernet_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack word32 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgA4, Stack Eq_2 dwArgA8, Stack word32 dwArgAC, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack word32 dwArgC0, Stack word32 dwArgC4, Stack Eq_2 dwArgC8, Stack word32 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack word32 dwArg0168, Stack word32 dwArg0188)
void ethernet_input(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, word32 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, word32 dwArgA4, Eq_2 dwArgA8, word32 dwArgAC, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgB8, word32 dwArgC0, word32 dwArgC4, Eq_2 dwArgC8, word32 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, word32 dwArg0168, word32 dwArg0188)
{
	Eq_2 a4_194;
	Eq_2 s0_15 = a0;
	if ((word32) *((word32) a0 + 0x0A) <= 0x0E)
	{
l230752A0:
		g_w42026818 = (word16) ((word32) g_w42026818 + 0x01);
		goto l23075334;
	}
	if ((word32) *((word32) a0 + 0x0F) == 0x00)
		*((word32) a0 + 0x0F) = (byte) ((word32) *((word32) a1 + 0x0044) + 0x01);
	ui32 a5_29 = (word32) *a0;
	s0_15 = *((word32) a0 + 4);
	Eq_2 s1_28 = (word32) *((word32) a0 + 0x0D) << 8 | (word32) (*((word32) a0 + 0x0C));
	a4_194 = a5_29 & 1;
	if ((a5_29 & 1) != 0x00)
	{
		ui32 a5_42;
		a4_194.u0 = 0x01;
		if (a5_29 != 0x01)
		{
			word32 a5_485;
			word32 a1_484;
			if (memcmp(a0, 588036844, 0x06, out a1_484, out a2, out a3, out a4_194, out a5_485) != 0x00)
				goto l23075302;
			a5_42 = (word32) *((word32) s0_15 + 0x0D) | 8;
l230752FE:
			*((word32) s0_15 + 0x0D) = (byte) a5_42;
			goto l23075302;
		}
		if ((word32) *((word32) a0 + 1) != 0x00)
			goto l23075302;
		a4_194 = (word32) *((word32) a0 + 2);
		if (a4_194 == 94)
		{
			a5_42 = (word32) *((word32) s0_15 + 0x0D) | 16;
			goto l230752FE;
		}
	}
l23075302:
	if (s1_28 != 0x08)
	{
		if (s1_28 != 1544)
			goto l230752A0;
		if (((word32) *((word32) a1 + 65) & 0x08) != 0x00)
		{
			word32 a4_503;
			word32 a5_504;
			word32 a1_502;
			if (pbuf_remove_header(s0_15, 0x0E, a2, out a1_502, out a3, out a4_503, out a5_504) != 0x00)
			{
				g_w42026812 = (word16) ((word32) g_w42026812 + 0x01);
l23075334:
				word32 a4_193 = (word32) g_w4202680E;
				g_w4202680E = (word16) (a4_193 + 0x01);
				a4_194 = a4_193 + 0x01;
				goto l2307533E;
			}
			etharp_input(ra, s1_28, a1, a3, a1, s4, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg54, dwArg58, dwArg68, s1, ra, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB0, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0148, dwArg0188);
l2307537A:
			0x00 = (int8) dwArg38;
			return;
		}
	}
	else if (((word32) *((word32) a1 + 65) & 0x08) != 0x00)
	{
		word32 a5_506;
		word32 a1_505;
		if (pbuf_remove_header(s0_15, 0x0E, a2, out a1_505, out a3, out a4_194, out a5_506) == 0x00)
		{
			ip4_input(ra, s0_15, s0_15, a1, a3, s3, s4, s5, s6, s8, s10, s11, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA4, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC4, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168);
			goto l2307537A;
		}
	}
l2307533E:
	word32 a1_489;
	word32 a0_488;
	word32 s0_486;
	word32 s1_487;
	word32 s2_495;
	word32 a7_494;
	word32 a4_492;
	word32 a5_493;
	word32 a2_490;
	word32 a3_491;
	word32 s4_497;
	word32 s5_498;
	word32 s8_500;
	word32 mstatus_501;
	word32 s3_496;
	word32 s6_499;
	pbuf_free(ra, s0_15, a3, a4_194, s4, mstatus, dwArg0118, out s0_486, out s1_487, out a0_488, out a1_489, out a2_490, out a3_491, out a4_492, out a5_493, out a7_494, out s2_495, out s3_496, out s4_497, out s5_498, out s6_499, out s8_500, out mstatus_501);
	goto l2307537A;
}

// 23075392: Register Eq_2 ethernet_output(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      etharp_input
//      etharp_request
//      etharp_output_to_arp_index
//      etharp_query
//      etharp_output
Eq_2 ethernet_output(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	word32 a5_170;
	Eq_2 a0_26 = lwip_htons(a4, out a5_170);
	Eq_2 a3_34;
	word32 a1_171;
	word32 a2_172;
	word32 a4_173;
	word32 a5_174;
	if (pbuf_add_header(a1, 0x0E, out a1_171, out a2_172, out a3_34, out a4_173, out a5_174) != 0x00)
	{
		word32 a4_40 = (word32) g_w420267FA;
		g_w420267FA = (word16) (a4_40 + 0x01);
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = a0_26;
		a3Out = a3_34;
		a4Out = a4_40 + 0x01;
		s2Out = a1;
		s3Out = a0;
		s4Out = a2;
		return ra;
	}
	else
	{
		Eq_2 s0_50 = *((word32) a1 + 4);
		*((word32) s0_50 + 0x0C) = (byte) a0_26;
		*((word32) s0_50 + 0x0D) = (byte) (a0_26 >> 8);
		word32 a1_175;
		word32 a2_176;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a6_180;
		word32 a7_181;
		memcpy(s0_50, a3_34, 0x06, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a6_180, out a7_181);
		word32 a4_73;
		word32 a3_78;
		word32 a1_182;
		word32 a2_183;
		word32 a5_184;
		word32 a6_185;
		word32 a7_186;
		memcpy((word32) s0_50 + 6, a2, 0x06, out a1_182, out a2_183, out a3_78, out a4_73, out a5_184, out a6_185, out a7_186);
		<anonymous> * t1_87 = *((word32) a0 + 24);
		0x00 = (int8) dwArg0128;
		Eq_2 s3_96;
		ptr32 a4_98;
		Eq_2 a3_99;
		Eq_2 ra_100;
		Eq_2 s1_101;
		Eq_2 s2_102;
		Eq_2 s4_103;
		Eq_2 s0_106;
		word32 t1_107;
		word32 a7_112;
		word32 a6_113;
		word32 t0_114;
		word32 t4_115;
		word32 t5_116;
		word32 t6_117;
		t1_87();
		s0Out = s0_106;
		s1Out = s1_101;
		a3Out = a3_99;
		a4Out = a4_98;
		s2Out = s2_102;
		s3Out = s3_96;
		s4Out = s4_103;
		return ra_100;
	}
}

// 2307541C: Register word32 netconn_apimsg(Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_423566 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_423569 a4Out, Register out (ptr32 Eq_423570) a5Out, Register out Eq_423571 s2Out, Register out (ptr32 Eq_423572) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      netconn_close_shutdown
//      netconn_new_with_proto_and_callback
//      netconn_prepare_delete
//      netconn_getaddr
//      netconn_bind
//      netconn_connect
//      netconn_disconnect
//      netconn_listen_with_backlog
//      netconn_tcp_recvd
//      netconn_send
//      netconn_write_vectors_partly
//      netconn_recv_tcp_pbuf_flags
//      netconn_join_leave_group
word32 netconn_apimsg(Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_423566 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_423569 & a4Out, struct Eq_423570 & a5Out, union Eq_423571 & s2Out, struct Eq_423572 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a3_19;
	Eq_423569 a4_20;
	struct Eq_423570 * a5_21;
	word32 s1_25;
	Eq_423571 s2_26;
	struct Eq_423572 * s3_27;
	ptr32 s4_28;
	ptr32 s5_29;
	ptr32 s6_30;
	Eq_423566 a0_16;
	struct Eq_423586 * s0_24 = tcpip_send_msg_wait_sem(*a2, (word32) a2 + 0x0C, a4, a5, mstatus, dwArg04, dwArgB8, dwArgF8, dwArg0138, out s1_25, out a0_16, out a3_19, out a4_20, out a5_21, out s2_26, out s3_27, out s4_28, out s5_29, out s6_30);
	if (a0_16 == 0x00)
		a0_16.u0 = (int32) s0_24->b0004;
	a0Out = a0_16;
	a2Out = dwArg10;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5_29;
	s6Out = s6_30;
	return s1_25;
}

// 2307543A: void netconn_close_shutdown(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8)
// Called from:
//      netconn_recv_tcp_pbuf_flags
void netconn_close_shutdown(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8)
{
	if (a0 == 0x00)
		return;
	Eq_2 a5_12;
	sys_now(out a5_12);
	word32 a0_94;
	word32 a2_95;
	word32 a3_96;
	word32 a4_97;
	word32 a5_98;
	word32 s2_99;
	word32 s3_100;
	word32 s4_101;
	word32 s5_102;
	word32 s6_103;
	netconn_apimsg(a2, a4, a5_12, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_94, out a2_95, out a3_96, out a4_97, out a5_98, out s2_99, out s3_100, out s4_101, out s5_102, out s6_103);
}

// 23075464: Register Eq_2 netconn_new_with_proto_and_callback(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      lwip_socket
Eq_2 netconn_new_with_proto_and_callback(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s5Out)
{
	Eq_2 a2_20;
	Eq_2 a5_23;
	word32 s3_168;
	Eq_2 a4_101;
	Eq_2 a3_100;
	ptr32 s2_147;
	Eq_2 a0_27 = netconn_alloc(ra, a0, a3, a4, mstatus, dwLoc40, dwLoc3C, dwLoc08, dwArg44, dwArgB8, dwArgF8, dwArg0138, out a2_20, out a3_100, out a4_101, out a5_23, out s2_147, out s3_168);
	Eq_2 s0_104 = a0_27;
	if (a0_27 != 0x00)
	{
		word32 a0_40;
		word32 a2_169;
		word32 a5_170;
		word32 s3_171;
		word32 s4_172;
		word32 s6_173;
		netconn_apimsg(a2_20, a4_101, a5_23, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_40, out a2_169, out a3_100, out a4_101, out a5_170, out s2_147, out s3_171, out s4_172, out s5, out s6_173);
		if (a0_40 != 0x00)
		{
			sys_mbox_valid((word32) a0_27 + 16);
			sys_mbox_valid((word32) a0_27 + 20);
			sys_sem_valid((word32) a0_27 + 0x0C);
			Eq_2 a3_74;
			Eq_2 a4_75;
			Eq_2 s1_79;
			word32 a5_174;
			word32 s4_175;
			Eq_2 s0_78 = sys_sem_free((word32) a0_27 + 0x0C, a3_100, mstatus, dwArg0118, dwArg0158, out s1_79, out a3_74, out a4_75, out a5_174, out s4_175);
			Eq_2 a3_87;
			Eq_2 a4_88;
			word32 a0_176;
			word32 a2_177;
			word32 a5_178;
			word32 s4_179;
			sys_mbox_free(s1_79, a3_74, a4_75, mstatus, dwArg0108, dwArg0148, out a0_176, out a2_177, out a3_87, out a4_88, out a5_178, out s4_179);
			word32 a0_180;
			word32 a2_181;
			word32 a5_182;
			memp_free(0x07, s0_78, a3_87, a4_88, mstatus, out a0_180, out a2_181, out a3_100, out a4_101, out a5_182);
			s2_147 = (word32) a0_27 + 0x0C;
			s0_104.u0 = 0x00;
		}
	}
	a3Out = a3_100;
	a4Out = a4_101;
	s2Out = s2_147;
	s5Out = s5;
	return s0_104;
}

// 230754D0: Register word32 netconn_prepare_delete(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      lwip_close
//      netconn_delete
word32 netconn_prepare_delete(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	if (a0 == 0x00)
	{
		a0Out = 0x00;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		return s1;
	}
	else
	{
		Eq_2 a5_10;
		sys_now(out a5_10);
		ptr32 a0_18;
		ptr32 a3_21;
		Eq_2 a4_22;
		ptr32 a5_23;
		ptr32 s2_27;
		ptr32 s3_28;
		ptr32 s4_29;
		ptr32 s5_30;
		word32 a2_100;
		word32 s6_101;
		word32 s1_26 = netconn_apimsg(a2, a4, a5_10, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_18, out a2_100, out a3_21, out a4_22, out a5_23, out s2_27, out s3_28, out s4_29, out s5_30, out s6_101);
		a0Out = a0_18;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_23;
		s2Out = s2_27;
		s3Out = s3_28;
		s4Out = s4_29;
		s5Out = s5_30;
		return s1_26;
	}
}

// 230754F6: Register word32 netconn_delete(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      free_socket
//      lwip_accept
//      lwip_socket
word32 netconn_delete(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 s1_10 = 0x00;
	if (a0 != 0x00)
	{
		word32 a0_16;
		netconn_prepare_delete(a0, a2, a4, mstatus, dwArg68, dwArgA8, dwArgE8, out a0_16, out a3, out a4, out a5, out s2, out s3, out s4, out s5);
		s1_10 = a0_16;
		if (a0_16 == 0x00)
			s1_10 = netconn_free(a0, a3, mstatus, dwArg0138, dwArg0178, out a3, out a4, out a5, out s4);
	}
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	return s1_10;
}

// 2307551E: Register Eq_2 netconn_getaddr(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      lwip_accept
//      lwip_recv
Eq_2 netconn_getaddr(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_2 & a2Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out)
{
	if (a0 == 0x00)
	{
		a2Out = a2;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		return ~0x0F;
	}
	else if (a1 == 0x00 || a2 == 0x00)
	{
		a2Out = a2;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_22;
		Eq_2 a2_24;
		Eq_2 a4_26;
		ptr32 s2_31;
		ptr32 s3_32;
		word32 s6_127;
		word32 s5_126;
		word32 s4_125;
		word32 a5_124;
		word32 a3_123;
		netconn_apimsg(a2, a4, a0, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_22, out a2_24, out a3_123, out a4_26, out a5_124, out s2_31, out s3_32, out s4_125, out s5_126, out s6_127);
		a2Out = a2_24;
		a4Out = a4_26;
		s2Out = s2_31;
		s3Out = s3_32;
		return a0_22;
	}
}

// 23075550: Register Eq_2 netconn_bind(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out)
// Called from:
//      lwip_bind
Eq_2 netconn_bind(Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_28;
		ptr32 a3_31;
		word32 a2_107;
		word32 a4_108;
		word32 a5_109;
		word32 s2_110;
		word32 s3_111;
		word32 s4_112;
		word32 s5_113;
		word32 s6_114;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_28, out a2_107, out a3_31, out a4_108, out a5_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114);
		a3Out = a3_31;
		return a0_28;
	}
}

// 23075580: Register Eq_2 netconn_connect(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out)
// Called from:
//      lwip_connect
Eq_2 netconn_connect(Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_28;
		ptr32 a3_31;
		word32 a2_107;
		word32 a4_108;
		word32 a5_109;
		word32 s2_110;
		word32 s3_111;
		word32 s4_112;
		word32 s5_113;
		word32 s6_114;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_28, out a2_107, out a3_31, out a4_108, out a5_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114);
		a3Out = a3_31;
		return a0_28;
	}
}

// 230755B0: Register word32 netconn_disconnect(Register word32 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out)
// Called from:
//      lwip_connect
word32 netconn_disconnect(word32 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		return ~0x0F;
	}
	else
	{
		word32 a0_16;
		ptr32 a3_19;
		word32 a2_89;
		word32 a4_90;
		word32 a5_91;
		word32 s2_92;
		word32 s3_93;
		word32 s4_94;
		word32 s5_95;
		word32 s6_96;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_16, out a2_89, out a3_19, out a4_90, out a5_91, out s2_92, out s3_93, out s4_94, out s5_95, out s6_96);
		a3Out = a3_19;
		return a0_16;
	}
}

