pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 230755D0: Register Eq_2 netconn_listen_with_backlog(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      lwip_listen
Eq_2 netconn_listen_with_backlog(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out, ptr32 & s2Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		s2Out = s2;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_16;
		ptr32 a3_19;
		ptr32 s2_25;
		word32 a2_90;
		word32 a4_91;
		word32 a5_92;
		word32 s3_93;
		word32 s4_94;
		word32 s5_95;
		word32 s6_96;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_16, out a2_90, out a3_19, out a4_91, out a5_92, out s2_25, out s3_93, out s4_94, out s5_95, out s6_96);
		a3Out = a3_19;
		s2Out = s2_25;
		return a0_16;
	}
}

// 230755F0: void netconn_tcp_recvd(Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8)
// Called from:
//      lwip_recv_tcp
void netconn_tcp_recvd(Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8)
{
	if (a0 == 0x00)
		return;
	ui32 a4_6 = (word32) *a0;
	if ((a4_6 & 0x00F0) != 0x10)
		return;
	word32 a0_96;
	word32 a2_97;
	word32 a3_98;
	word32 a4_99;
	word32 a5_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	netconn_apimsg(a2, a4_6 & 0x00F0, a0, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_96, out a2_97, out a3_98, out a4_99, out a5_100, out s2_101, out s3_102, out s4_103, out s5_104, out s6_105);
}

// 23075626: Register word32 netconn_send(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_2 a4Out, Register out ptr32 s4Out)
// Called from:
//      lwip_sendto
word32 netconn_send(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_2 & a4Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a4Out = a4;
		s4Out = s4;
		return a3;
	}
	else
	{
		word32 a3_21;
		Eq_2 a4_22;
		ptr32 s4_29;
		word32 a0_92;
		word32 a2_93;
		word32 a5_94;
		word32 s2_95;
		word32 s3_96;
		word32 s5_97;
		word32 s6_98;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_92, out a2_93, out a3_21, out a4_22, out a5_94, out s2_95, out s3_96, out s4_29, out s5_97, out s6_98);
		a4Out = a4_22;
		s4Out = s4_29;
		return a3_21;
	}
}

// 23075648: Register (ptr32 Eq_387511) netconn_write_vectors_partly(Register (ptr32 Eq_387511) a0, Register ptr32 a1, Register Eq_2 a2, Register ui32 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      netconn_write_partly
struct Eq_387511 * netconn_write_vectors_partly(struct Eq_387511 * a0, ptr32 a1, Eq_2 a2, ui32 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	if (a0 == null)
	{
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return (struct Eq_387511 *) ~0x0F;
	}
	struct Eq_387511 * a0_10 = (struct Eq_387511 *) ~0x05;
	if (((word32) a0->b0000 & 0x00F0) == 0x10)
	{
		int32 t1_12 = a0->dw001C;
		if (((word32) (((word32) a0->b0024 & 0x02 | a3 & 4) != 0x00) | t1_12) != 0x00 && a4 == 0x00)
		{
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s8Out = s8;
			return (struct Eq_387511 *) ~0x05;
		}
		struct Eq_424101 * a7_23 = a1 + 4;
		Eq_2 a0_24 = 0x00;
		Eq_2 a5_25 = 0x00;
		while (a0_24 < a2)
		{
			Eq_2 t3_30 = a7_23->dw0000;
			++a7_23;
			a5_25 += t3_30;
			if (a5_25 < t3_30)
			{
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s8Out = s8;
				return (struct Eq_387511 *) ~0x05;
			}
			a0_24 = (word32) a0_24 + 1;
		}
		if (a5_25 == 0x00)
		{
			a0_10 = null;
			goto l23075692;
		}
		if (a5_25 >= 0x00)
		{
l230756B8:
			if (t1_12 != 0x00)
				sys_now(out a5_25);
			union Eq_2 * a5_99;
			ptr32 s2_103;
			ptr32 s3_104;
			ptr32 s4_105;
			ptr32 s5_106;
			word32 s6_297;
			word32 a4_296;
			word32 a2_294;
			word32 a3_295;
			struct Eq_387511 * a0_117;
			netconn_apimsg(a2, a4, a5_25, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_117, out a2_294, out a3_295, out a4_296, out a5_99, out s2_103, out s3_104, out s4_105, out s5_106, out s6_297);
			if (a0_117 == null)
			{
				if (a4 != 0x00)
					*a5_99 = (union Eq_2 *) a4;
				else
					a0_117 = null;
			}
			s2Out = s2_103;
			s3Out = s3_104;
			s4Out = s4_105;
			s5Out = s5_106;
			s8Out = dwArgD4;
			return a0_117;
		}
		a0_10 = (struct Eq_387511 *) ~0x05;
		if (a4 != 0x00)
		{
			a5_25.u0 = 0x7FFFFFFF;
			goto l230756B8;
		}
	}
l23075692:
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s8Out = s8;
	return a0_10;
}

// 23075700: Register (ptr32 Eq_387511) netconn_write_partly(Register (ptr32 Eq_387511) a0, Register ui32 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      lwip_send
struct Eq_387511 * netconn_write_partly(struct Eq_387511 * a0, ui32 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgD8, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ptr32 s2_28;
	ptr32 s3_29;
	ptr32 s4_30;
	ptr32 s5_31;
	ptr32 s8_33;
	struct Eq_387511 * a0_16 = netconn_write_vectors_partly(a0, fp + ~0x17, 0x01, a3, a4, mstatus, dwArg58, dwArg98, dwArgD8, out s2_28, out s3_29, out s4_30, out s5_31, out s8_33);
	s2Out = s2_28;
	s3Out = s3_29;
	s4Out = s4_30;
	s5Out = s5_31;
	s8Out = s8_33;
	return a0_16;
}

