pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23075716: Register Eq_424187 netconn_err(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_424187 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_424196) a5Out)
// Called from:
//      netconn_accept
//      netconn_recv_data
//      netconn_recv_tcp_pbuf_flags
//      lwip_netconn_do_send
//      lwip_netconn_do_write
Eq_424187 netconn_err(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_424187 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_424196 & a5Out)
{
	Eq_424187 s1_10 = 0x00;
	if (a0 != 0x00)
	{
		word32 a2_50;
		word32 a4_51;
		sys_arch_protect(a4, mstatus, out a2_50, out a4_51);
		s1_10.u0 = (int32) *((word32) a0 + 8);
		((word32) a0 + 8)->u0 = 0x00;
		a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5);
	}
	a0Out = s1_10;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return s1_10;
}

// 23075740: Register Eq_2 netconn_accept(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 word32) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_386302 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_accept
Eq_2 netconn_accept(Eq_2 ra, Eq_2 a0, word32 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg54, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_386302 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_104;
	struct Eq_424222 * sp_102 = fp + -48;
	if (a1 == null)
	{
l2307574E:
		s0_104.u0 = ~0x0F;
		goto l23075750;
	}
	*a1 = 0x00;
	if (a0 == 0x00)
		goto l2307574E;
	Eq_2 a0_22;
	Eq_2 a2_23;
	Eq_2 s1_24 = netconn_err(a0, a3, a4, mstatus, out a0_22, out a2_23, out a3, out a4, out a5);
	s0_104 = a0_22;
	if (a0_22 == 0x00)
	{
		if (sys_mbox_valid((word32) s1_24 + 20) == 0x00)
		{
l23075782:
			s0_104.u0 = ~0x0E;
			goto l23075750;
		}
		a5 = (word32) *((word32) s1_24 + 36);
		a4 = a5 & 1;
		if ((a5 & 1) != 0x00)
			goto l23075782;
		union Eq_386302 * s2_106;
		Eq_2 a0_109;
		word32 s3_51;
		if ((a5 & 0x02) != 0x00)
		{
			word32 s4_303;
			word32 a1_302;
			word32 s1_301;
			s0_104 = sys_arch_mbox_tryfetch((word32) s1_24 + 20, fp + -36, a3, a5 & 1, a5 & 0x02, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, out s1_301, out a0_109, out a1_302, out a3, out a4, out s2_106, out s3_51, out s4_303);
			a5.u0 = ~0x00;
			if (a0_109 == ~0x00)
			{
				s0_104.u0 = ~0x06;
				goto l23075750;
			}
		}
		else
		{
			word32 s1_297;
			word32 a1_298;
			word32 a5_299;
			word32 s4_300;
			s0_104 = sys_arch_mbox_fetch((word32) s1_24 + 20, fp + -36, a2_23, a3, a5 & 1, mstatus, dwArg34, dwArgA8, dwArgE8, out s1_297, out a0_109, out a1_298, out a3, out a4, out a5_299, out s2_106, out s3_51, out s4_300);
			a5.u0 = ~0x00;
			if (a0_109 == ~0x00)
			{
				s0_104.u0 = ~0x02;
				goto l23075750;
			}
		}
		Eq_2 s1_90 = *(union Eq_2 *) 0x2B;
		if (true)
		{
			word32 a5_113;
			word32 a6_117;
			word32 a7_118;
			word32 s4_119;
			word32 s8_120;
			word32 t0_121;
			word32 t1_122;
			word32 t4_123;
			word32 t5_124;
			word32 t6_125;
			(*(<anonymous> *) ~0x00)();
		}
		if (lwip_netconn_is_err_msg(a0_109, &sp_102->b000B, out a4, out a5) != 0x00)
			s0_104 = (int32) sp_102->b000B;
		else
		{
			if (a5 == 0x00)
				goto l23075782;
			*s2_106 = (union Eq_386302 *) a5;
		}
	}
l23075750:
	0x00 = (int8) dwArg0128;
	a0Out = s0_104;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	mstatusOut = mstatus;
	return ra;
}

// 230757E4: Register Eq_2 netconn_recv_data(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_385034) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 Eq_424373) a0Out, Register out (ptr32 Eq_385034) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_424373) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_385034) s3Out, Register out ptr32 mstatusOut)
// Called from:
//      netconn_recv_udp_raw_netbuf_flags
//      netconn_recv_tcp_pbuf_flags
Eq_2 netconn_recv_data(Eq_2 ra, Eq_2 a0, struct Eq_385034 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg14, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, struct Eq_424373 & a0Out, struct Eq_385034 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_424373 & a5Out, ptr32 & s2Out, struct Eq_385034 & s3Out, ptr32 & mstatusOut)
{
	struct Eq_424373 * a5_101;
	if (a1 == null)
	{
l230757F4:
		a5_101 = (struct Eq_424373 *) ~0x0F;
		goto l230757F6;
	}
	a1->ptr0000 = null;
	if (a0 == 0x00)
		goto l230757F4;
	s2 = (word32) a0 + 16;
	s3 = a1;
	if (sys_mbox_valid((word32) a0 + 16) == 0x00)
	{
		struct Eq_424373 * a0_171;
		word32 a2_407;
		word32 a5_408;
		netconn_err(a0, a3, a4, mstatus, out a0_171, out a2_407, out a3, out a4, out a5_408);
		a5_101 = a0_171;
		if (a0_171 != null)
			goto l230757F6;
		goto l23075828;
	}
	word32 s1_126;
	Eq_2 a0_111;
	Eq_2 s0_102;
	ui32 a5_25 = (word32) *((word32) a0 + 36);
	Eq_2 a5_27 = a5_25 & 0x03;
	Eq_2 a2_28 = a2 & 4 | a5_25 & 0x03;
	if (a2_28 == 0x00)
	{
		a5_27 = (int32) *((word32) a0 + 8);
		if (a5_27 == 0x00)
		{
			word32 s4_412;
			word32 a4_410;
			word32 a5_411;
			s0_102 = sys_arch_mbox_fetch((word32) a0 + 16, fp + -36, a2_28, a3, a4, mstatus, dwArg34, dwArgA8, dwArgE8, out s1_126, out a0_111, out a1, out a3, out a4_410, out a5_411, out s2, out s3, out s4_412);
			a4.u0 = ~0x00;
			a5_101 = (struct Eq_424373 *) ~0x02;
			if (a0_111 == ~0x00)
				goto l230757F6;
l2307584E:
			ui32 a5_104 = (word32) *s0_102;
			a4.u0 = 0x10;
			struct Eq_385034 * a5_108 = a5_104 & 0x00F0;
			if ((a5_104 & 0x00F0) == 0x10)
			{
				a1 = fp + -37;
				if (lwip_netconn_is_err_msg(a0_111, fp + -37, out a4, out a5_108) != 0x00)
				{
					a5_101 = (int32) bLoc25;
					a4.u0 = ~0x0E;
					if (a5_101 != (struct Eq_424373 *) ~0x0E)
						goto l230757F6;
					goto l23075872;
				}
			}
			word32 a2_118 = (word32) a5_108->w0008;
			word32 s0_119 = (&a5_108->w0008)[18];
			if (a5_108 != null)
			{
				word32 a6_152;
				word32 a7_153;
				word32 s4_154;
				word32 s8_155;
				word32 t0_156;
				word32 t1_157;
				word32 t4_158;
				word32 t5_159;
				word32 t6_160;
				a5_108();
			}
			s3->ptr0000 = a5_108;
l23075872:
			a5_101 = null;
l230757F6:
			0x00 = (int8) dwArg0128;
			s0Out = dwArgE4;
			a0Out = a5_101;
			a1Out = a1;
			a2Out = dwArg0100;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_101;
			s2Out = s2;
			s3Out = s3;
			mstatusOut = mstatus;
			return ra;
		}
	}
	Eq_2 a4_72;
	word32 s4_409;
	s0_102 = sys_arch_mbox_tryfetch((word32) a0 + 16, fp + -36, a3, a4, a5_27, mstatus, dwLoc2C, 0x00, dwArgC8, dwArg0108, out s1_126, out a0_111, out a1, out a3, out a4_72, out s2, out s3, out s4_409);
	if (a0_111 == ~0x00)
	{
		struct Eq_424373 * a0_91;
		word32 a5_414;
		word32 a2_413;
		netconn_err(s0_102, a3, a4_72, mstatus, out a0_91, out a2_413, out a3, out a4, out a5_414);
		a5_101 = a0_91;
		if (a0_91 == null)
		{
			if (((word32) *((word32) s0_102 + 36) & 0x01) != 0x00)
			{
l23075828:
				a5_101 = (struct Eq_424373 *) ~0x0A;
				goto l230757F6;
			}
			a5_101 = (struct Eq_424373 *) ~0x06;
		}
		goto l230757F6;
	}
	goto l2307584E;
}

// 230758BC: Register Eq_2 netconn_recv_udp_raw_netbuf_flags(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_385034) a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack word32 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out (ptr32 Eq_385034) a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out, Register out Eq_385515 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_recvfrom_udp_raw.isra.6
Eq_2 netconn_recv_udp_raw_netbuf_flags(Eq_2 ra, Eq_2 a0, struct Eq_385034 * a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, word32 dwArg14, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & a0Out, struct Eq_385034 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_385515 & s2Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		ui32 a5_5 = (word32) *a0;
		a4 = 0x10;
		a5 = a5_5 & 0x00F0;
		if ((a5_5 & 0x00F0) != 0x10)
		{
			struct Eq_385034 * a1_14;
			Eq_2 a3_16;
			ptr32 a4_17;
			union Eq_2 * a5_18;
			Eq_385515 s2_23;
			ptr32 a0_34;
			ptr32 mstatus_35;
			word32 s3_118;
			word32 s0_116;
			word32 a2_117;
			Eq_2 ra_36 = netconn_recv_data(ra, a0, a1, a2, a3, 0x10, mstatus, dwArg14, dwArg34, dwArgA8, dwArgB4, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_116, out a0_34, out a1_14, out a2_117, out a3_16, out a4_17, out a5_18, out s2_23, out s3_118, out mstatus_35);
			a0Out = a0_34;
			a1Out = a1_14;
			a3Out = a3_16;
			a4Out = a4_17;
			a5Out = a5_18;
			s2Out = s2_23;
			mstatusOut = mstatus_35;
			return ra_36;
		}
	}
	a0Out = ~0x0F;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	mstatusOut = mstatus;
	return ra;
}

// 230758D4: Register Eq_2 netconn_recv_data_tcp(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_385034) a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_424614) a5Out, Register out (ptr32 Eq_385034) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      netconn_recv_tcp_pbuf_flags
Eq_2 netconn_recv_data_tcp(Eq_2 ra, Eq_2 a0, struct Eq_385034 * a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, struct Eq_424614 & a5Out, struct Eq_385034 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_424620 * sp_129 = fp + -80;
	Eq_2 s0_157 = a0;
	struct Eq_385034 * s3_119 = a1;
	Eq_2 s2_118 = a2;
	word32 s1_115 = ~0x0A;
	if (sys_mbox_valid((word32) a0 + 16) != 0x00)
	{
		ui32 a5_23 = (word32) *((word32) a0 + 36);
		Eq_2 a4_139 = (int32) (byte) a5_23;
		if (a4_139 < 0x00)
		{
			*((word32) a0 + 36) = (byte) (a5_23 & 0x007F);
			a5 = a5_23 & 0x007F;
			goto l23075906;
		}
		word32 a0_51;
		word32 a1_382;
		ui32 s2_40;
		ra = netconn_recv_data(ra, a0, a1, a2, a3, a4_139, mstatus, dwLoc3C, dwLoc1C, dwArg58, dwArg64, dwArg78, dwArg98, dwArgB8, dwArgD8, out s0_157, out a0_51, out a1_382, out a2, out a3, out a4_139, out a5, out s2_40, out s3_119, out mstatus);
		s1_115 = a0_51;
		if (a0_51 != 0x00)
			goto l23075980;
		a5 = s2_40 & 8;
		s3_119 = s3_119->ptr0000;
		if ((s2_40 & 8) == 0x00)
		{
			a4_139.u0 = 0x01;
			if (s3_119 != null)
				a4_139 = (word32) s3_119->w0008;
			ui32 a5_61 = (word32) *s0_157;
			a3.u0 = 0x10;
			a5 = a5_61 & 0x00F0;
			if ((a5_61 & 0x00F0) == 0x10)
			{
				word32 a0_383;
				s1_115 = netconn_apimsg(a2, a4_139, a5_61 & 0x00F0, mstatus, dwLoc4C, dwArg68, dwArgA8, dwArgE8, out a0_383, out a2, out a3, out a4_139, out a5, out s2_40, out s3_119, out s4, out s5, out s6);
			}
		}
		if (s3_119 == null)
		{
			s2_118 = s2_40 & 16;
			if (s2_118 != 0x00)
			{
				ui32 a5_102 = (word32) *((word32) s0_157 + 36);
				*((word32) s0_157 + 36) = (byte) (a5_102 | -0x0080);
				a5 = a5_102 | -0x0080;
				goto l23075980;
			}
l23075906:
			word32 s0_111 = a5->dw002C;
			if (a5 != null)
			{
				word32 a6_144;
				word32 a7_145;
				word32 s8_147;
				word32 t1_148;
				word32 t4_149;
				word32 t5_150;
				word32 t6_151;
				word32 tp_152;
				a5();
			}
			s0_157 = a5->t0004;
			if (a5 == null)
			{
				word32 a0_193;
				word32 a4_381;
				word32 a3_380;
				netconn_err(s0_157, a3, a4_139, mstatus, out a0_193, out a2, out a3_380, out a4_381, out a5);
			}
			else
				netconn_close_shutdown(s0_157, a2, a4_139, mstatus, sp_129->t0078, sp_129->t00B8, sp_129->t00F8);
			goto l23075980;
		}
	}
l23075980:
	s0Out = s0_157;
	s1Out = dwLoc4C;
	a0Out = dwLoc4C;
	a2Out = a2;
	a5Out = a5;
	s3Out = s3_119;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return dwLoc08;
}

