pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307599C: Register Eq_2 netconn_recv_tcp_pbuf_flags(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_385034) a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_385051 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_385055 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_recv_tcp
Eq_2 netconn_recv_tcp_pbuf_flags(Eq_2 ra, Eq_2 a0, struct Eq_385034 * a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_385051 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_385055 & s6Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		ui32 a5_5 = (word32) *a0;
		a5 = a5_5 & 0x00F0;
		if ((a5_5 & 0x00F0) == 0x10)
		{
			ptr32 a0_14;
			ptr32 s0_17;
			ptr32 s1_18;
			ptr32 s3_20;
			Eq_2 a2_24;
			Eq_385051 a5_26;
			ptr32 mstatus_29;
			ptr32 s4_30;
			ptr32 s5_37;
			Eq_385055 s6_38;
			Eq_2 ra_16 = netconn_recv_data_tcp(ra, a0, a1, a2, a3, mstatus, dwArg58, dwArg64, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, out s0_17, out s1_18, out a0_14, out a2_24, out a5_26, out s3_20, out s4_30, out s5_37, out s6_38, out mstatus_29);
			s0Out = s0_17;
			s1Out = s1_18;
			a0Out = a0_14;
			a2Out = a2_24;
			a5Out = a5_26;
			s3Out = s3_20;
			s4Out = s4_30;
			s5Out = s5_37;
			s6Out = s6_38;
			mstatusOut = mstatus_29;
			return ra_16;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a0Out = ~0x0F;
	a2Out = a2;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 230759B4: Register Eq_2 netconn_join_leave_group(Register int32 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      lwip_close
Eq_2 netconn_join_leave_group(int32 a0, ptr32 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return a2;
	}
	else
	{
		if (a2 == 0x00)
			a2.u0 = 588036828;
		Eq_2 a2_43;
		Eq_2 a4_45;
		Eq_2 a5_46;
		union Eq_2 * s2_50;
		ptr32 s3_51;
		ptr32 s4_52;
		word32 a0_129;
		word32 a3_130;
		word32 s5_131;
		word32 s6_132;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_129, out a2_43, out a3_130, out a4_45, out a5_46, out s2_50, out s3_51, out s4_52, out s5_131, out s6_132);
		a4Out = a4_45;
		a5Out = a5_46;
		s2Out = s2_50;
		s3Out = s3_51;
		s4Out = s4_52;
		return a2_43;
	}
}

// 230759F0: Register Eq_2 netconn_gethostbyname(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out)
// Called from:
//      lwip_gethostbyname
Eq_2 netconn_gethostbyname(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out)
{
	Eq_2 s0_36 = ~0x0F;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a0_21;
		Eq_2 a2_23;
		Eq_2 a5_26;
		word32 s3_149;
		s1 = sys_sem_new(ra, a3, fp + -37, a0, mstatus, dwLoc20, s0, ra, dwArgD8, dwArg0118, dwArg0158, out a0_21, out a2_23, out a3, out a4, out a5_26, out s2, out s3_149);
		byte bLoc25_96 = (byte) a0_21;
		s0_36 = a0_21;
		if (a0_21 == 0x00)
		{
			union Eq_2 * a0_41;
			Eq_2 a3_44;
			word32 s1_150;
			word32 a4_151;
			word32 a5_152;
			word32 s3_153;
			word32 s4_154;
			word32 s5_155;
			word32 s6_156;
			tcpip_send_msg_wait_sem(fp + -32, a2_23, a4, a5_26, mstatus, s0, dwArg98, dwArgD8, dwArg0118, out s1_150, out a0_41, out a3_44, out a4_151, out a5_152, out s2, out s3_153, out s4_154, out s5_155, out s6_156);
			word32 a5_157;
			word32 s4_158;
			s0_36 = sys_sem_free(a0_41, a3_44, mstatus, dwArg0128, dwArg0168, out s1, out a3, out a4, out a5_157, out s4_158);
			if (s0_36 == 0x00)
				s0_36 = (int32) bLoc25_96;
		}
	}
	a0Out = s0_36;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	return s1;
}

// 23075A42: void lwip_netconn_do_dns_found(Register Eq_2 a0, Register word32 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_dns_found(Eq_2 a0, word32 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	if (a1 == 0x00)
	{
		*a5 = ~0x05;
		a4.u0 = ~0x05;
	}
	else
	{
		*a5 = 0x00;
		*a4 = a5;
	}
	word32 s3_62;
	word32 s4_63;
	word32 s2_61;
	word32 a3_60;
	word32 a1_59;
	word32 s1_58;
	word32 s5_64;
	word32 s6_65;
	word32 s8_66;
	sys_sem_signal(a0, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_58, out a1_59, out a3_60, out s2_61, out s3_62, out s4_63, out s5_64, out s6_65, out s8_66);
}

// 23075A5E: void recv_udp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 s5, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack word32 dwArgE4, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void recv_udp(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 s5, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg78, Eq_2 dwArgC8, word32 dwArgE4, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 != 0x00 && sys_mbox_valid((word32) a0 + 16) != 0x00)
	{
		struct Eq_425025 * a0_31;
		word32 a2_260;
		word32 a5_261;
		memp_malloc(a0, 0x06, a3, a4, mstatus, out a0_31, out a2_260, out a3, out a4, out a5_261);
		if (a0_31 != null)
		{
			a0_31->t0000 = a2;
			a0_31->t0004 = a2;
			Eq_2 a5_41 = 0x00;
			if (a3 != 0x00)
				a5_41 = *a3;
			*((word32) a5_41 + 8) = a0_31;
			a0_31->w000C = (word16) a4;
			word32 a0_57;
			Eq_2 a3_60;
			Eq_2 a4_61;
			struct Eq_425058 * s1_66;
			word32 s2_67;
			word32 s3_68;
			word32 s5_70;
			word32 a1_262;
			word32 a5_263;
			word32 a7_264;
			word32 s4_265;
			word32 s6_266;
			Eq_2 s0_65 = sys_mbox_trypost((word32) a0 + 16, a4, a5_41, mstatus, dwLoc2C, (word32) *((word32) a2 + 8), dwArgC8, dwArg0108, dwArg0148, out s1_66, out a0_57, out a1_262, out a3_60, out a4_61, out a5_263, out a7_264, out s2_67, out s3_68, out s4_265, out s5_70, out s6_266);
			if (a0_57 == 0x00)
			{
				<anonymous> * t1_81 = s1_66->ptr002C;
				if (t1_81 == null)
				{
					0x00 = (int8) dwArg0128;
					return;
				}
				else
				{
					0x00 = (int8) dwArg0128;
					t1_81();
					return;
				}
			}
			else
			{
				0x00 = (int8) dwArg0128;
				word32 a2_267;
				word32 a3_268;
				word32 a4_269;
				word32 a5_270;
				netbuf_delete(ra, s0_65, a3_60, a4_61, dwArg78, mstatus, dwArg0108, out a2_267, out a3_268, out a4_269, out a5_270);
				return;
			}
		}
	}
	0x00 = (int8) dwArg0128;
	word32 s0_244;
	word32 s1_245;
	word32 a0_246;
	word32 a1_247;
	word32 a2_248;
	word32 a3_249;
	word32 a4_250;
	word32 a5_251;
	word32 a7_252;
	word32 s2_253;
	word32 s3_254;
	word32 s4_255;
	word32 s5_256;
	word32 s6_257;
	word32 s8_258;
	word32 mstatus_259;
	pbuf_free(ra, a2, a3, a4, dwArg78, mstatus, dwArg0128, out s0_244, out s1_245, out a0_246, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251, out a7_252, out s2_253, out s3_254, out s4_255, out s5_256, out s6_257, out s8_258, out mstatus_259);
}

// 23075B14: Register Eq_2 setup_tcp(Register Eq_2 s0, Register out ptr32 a1Out)
// Called from:
//      lwip_netconn_do_connected
//      lwip_netconn_do_newconn
//      accept_function
//      lwip_netconn_do_connect
Eq_2 setup_tcp(Eq_2 s0, ptr32 & a1Out)
{
	tcp_arg(s0, *((word32) s0 + 4));
	tcp_recv(s0, 587686306);
	tcp_sent(s0, 587686200);
	tcp_poll(s0, 0x2307603C, 0x02);
	tcp_err(s0, 587684818);
	a1Out = 587684818;
	return s0;
}

// 23075B64: void lwip_netconn_do_connected(Register word32 ra, Register Eq_2 s1, Register word32 a0, Register word32 a2, Register (ptr32 Eq_425143) a5, Register ptr32 mstatus, Stack word32 dwArg38)
void lwip_netconn_do_connected(word32 ra, Eq_2 s1, word32 a0, word32 a2, struct Eq_425143 * a5, ptr32 mstatus, word32 dwArg38)
{
	struct Eq_425146 * sp_3 = fp + ~0x0F;
	if (a0 != 0x00)
	{
		Eq_2 a0_14 = *((word32) s1 + 40);
		if (s1 != 0x00)
		{
			*((word32) s1 + 4) = (byte) a2;
			a0_14 = a5->t0028;
			s1 = (word32) s1 + 0x0C;
		}
		Eq_2 a4_24 = 0x10;
		if (((word32) *a0_14 & 0x00F0) == 0x10 && a2 == 0x00)
		{
			word32 a1_225;
			setup_tcp(a0_14, out a1_225);
		}
		ui32 a5_33 = (word32) *((word32) a0_14 + 36);
		*((word32) a0_14 + 40) = 0x00;
		*((word32) a0_14 + 1) = 0x00;
		*((word32) a0_14 + 36) = (byte) (a5_33 & ~0x04);
		ui32 s2_36 = a5_33 & 4;
		Eq_2 a5_37 = a5_33 & ~0x04;
		word32 s0_39 = (a5_33 & ~0x04)->dw002C;
		if ((a5_33 & ~0x04) != 0x00)
		{
			word32 s8_116;
			word32 s6_115;
			word32 s5_114;
			word32 s3_112;
			word32 s4_113;
			word32 a7_111;
			word32 a3_109;
			word32 a6_110;
			word32 t0_117;
			word32 t1_118;
			word32 t3_119;
			word32 t4_120;
			word32 t5_121;
			word32 t6_122;
			(a5_33 & ~0x04)();
		}
		if (s2_36 == 0x00)
		{
			word32 a3_228;
			word32 s1_226;
			word32 a1_227;
			word32 s4_231;
			word32 s5_232;
			word32 s3_230;
			word32 s2_229;
			word32 s8_234;
			word32 s6_233;
			sys_sem_signal(s1, a4_24, a5_37, mstatus, sp_3->t0008, sp_3->t0024, sp_3->t00A4, sp_3->t0118, sp_3->t0158, sp_3->t0198, out s1_226, out a1_227, out a3_228, out s2_229, out s3_230, out s4_231, out s5_232, out s6_233, out s8_234);
		}
	}
	0x00 = dwArg38;
}

// 23075BD2: void err_tcp(Register word32 ra, Register (ptr32 Eq_425273) a0, Register (ptr32 Eq_2) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void err_tcp(word32 ra, struct Eq_425273 * a0, union Eq_2 * a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	word32 a2_557;
	word32 a4_558;
	sys_arch_protect(a4, mstatus, out a2_557, out a4_558);
	ui32 a5_26 = (word32) a0->b0024;
	word32 s2_144 = (word32) a0->b0001;
	a0->dw0004 = 0x00;
	a0->b0024 = (byte) (a5_26 | 1);
	a0->b0008 = (byte) a1;
	a0->b0001 = 0x00;
	union Eq_2 * s1_108 = a1;
	struct Eq_425322 * a5_36;
	word32 a4_35;
	Eq_2 a3_34 = sys_arch_unprotect(a3, mstatus, out a4_35, out a5_36);
	if (a5_36 != null)
		a5_36();
	Eq_2 s4_67;
	Eq_2 s3_66;
	Eq_2 s0_46 = a5_36->t002C;
	s3_66 = s3;
	s4_67 = s4;
	if (a5_36 != null)
	{
		word32 tp_285;
		word32 t5_283;
		word32 t6_284;
		word32 t0_280;
		word32 t4_282;
		word32 t1_281;
		word32 s6_279;
		word32 a7_277;
		word32 s5_278;
		a5_36();
	}
	Eq_2 s0_120 = a5_36->t002C;
	if (a5_36 != null)
	{
		word32 tp_294;
		word32 t6_293;
		word32 t5_292;
		word32 t4_291;
		word32 t1_290;
		word32 t0_289;
		word32 s6_288;
		word32 s5_287;
		word32 a7_286;
		a5_36();
	}
	ui32 a5_109 = (char *) s1_108 + 0x0F;
	Eq_2 a5_110 = a5_109 & 0x00FF;
	Eq_2 a4_111 = 0x02;
	if ((a5_109 & 0x00FF) <= 0x02)
	{
		a4_111.u0 = 588003268;
		a5_110 = ((a5_109 & 0x00FF) << 2) + 588003268;
	}
	Eq_2 s4_121 = (word32) s0_120 + 16;
	if (sys_mbox_valid(s4_121) != 0x00)
	{
		word32 s5_565;
		word32 s6_566;
		word32 a0_559;
		word32 a1_560;
		word32 a3_561;
		word32 a7_562;
		word32 s3_563;
		word32 s4_564;
		s0_120 = sys_mbox_trypost(s4_121, a4_111, a5_110, mstatus, s4, s3, dwArgD8, dwArg0118, dwArg0158, out s1_108, out a0_559, out a1_560, out a3_561, out a4_111, out a5_110, out a7_562, out s2_144, out s3_563, out s4_564, out s5_565, out s6_566);
	}
	Eq_2 s4_158 = (word32) s0_120 + 20;
	if (sys_mbox_valid(s4_158) != 0x00)
	{
		word32 s3_573;
		word32 s4_574;
		word32 s5_575;
		word32 s6_576;
		word32 a0_567;
		word32 a1_568;
		word32 a3_569;
		word32 a4_570;
		word32 a5_571;
		word32 a7_572;
		s0_120 = sys_mbox_trypost(s4_158, a4_111, a5_110, mstatus, s4, s3, dwArgD8, dwArg0118, dwArg0158, out s1_108, out a0_567, out a1_568, out a3_569, out a4_570, out a5_571, out a7_572, out s2_144, out s3_573, out s4_574, out s5_575, out s6_576);
	}
	if (s2_144 != 0x01 && (s2_144 + -3 & 0x00FF) > 0x01)
		return;
	ui32 a5_203 = (word32) *((word32) s0_120 + 36);
	*((word32) s0_120 + 36) = (byte) (a5_203 & -5);
	if ((a5_203 & 0x04) != 0x00)
		return;
	if (s2_144 == 0x04)
		s1_108 = null;
	(a5_203 & 0x04)->b0004 = (byte) s1_108;
	struct Eq_425470 * s0_229 = (a5_203 & 0x04)->ptr0028;
	Eq_2 a5_230 = *s1_108;
	Eq_2 s1_231 = (char *) s1_108 + 0x0C;
	sys_sem_valid(s1_231);
	s0_229->dw0028 = 0x00;
	word32 s6_584;
	word32 s8_585;
	word32 s3_581;
	word32 s4_582;
	word32 s5_583;
	word32 s1_577;
	word32 a1_578;
	word32 a3_579;
	word32 s2_580;
	sys_sem_signal(s1_231, 0x04, a5_230, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_577, out a1_578, out a3_579, out s2_580, out s3_581, out s4_582, out s5_583, out s6_584, out s8_585);
}

// 23075CD8: Register Eq_2 lwip_netconn_do_writemore(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 (ptr32 Eq_425660)) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack word32 dwArg0128, Register out (ptr32 Eq_425528) s0Out, Register out ptr32 s1Out, Register out Eq_2 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      poll_tcp
//      sent_tcp
//      lwip_netconn_do_write
Eq_2 lwip_netconn_do_writemore(Eq_2 ra, Eq_2 s1, struct Eq_425660 ** a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, word32 dwArg0128, struct Eq_425528 & s0Out, ptr32 & s1Out, union Eq_2 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a4_170;
	Eq_2 a5_169;
	ptr32 s6_394;
	ptr32 s3_401;
	ptr32 s5_393;
	ptr32 s1_390;
	ui32 s3_160 = (word32) *((word32) a5 + 28);
	struct Eq_425549 * sp_277 = fp + -48;
	ui32 s4_146 = (word32) *((word32) *((word32) a5 + 40) + 36) & 2 | s3_160 & 4;
	Eq_2 a0_138 = (s3_160 & 4)->t001C;
	if ((s3_160 & 4) != 0x00)
	{
		a0_138 = sys_now(out a5_169) - a5_169;
		if (a0_138 >= a5_169)
		{
			a4_170 = *((word32) a5_169 + 24);
			goto l23075D1C;
		}
	}
	struct Eq_425645 * s5_147 = (struct Eq_425645 *) 0x10000000;
	s7.u0 = 0x0FFFFFFF;
	up32 s8_148 = 0x01;
	do
	{
		Eq_2 s2_100;
		struct Eq_425651 * a4_49 = *((word32) a3 + 16);
		word32 a1_53 = a1 + a3;
		struct Eq_425645 * a5_54 = *((char *) *a1 + 4) - a3;
		if (a5_54 >= s5_147)
		{
			s3_160 |= 2;
			s2_100 = s7;
		}
		else
			s2_100 = (word32) (word16) a5_54;
		Eq_2 a3_66 = (word32) *((word32) a0_138 + 100);
		if (a3_66 < s2_100)
		{
			if (s4_146 != 0x00)
			{
				if (a3_66 == 0x00)
				{
					a4_170 = a5_54->t0018;
					s1.u0 = ~0x06;
					if (a5_54 != null)
						s1.u0 = 0x00;
					goto l23075D72;
				}
			}
			else
				s3_160 |= 2;
			s2_100 = a3_66;
			goto l23075DD0;
		}
		if (s2_100 == s7 && a5_54 >= s5_147)
		{
l23075DE2:
			s3_160 |= 2;
			goto l23075DE8;
		}
l23075DD0:
		if ((word32) (word16) a5_54 == s2_100 && s8_148 < (word32) a4_49->w000C)
			goto l23075DE2;
l23075DE8:
		struct Eq_425927 * a5_154;
		ra = tcp_write(ra, s1, a0_138, a1_53, s2_100, s3_160, mstatus, s8, dwLoc17, dwArg28, dwArg48, s7, s5, dwArg68, dwArg88, dwArg98, dwArgC8, out a0_138, out a1, out a2, out a3, out a5_154, out s2_100, out s3_160, out s4_146, out s5_147, out s6, out s7, out s8_148, out mstatus);
		s1 = a0_138;
		if (a0_138 != 0x00)
		{
			a5_169 = a0_138 + 1 & 0x00FF;
			a4_170.u0 = 0x01;
			if (a5_169 > 0x01)
				goto l23075D22;
			s1.u0 = ~0x00;
			break;
		}
		word32 a5_174 = a5_154 + s2_100;
		a5_174->dw0018 = a5_154->dw0018;
		struct Eq_425955 * a4_177 = a5_174->ptr0010;
		s2_100 += a5_174;
		a4_177->t0010 = s2_100;
		struct Eq_425651 * a5_182 = *((word32) a3 + 16);
		a4_170 = a4_177->t0004;
		if (a3 == a4_170)
		{
			a5_182->w000C = (word16) ((word32) a5_182->w000C + ~0x00);
			a4_170 = (word32) a5_182->w000C;
			if (a4_170 != 0x00)
			{
				struct Eq_425987 * a5_189 = *((word32) a4_170 + 8);
				*((word32) a4_170 + 16) = a5_189;
				a5_189->dw0010 = 0x00;
				a4_170 = (word32) a4_170 + 8;
			}
		}
	} while (s6 != 0x00);
	if (s4_146 != 0x00)
	{
l23075D72:
		Eq_2 a5_211 = *((word32) *((word32) a4_170 + 24) + 20);
		if (a4_170 < a5_211)
		{
			Eq_2 s0_307 = *((word32) a5_211 + 44);
			if (a5_211 != 0x00)
			{
				word32 a3_329;
				word32 s9_333;
				word32 s10_336;
				word32 s11_337;
				a5_211();
			}
			*((word32) s0_307 + 36) = (byte) ((word32) *((word32) s0_307 + 36) | 16);
			goto l23075D94;
		}
	}
	struct Eq_425892 * a5_216 = (struct Eq_425892 *) 0x00FFFAC0;
	if ((word32) *((word32) a4_170 + 100) > 0x00FFFAC0)
	{
		a4_170 = (word32) *((word32) a4_170 + 0x0066);
		a5_216 = (struct Eq_425892 *) 0x07;
		if (a4_170 <= 0x07)
			goto l23075D94;
	}
	word32 s0_222 = a5_216->dw002C;
	if (a5_216 != null)
	{
		word32 a3_295;
		word32 s9_299;
		word32 s10_302;
		word32 s11_303;
		a5_216();
	}
l23075D94:
	if (s1 == 0x00)
	{
		Eq_2 s1_416 = 0x01;
		if (a4_170 != *((word32) (*((word32) a4_170 + 24)) + 20))
			s1_416 = (word32) (s4_146 != 0x00);
		word32 s2_957;
		word32 s4_958;
		word32 s9_960;
		word32 s11_962;
		word32 s10_961;
		word32 s8_959;
		word32 a5_956;
		word32 s0_952;
		word32 a2_954;
		word32 a3_955;
		word32 a1_953;
		ra = tcp_output(ra, s1_416, a0_138, a2, s7, mstatus, sp_277->t0058, sp_277->t0068, sp_277->t0088, sp_277->t0094, sp_277->t0098, sp_277->t00A8, sp_277->t00B8, sp_277->t00C8, sp_277->t00CC, sp_277->t00D8, sp_277->t00E8, sp_277->t0108, sp_277->t010C, sp_277->t0118, out s0_952, out s1_390, out a0_138, out a1_953, out a2_954, out a3_955, out a4_170, out a5_956, out s2_957, out s3_401, out s4_958, out s5_393, out s6_394, out s7, out s8_959, out s9_960, out s10_961, out s11_962, out mstatus);
		a5_169.u0 = ~0x03;
		if (a0_138 == ~0x03)
			goto l23075DB2;
		if (s1_390 != 0x00)
		{
l23075D20:
			s1.u0 = 0x00;
			goto l23075D22;
		}
	}
	else
	{
		a5_169.u0 = ~0x00;
		if (s1 != ~0x00)
		{
l23075D22:
			struct Eq_425586 * s0_475 = *((word32) a5_169 + 40);
			Eq_2 a5_480 = *a0_138;
			*((word32) a5_480 + 4) = (byte) s1;
			s0_475->dw0028 = 0x00;
			s0_475->b0001 = 0x00;
			word32 a1_947;
			word32 s2_949;
			word32 s4_950;
			word32 s8_951;
			word32 a3_948;
			sys_sem_signal((word32) a0_138 + 0x0C, a4_170, a5_480, mstatus, sp_277->t0008, sp_277->t0024, sp_277->t00A4, sp_277->t0118, sp_277->t0158, sp_277->t0198, out s1_390, out a1_947, out a3_948, out s2_949, out s3_401, out s4_950, out s5_393, out s6_394, out s8_951);
			goto l23075E92;
		}
		word32 s4_392;
		word32 s0_963;
		word32 a3_966;
		word32 a5_967;
		word32 s8_969;
		word32 s9_970;
		word32 s10_971;
		word32 s11_972;
		word32 s2_968;
		word32 a2_965;
		word32 a1_964;
		ra = tcp_output(ra, s1, a0_138, a2, s7, mstatus, sp_277->t0058, sp_277->t0068, sp_277->t0088, sp_277->t0094, sp_277->t0098, sp_277->t00A8, sp_277->t00B8, sp_277->t00C8, sp_277->t00CC, sp_277->t00D8, sp_277->t00E8, sp_277->t0108, sp_277->t010C, sp_277->t0118, out s0_963, out s1_390, out a0_138, out a1_964, out a2_965, out a3_966, out a4_170, out a5_967, out s2_968, out s3_401, out s4_392, out s5_393, out s6_394, out s7, out s8_969, out s9_970, out s10_971, out s11_972, out mstatus);
		a5_169.u0 = ~0x03;
		if (a0_138 == ~0x03)
		{
l23075DB2:
			a5_169.u0 = ~0x03;
			s1.u0 = ~0x03;
			goto l23075D22;
		}
		if (s4_392 != 0x00)
		{
			a5_169 = *(union Eq_2 *) 0x14;
l23075D1C:
			s1.u0 = ~0x06;
			if (a5_169 == 0x00)
				goto l23075D22;
			goto l23075D20;
		}
	}
l23075E92:
	0x00 = dwArg0128;
	s0Out = s4;
	s1Out = s1_390;
	a5Out = a5_169;
	s3Out = s3_401;
	s4Out = dwArg78;
	s5Out = s5_393;
	s6Out = s6_394;
	s7Out = s7;
	s8Out = s5;
	mstatusOut = mstatus;
	return ra;
}

