pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23075EAC: Register Eq_2 lwip_netconn_do_close_internal(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_426054) a5Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_426057 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      poll_tcp
//      sent_tcp
//      lwip_netconn_do_delconn
//      lwip_netconn_do_close
Eq_2 lwip_netconn_do_close_internal(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_426054 & a5Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_426057 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s4_33;
	struct Eq_426063 * sp_296 = fp + ~0x1F;
	ui32 a5_24 = (word32) *((word32) a5 + 8);
	if (a5_24 != 0x03)
	{
		if ((a5_24 & 1) != 0x00)
		{
			word32 a4_28 = (word32) *((word32) s0 + 20);
			a3.u0 = 0x01;
			if ((a4_28 + -5 & 0x00FF) <= 0x01 || a4_28 == 0x08)
				goto l23075F00;
		}
		s4_33.u0 = 0x00;
		if ((a5_24 & 2) == 0x00 || ((word32) (*((word32) s0 + 26)) & 0x10) == 0x00)
			goto l23075F0A;
	}
l23075F00:
	tcp_arg(s0, 0x00);
	s4_33.u0 = 0x01;
l23075F0A:
	struct Eq_426054 * a5_125;
	ptr32 mstatus_128;
	Eq_2 ra_129;
	Eq_2 s3_134;
	Eq_426057 s5_136;
	ptr32 s6_137;
	Eq_2 s7_138;
	Eq_2 a4_124;
	Eq_2 a3_123;
	Eq_2 s4_135;
	struct Eq_426119 * s1_130;
	word32 a0_120;
	if ((word32) *((word32) s0 + 20) == 0x01)
	{
		tcp_accept(s0, null);
		if (s4_33 == 0x00)
			goto l23075F20;
	}
	else
	{
		if ((a5_24 & 1) != 0x00)
		{
			tcp_recv(s0, 0x00);
			tcp_accept(s0, null);
		}
		if ((a5_24 & 2) != 0x00)
			tcp_sent(s0, 0x00);
		if (s4_33 == 0x00)
		{
l23075F20:
			ra_129 = tcp_shutdown(ra, s0, a5_24 & 1, a5_24 & 2, s4_33, s7, mstatus, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s1_130, out a0_120, out a3_123, out a4_124, out a5_125, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out mstatus_128);
			goto l23075F68;
		}
		tcp_poll(s0, 0x00, 0x00);
		tcp_err(s0, 0x00);
		a2.u0 = 0x00;
	}
	word32 a1_986;
	word32 s8_988;
	word32 s10_990;
	word32 s2_987;
	word32 s9_989;
	word32 s11_991;
	ra_129 = tcp_close(ra, s0, a2, a3, s4_33, s7, mstatus, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s1_130, out a0_120, out a1_986, out a3_123, out a4_124, out a5_125, out s2_987, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out s8_988, out s9_989, out s10_990, out s11_991, out mstatus_128);
l23075F68:
	Eq_2 s1_202;
	word32 s2_192 = a0_120;
	if (a0_120 != 0x00)
	{
		a5_125 = (struct Eq_426054 *) ~0x00;
		if (a0_120 == ~0x00)
		{
			s5_136 = s1_130->t001C;
			if (s5_136 <= 0x00)
				s5_136.u0 = 0x01000388;
			struct Eq_426164 * a5_200;
			Eq_387863 a0_199 = sys_now(out a5_200);
			a5_125 = a5_200->ptr000C;
			s1_202 = a5_200->t0028;
			if (a0_199 - a5_125 < s5_136)
			{
				if (s3_134 != 0x00)
					tcp_sent(s0, 587686200);
				tcp_poll(s0, 0x2307603C, 0x01);
				tcp_err(s0, 587684818);
				tcp_arg(s0, s1_202);
l23075FEC:
				0x00 = (int8) dwArgA8;
				s0Out = s1;
				s1Out = s1_202;
				a5Out = a5_125;
				s3Out = s3_134;
				s4Out = dwArg04;
				s5Out = s5_136;
				s6Out = s6_137;
				s7Out = s7_138;
				s8Out = s4;
				mstatusOut = mstatus_128;
				return ra_129;
			}
			if (s4_135 != 0x00)
			{
				word32 s1_974;
				word32 a0_975;
				word32 s9_978;
				word32 s2_977;
				word32 a1_976;
				word32 s11_980;
				word32 s10_979;
				ra_129 = tcp_abort(ra_129, s1_202, s0, a3_123, s3_134, s4_135, s7_138, mstatus_128, s6, s4, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s0, out s1_974, out a0_975, out a1_976, out a3_123, out a4_124, out a5_125, out s2_977, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out s9_978, out s10_979, out s11_980, out mstatus_128);
				s2_192 = 0x00;
			}
		}
	}
	struct Eq_426206 * s1_270 = a5_125->ptr0028;
	Eq_2 a5_272 = *s0;
	*((word32) a5_272 + 4) = (byte) s2_192;
	s1_270->dw0028 = 0x00;
	s1_270->b0001 = 0x00;
	Eq_2 s0_278 = (word32) s0 + 0x0C;
	if (s2_192 == 0x00)
	{
		if (s4_135 != 0x00)
		{
			Eq_2 s1_280 = *((word32) a5_272 + 44);
			*((word32) s1_280 + 4) = 0x00;
			if (a5_272 != 0x00)
				a5_272();
		}
		if (s6_137 != 0x00)
		{
			Eq_2 s1_329 = *((word32) a5_272 + 44);
			if (a5_272 != 0x00)
				a5_272();
		}
		if (s3_134 != 0x00)
		{
			Eq_2 s1_376 = *((word32) a5_272 + 44);
			if (a5_272 != 0x00)
				a5_272();
		}
	}
	word32 a1_981;
	word32 s2_983;
	word32 s8_985;
	word32 s4_984;
	word32 a3_982;
	sys_sem_signal(s0_278, a4_124, a5_272, mstatus_128, sp_296->t0008, sp_296->t0024, sp_296->t00A4, sp_296->t0118, sp_296->t0158, sp_296->t0198, out s1_202, out a1_981, out a3_982, out s2_983, out s3_134, out s4_984, out s5_136, out s6_137, out s8_985);
	goto l23075FEC;
}

// 2307603C: void poll_tcp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 (ptr32 Eq_425660)) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0118)
void poll_tcp(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_425660 ** a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0118)
{
	Eq_2 a5_9 = (word32) *((word32) a0 + 1);
	Eq_2 s0_11 = a0;
	if (a5_9 == 0x01)
	{
		word32 a5_255;
		ra = lwip_netconn_do_writemore(ra, s1, a1, a2, a3, a5_9, s5, s6, s7, s8, mstatus, dwArg18, dwArg38, dwArg58, dwArg78, dwArg88, dwArgB8, dwArg0118, out s0_11, out s1, out a5_255, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	else if (a5_9 == 0x04)
	{
		word32 a5_256;
		ra = lwip_netconn_do_close_internal(ra, a0, s1, a2, a3, a5_9, s3, s4, s6, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArgF8, out s0_11, out s1, out a5_256, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	ui32 a5_84 = (word32) *((word32) s0_11 + 36);
	if ((a5_84 & 16) != 0x00)
	{
		struct Eq_426420 * s0_86 = (a5_84 & 16)->ptr0004;
		if ((a5_84 & 16) != 0x00 && (word32) (a5_84 & 16)->w0064 > 0x00FFFAC0)
		{
			up32 a3_90 = (word32) (a5_84 & 16)->w0066;
			if (a3_90 <= 0x07)
			{
				s0_86->b0024 = (byte) (a5_84 & ~0x10);
				word32 s0_94 = (a5_84 & ~0x10)->dw002C;
				if ((a5_84 & ~0x10) != 0x00)
				{
					word32 a6_123;
					word32 a7_124;
					word32 s10_125;
					word32 s11_126;
					word32 s2_127;
					word32 s9_130;
					word32 t0_131;
					word32 t1_132;
					word32 t3_133;
					word32 t4_134;
					word32 t5_135;
					word32 t6_136;
					word32 tp_137;
					(a5_84 & ~0x10)();
				}
			}
		}
	}
}

// 230760A0: void recv_raw(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148)
void recv_raw(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 == 0x00)
		return;
	if (sys_mbox_valid(a0 + 16) != 0x00)
	{
		Eq_2 a3_34;
		Eq_2 a4_35;
		ptr32 mstatus_39;
		Eq_2 s1_41;
		struct Eq_426529 * s3_43;
		Eq_2 s4_44;
		Eq_2 a0_55;
		word32 s2_263;
		word32 s5_264;
		word32 s6_265;
		Eq_2 ra_40 = pbuf_clone(ra, s0, 0x00, 640, a2, a3, a4, mstatus, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s1_41, out a0_55, out a3_34, out a4_35, out s2_263, out s3_43, out s4_44, out s5_264, out s6_265, out mstatus_39);
		if (a0_55 != 0x00)
		{
			struct Eq_426552 * a0_58;
			Eq_2 a3_61;
			Eq_2 a4_62;
			word32 a2_266;
			word32 a5_267;
			memp_malloc(s1_41, 0x06, a3_34, a4_35, mstatus_39, out a0_58, out a2_266, out a3_61, out a4_62, out a5_267);
			if (a0_58 == null)
			{
				word32 s0_275;
				word32 s1_276;
				word32 a0_277;
				word32 a1_278;
				word32 a2_279;
				word32 a3_280;
				word32 a4_281;
				word32 a5_282;
				word32 a7_283;
				word32 s2_284;
				word32 s3_285;
				word32 s4_286;
				word32 s5_287;
				word32 s6_288;
				word32 s8_289;
				word32 mstatus_290;
				pbuf_free(ra_40, a0_55, a3_61, a4_62, s4_44, mstatus_39, dwArgF8, out s0_275, out s1_276, out a0_277, out a1_278, out a2_279, out a3_280, out a4_281, out a5_282, out a7_283, out s2_284, out s3_285, out s4_286, out s5_287, out s6_288, out s8_289, out mstatus_290);
			}
			else
			{
				a0_58->t0000 = a0_55;
				a0_58->t0004 = a0_55;
				*((word32) g_t42026928 + 8) = a0_58;
				Eq_2 a5_72 = (word32) s3_43->b0010;
				a0_58->w000C = (word16) a5_72;
				Eq_2 a2_74 = (word32) *((word32) a0_55 + 8);
				word32 a0_77;
				Eq_2 a3_80;
				Eq_2 a4_81;
				struct Eq_426595 * a5_82;
				Eq_2 s4_89;
				word32 s1_268;
				word32 a1_269;
				word32 a7_270;
				word32 s2_271;
				word32 s3_272;
				word32 s5_273;
				word32 s6_274;
				Eq_2 s0_85 = sys_mbox_trypost(s4_44, a4_62, a5_72, mstatus_39, dwLoc2C, a2_74, dwArgC8, dwArg0108, dwArg0148, out s1_268, out a0_77, out a1_269, out a3_80, out a4_81, out a5_82, out a7_270, out s2_271, out s3_272, out s4_89, out s5_273, out s6_274);
				if (a0_77 != 0x00)
				{
					word32 a2_291;
					word32 a3_292;
					word32 a4_293;
					word32 a5_294;
					netbuf_delete(ra_40, s0_85, a3_80, a4_81, s4_89, mstatus_39, dwArgD8, out a2_291, out a3_292, out a4_293, out a5_294);
				}
				else
				{
					word32 s1_101 = a5_82->dw002C;
					if (a5_82 != null)
						a5_82();
				}
			}
		}
	}
	0x00 = dwArg0128;
}

// 23076138: void sent_tcp(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 (ptr32 Eq_425660)) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0118)
void sent_tcp(Eq_2 ra, Eq_2 a0, struct Eq_425660 ** a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0118)
{
	if (a0 == 0x00)
		return;
	Eq_2 a5_12 = (word32) *((word32) a0 + 1);
	Eq_2 s1_16 = a2;
	if (a5_12 == 0x01)
	{
		word32 s0_293;
		ra = lwip_netconn_do_writemore(ra, a2, a1, a2, a3, a5_12, s5, s6, s7, s8, mstatus, dwArg18, dwArg38, dwArg58, dwArg78, dwArg88, dwArgB8, dwArg0118, out s0_293, out s1_16, out a5_12, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	else if (a5_12 == 0x04)
	{
		word32 s0_294;
		ra = lwip_netconn_do_close_internal(ra, a0, a2, a2, a3, a5_12, s3, s4, s6, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArgF8, out s0_294, out s1_16, out a5_12, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	struct Eq_426747 * s0_87 = *((word32) a5_12 + 4);
	if (a5_12 != 0x00)
	{
		up32 a3_88 = (word32) *((word32) a5_12 + 100);
		if (a3_88 > 0x00FFFAC0 && (word32) (*((word32) a5_12 + 0x0066)) <= 0x07)
		{
			ui32 a5_93 = (word32) s0_87->b0024;
			s0_87->b0024 = (byte) (a5_93 & ~0x10);
			word32 s0_96 = (a5_93 & ~0x10)->dw002C;
			if ((a5_93 & ~0x10) != 0x00)
			{
				word32 a5_115;
				word32 a4_116;
				word32 tp_120;
				word32 a6_126;
				word32 a7_127;
				word32 s10_128;
				word32 s11_129;
				word32 s2_130;
				word32 s9_133;
				word32 t0_134;
				word32 t1_135;
				word32 t3_136;
				word32 t4_137;
				word32 t5_138;
				word32 t6_139;
				(a5_93 & ~0x10)();
			}
		}
	}
}

// 230761A2: void recv_tcp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_426804) a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack Eq_2 dwArg0148)
void recv_tcp(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_426804 * a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 != 0x00)
	{
		if (sys_mbox_valid((word32) a0 + 16) == 0x00)
		{
			if (a2 != null)
			{
				Eq_2 a4_98;
				Eq_2 a3_101;
				ptr32 mstatus_104;
				Eq_2 s0_106;
				Eq_2 s4_112;
				word32 s7_282;
				word32 s3_281;
				word32 a5_280;
				word32 a0_279;
				word32 s1_278;
				word32 s9_283;
				word32 s10_284;
				word32 s11_285;
				word32 s0_286;
				word32 s1_287;
				word32 a0_288;
				word32 a1_289;
				word32 a2_290;
				word32 a3_291;
				word32 a4_292;
				word32 a5_293;
				word32 a7_294;
				word32 s2_295;
				word32 s3_296;
				word32 s4_297;
				word32 s5_298;
				word32 s6_299;
				word32 s8_300;
				word32 mstatus_301;
				pbuf_free(tcp_recved(ra, a0, a1, (word32) a2->w0008, s7, mstatus, s2, dwArg28, dwArg38, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, out s0_106, out s1_278, out a0_279, out a3_101, out a4_98, out a5_280, out s3_281, out s4_112, out s7_282, out s9_283, out s10_284, out s11_285, out mstatus_104), s0_106, a3_101, a4_98, s4_112, mstatus_104, dwArgF8, out s0_286, out s1_287, out a0_288, out a1_289, out a2_290, out a3_291, out a4_292, out a5_293, out a7_294, out s2_295, out s3_296, out s4_297, out s5_298, out s6_299, out s8_300, out mstatus_301);
			}
			goto l230761C6;
		}
		Eq_2 a2_26;
		if (a2 != null)
			a2_26 = (word32) a2->w0008;
		else
			a2_26.u0 = 0x00;
		word32 a0_41;
		word32 a4_45;
		struct Eq_426914 * a5_46;
		word32 s1_302;
		word32 a1_303;
		word32 a3_304;
		word32 a7_305;
		word32 s2_306;
		word32 s3_307;
		word32 s4_308;
		word32 s5_309;
		word32 s6_310;
		sys_mbox_trypost((word32) a0 + 16, a4, a5, mstatus, dwLoc2C, a2_26, dwArgC8, dwArg0108, dwArg0148, out s1_302, out a0_41, out a1_303, out a3_304, out a4_45, out a5_46, out a7_305, out s2_306, out s3_307, out s4_308, out s5_309, out s6_310);
		if (a0_41 == 0x00)
		{
			word32 s1_66 = a5_46->dw002C;
			if (a5_46 == null)
			{
l230761C6:
				goto l230761C8;
			}
			a5_46();
		}
	}
l230761C8:
	0x00 = dwArg0128;
}

// 2307621C: Register Eq_2 lwip_netconn_is_err_msg(Register Eq_2 a0, Register (ptr32 byte) a1, Register out Eq_424338 a4Out, Register out Eq_2 a5Out)
// Called from:
//      netconn_accept
//      netconn_recv_data
//      netconn_drain
Eq_2 lwip_netconn_is_err_msg(Eq_2 a0, byte * a1, union Eq_424338 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_10;
	word32 a5_11;
	if (a0 == 588036858)
		a5_11 = ~0x0C;
	else if (a0 == 588036860)
		a5_11 = ~0x0D;
	else
	{
		a4.u0 = 588036859;
		a5_10.u0 = 0x00;
		if (a0 != 588036859)
			goto l23076230;
		a5_11 = ~0x0E;
	}
	*a1 = (byte) a5_11;
	a5_10.u0 = 0x01;
l23076230:
	a4Out = a4;
	a5Out = a5_10;
	return a5_10;
}

