pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23076256: void lwip_netconn_do_newconn(Register Eq_2 ra, Register (ptr32 Eq_2) s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_newconn(Eq_2 ra, union Eq_2 * s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_10 = *s1;
	*((word32) a0_10 + 4) = 0x00;
	Eq_2 s0_101 = a0_10;
	Eq_2 s1_14 = *((word32) a5 + 4);
	if (a5 != 0x00)
	{
l230762C0:
		Eq_2 a0_130 = (word32) a0_10 + 0x0C;
		word32 s5_286;
		word32 s6_287;
		word32 s8_288;
		word32 a1_281;
		word32 s3_284;
		word32 s4_285;
		word32 a3_282;
		word32 s2_283;
		word32 s1_280;
		sys_sem_signal(a0_130, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_280, out a1_281, out a3_282, out s2_283, out s3_284, out s4_285, out s5_286, out s6_287, out s8_288);
		return;
	}
	struct Eq_427019 * a5_106;
	ui32 a5_15 = (word32) *s1_14;
	if ((a5_15 & 0x00F0) != 32)
	{
		if ((a5_15 & 0x00F0) != 64)
		{
			a4.u0 = 0x10;
			if ((a5_15 & 0x00F0) != 0x10)
			{
				a5.u0 = ~0x05;
				goto l23076304;
			}
			struct Eq_427083 * a0_71;
			word32 s1_82;
			word32 s7_276;
			word32 s8_277;
			word32 s9_278;
			word32 s4_274;
			word32 s6_275;
			word32 a1_270;
			word32 a3_271;
			word32 s2_272;
			word32 s3_273;
			tcp_new_ip_type(ra, s1_14, a1, a3, 0x10, s3, s4, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgF8, out s1_82, out a0_71, out a1_270, out a3_271, out a4, out a5_106, out s2_272, out s3_273, out s4_274, out s6_275, out s7_276, out s8_277, out s9_278, out mstatus);
			a0_71->dw0004 = s1_82;
			s0_101 = a0_71->t0000;
			a0_10 = a5_106->t0004;
			if (a5_106 == null)
			{
l2307630A:
				a5.u0 = ~0x00;
l23076304:
				*((word32) s0_101 + 4) = (byte) a5;
				goto l230762C0;
			}
			word32 a1_279;
			a0_10 = setup_tcp(s0_101, out a1_279);
		}
		else
		{
			union Eq_2 * a2_50;
			*((byte) a0_10.u0 + 4) = raw_new_ip_type(ra, (word32) *((byte) a0_10.u0 + 8), a3, 64, mstatus, out a0_10, out a2_50, out a4, out a5_106);
			s0_101 = *a2_50;
			Eq_404910 a2_61 = *((byte) a0_10.u0 + 4);
			if (a0_10 == 0x00)
				goto l2307630A;
			raw_recv(a0_10, &g_t230760A0, a2_61);
		}
	}
	else
	{
		union Eq_2 * a4_24;
		Eq_2 s1_27;
		word32 a3_269;
		udp_new_ip_type(ra, s1_14, a3, 32, mstatus, out s1_27, out a3_269, out a4_24, out a5_106);
		*(union Eq_2 *) 4 = s1_27;
		a0_10.u0 = 0x00;
		s0_101 = *a4_24;
		a4 = a5_106->t0004;
		if (a5_106 == null)
			goto l2307630A;
		a4.u0 = 0x0022;
		if ((word32) *a4.u0 == 0x0022)
		{
			a5_106->b0010 = 0x01;
			a4.u0 = 0x01;
		}
		udp_recv(0x00, &g_t23075A5E, *(union Eq_2 *) 0x04);
	}
	s0_101 = a5_106->t0000;
	a5 = a5_106->t0004;
	if (a5 != 0x00)
		goto l230762C0;
	goto l2307630A;
}

// 2307630E: Register Eq_2 netconn_alloc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out)
// Called from:
//      netconn_new_with_proto_and_callback
//      accept_function
Eq_2 netconn_alloc(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, word32 dwArg38, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out)
{
	Eq_2 s2_16 = a1;
	Eq_2 a0_20;
	word32 a2_199;
	Eq_2 a4_110;
	ptr32 a5_112;
	Eq_2 a3_111;
	Eq_2 s1_25 = memp_malloc(a0, 0x07, a3, a4, mstatus, out a0_20, out a2_199, out a3_111, out a4_110, out a5_112);
	Eq_2 s0_119 = a0_20;
	if (a0_20 == 0x00)
	{
l230763A2:
		0x00 = dwArg38;
		a2Out = dwArg10;
		a3Out = a3_111;
		a4Out = a4_110;
		a5Out = a5_112;
		s2Out = s2_16;
		s3Out = s3;
		return s0_119;
	}
	*((word32) a0_20 + 8) = 0x00;
	*a0_20 = (byte) s1_25;
	*((word32) a0_20 + 4) = 0x00;
	Eq_2 a5_31 = 32;
	if ((s1_25 & 0x00F0) != 32)
	{
		a5_31.u0 = 64;
		if ((s1_25 & 0x00F0) == 64)
		{
l23076350:
			word32 a0_55;
			Eq_2 a5_60;
			word32 a2_208;
			word32 s4_209;
			sys_mbox_new(ra, a3_111, a4_110, a5_31, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a0_55, out a2_208, out a3_111, out a4_110, out a5_60, out s2_16, out s3, out s4_209);
			if (a0_55 != 0x00)
			{
l2307636E:
				word32 a0_200;
				word32 a2_201;
				memp_free(0x07, a0_20, a3_111, a4_110, mstatus, out a0_200, out a2_201, out a3_111, out a4_110, out a5_112);
				s0_119.u0 = 0x00;
				goto l230763A2;
			}
			word32 a0_71;
			word32 a2_202;
			word32 a5_203;
			Eq_2 s1_78 = sys_sem_new(ra, a3_111, a4_110, a5_60, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_71, out a2_202, out a3_111, out a4_110, out a5_203, out s2_16, out s3);
			if (a0_71 != 0x00)
			{
				word32 a0_204;
				word32 a2_205;
				word32 a5_206;
				word32 s4_207;
				sys_mbox_free(s1_78, a3_111, a4_110, mstatus, dwArg0138, dwArg0178, out a0_204, out a2_205, out a3_111, out a4_110, out a5_206, out s4_207);
				goto l2307636E;
			}
			sys_mbox_set_invalid((word32) a0_20 + 20);
			*((word32) a0_20 + 1) = 0x00;
			*(union Eq_2 *) 0x17 = a0_20;
			*((word32) a0_20 + 44) = s2_16;
			*((word32) a0_20 + 40) = 0x00;
			*((word32) a0_20 + 28) = 0x00;
			*((word32) a0_20 + 32) = 0x00;
			((word32) a0_20 + 36)->u0 = 0x00;
			a5_112 = ~0x00;
			goto l230763A2;
		}
		a5_31.u0 = 0x10;
		if ((s1_25 & 0x00F0) != 0x10)
			goto l2307636E;
	}
	goto l23076350;
}

// 230763B0: Register Eq_2 netconn_free(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      netconn_delete
//      netconn_drain
//      accept_function
Eq_2 netconn_free(Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	sys_mbox_valid((word32) a0 + 16);
	sys_mbox_valid((word32) a0 + 20);
	Eq_2 a3_23;
	Eq_2 a4_24;
	word32 * s1_28;
	ptr32 s4_29;
	word32 a5_57;
	Eq_2 s0_27 = sys_sem_free((word32) a0 + 0x0C, a3, mstatus, dwArg0148, dwArg0188, out s1_28, out a3_23, out a4_24, out a5_57, out s4_29);
	sys_sem_set_invalid(s1_28);
	ptr32 a5_39;
	ptr32 a3_42;
	ptr32 a4_43;
	word32 a0_58;
	word32 a2_59;
	Eq_2 s1_44 = memp_free(0x07, s0_27, a3_23, a4_24, mstatus, out a0_58, out a2_59, out a3_42, out a4_43, out a5_39);
	a3Out = a3_42;
	a4Out = a4_43;
	a5Out = a5_39;
	s4Out = s4_29;
	return s1_44;
}

