pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 230763E8: Register Eq_2 netconn_drain(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_427391 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netconn_drain
//      lwip_netconn_do_delconn
//      lwip_netconn_do_close
Eq_2 netconn_drain(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_427391 & s3Out, ptr32 & s4Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_101 = (word32) a0 + 16;
	Eq_2 s0_10 = a0;
	if (sys_mbox_valid((word32) a0 + 16) != 0x00)
	{
		while (true)
		{
			Eq_2 a0_30;
			Eq_2 a4_34;
			Eq_2 s2_40;
			Eq_2 s4_42;
			word32 a1_516;
			s0_10 = sys_arch_mbox_tryfetch(s1_101, fp + -36, a3, a4, a5, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, out s1_101, out a0_30, out a1_516, out a3, out a4_34, out s2_40, out s3, out s4_42);
			if (a0_30 == s2_40)
				break;
			if (((word32) *s0_10 & 0x00F0) == s3)
			{
				Eq_2 a0_64 = lwip_netconn_is_err_msg(a0_30, fp + -37, out a4, out a5);
				if (a0_64 == 0x00)
				{
					word32 s8_526;
					word32 s2_522;
					word32 a0_518;
					word32 s4_524;
					word32 s5_525;
					word32 s3_523;
					word32 a2_520;
					word32 a7_521;
					word32 a1_519;
					word32 s0_517;
					ra = pbuf_free(ra, a0_64, a3, a4, s4_42, mstatus, dwArgF8, out s0_517, out s1_101, out a0_518, out a1_519, out a2_520, out a3, out a4, out a5, out a7_521, out s2_522, out s3_523, out s4_524, out s5_525, out s6, out s8_526, out mstatus);
				}
			}
			else
			{
				word32 a2_515;
				s1_101 = netbuf_delete(ra, a0_30, a3, a4_34, s4_42, mstatus, dwArgD8, out a2_515, out a3, out a4, out a5);
			}
		}
		word32 a2_510;
		word32 a0_509;
		s1_101 = sys_mbox_free(s1_101, a3, a4_34, mstatus, dwArg0118, dwArg0158, out a0_509, out a2_510, out a3, out a4, out a5, out s4);
		sys_mbox_set_invalid(s1_101);
	}
	Eq_2 s0_107 = (word32) s0_10 + 20;
	Eq_2 a0_109 = sys_mbox_valid(s0_107);
	if (a0_109 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_120;
			Eq_2 a4_124;
			Eq_2 s1_129;
			Eq_2 s2_130;
			word32 s4_512;
			word32 a1_511;
			s0_107 = sys_arch_mbox_tryfetch(s0_107, fp + -36, a3, a4, a5, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, out s1_129, out a0_120, out a1_511, out a3, out a4_124, out s2_130, out s3, out s4_512);
			if (a0_120 == s2_130)
				break;
			if (lwip_netconn_is_err_msg(a0_120, fp + -37, out a4, out a5) == 0x00)
			{
				Eq_2 a3_180;
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg8 = <invalid>;
				Eq_2 stackArg24 = <invalid>;
				Eq_2 stackArg40 = <invalid>;
				Eq_2 stackArg72 = <invalid>;
				Eq_2 stackArg84 = <invalid>;
				Eq_2 stackArg88 = <invalid>;
				Eq_2 stackArg104 = <invalid>;
				Eq_2 stackArg108 = <invalid>;
				Eq_2 stackArg120 = <invalid>;
				Eq_2 stackArg136 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				Eq_2 stackArg172 = <invalid>;
				Eq_2 stackArg184 = <invalid>;
				Eq_2 stackArg200 = <invalid>;
				Eq_2 stackArg216 = <invalid>;
				Eq_2 a0_151;
				Eq_2 s3_155;
				Eq_2 a5_160;
				ptr32 mstatus_161;
				Eq_2 a4_162;
				Eq_2 a3_163;
				Eq_2 s4_166;
				word32 s1_542;
				word32 s7_543;
				ra = netconn_drain(ra, s1_129, a3_163, a4_162, a5_160, s7, mstatus_161, stackArg8, stackArg24, stackArg40, dwArg14, stackArg72, stackArg84, stackArg88, stackArg104, stackArg108, stackArg120, stackArg136, stackArg168, stackArg172, stackArg184, stackArg200, stackArg216, dwArgC8, dwArgD8, dwArg0118, dwArgF8, dwArg0158, out s0_107, out s1_542, out a0_151, out a3_163, out a4_162, out a5_160, out s3_155, out s4_166, out s6, out s7_543, out mstatus_161);
				Eq_2 s1_175 = *((word32) a0_151 + 4);
				mstatus = mstatus_161;
				a3_180 = a3_163;
				if (a0_151 != 0x00)
				{
					word32 s10_554;
					word32 s3_550;
					word32 a1_546;
					word32 s11_555;
					word32 s5_552;
					word32 s9_553;
					word32 s4_551;
					word32 a5_548;
					word32 s2_549;
					word32 a4_547;
					word32 a0_545;
					ra = tcp_abort(ra, s1_175, a0_151, a3_163, s3_155, s4_166, s7, mstatus_161, dwLoc30, dwLoc2C, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArgA8, dwArgAC, dwArgB8, dwArgD8, out s0_107, out s1_175, out a0_545, out a1_546, out a3_180, out a4_547, out a5_548, out s2_549, out s3_550, out s4_551, out s5_552, out s6, out s7, out s9_553, out s10_554, out s11_555, out mstatus);
					*((word32) s1_175 + 4) = 0x00;
				}
				word32 s4_544;
				netconn_free(s1_175, a3_180, mstatus, dwArg0118, dwArg0158, out a3, out a4, out a5, out s4_544);
			}
		}
		word32 a2_514;
		word32 a0_513;
		s1_101 = sys_mbox_free(s0_107, a3, a4_124, mstatus, dwArg0118, dwArg0158, out a0_513, out a2_514, out a3, out a4, out a5, out s4);
		sys_mbox_set_invalid(s0_107);
		a0_109 = s0_107;
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_101;
	a0Out = a0_109;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 2307649C: void accept_function(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_427631) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack word32 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void accept_function(Eq_2 ra, word32 a0, struct Eq_427631 * a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, word32 dwArg18, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	if (a0 == 0x00 || sys_mbox_valid(a0 + 20) == 0x00)
		return;
	if (a1 != null)
	{
		Eq_2 a3_117;
		Eq_2 a4_118;
		word32 s3_125;
		word32 s2_137;
		word32 s1_123;
		struct Eq_427658 * a5_119;
		Eq_2 s0_21 = a1->t002C;
		Eq_2 a4_28;
		Eq_2 a5_29;
		Eq_2 s2_31;
		word32 s3_36;
		word32 a2_339;
		word32 a3_340;
		Eq_2 a0_33 = netconn_alloc(ra, (word32) *s0_21, a3, a4, mstatus, dwLoc20, dwLoc1C, dwArg18, s3, dwArgD8, dwArg0118, dwArg0158, out a2_339, out a3_340, out a4_28, out a5_29, out s2_31, out s3_36);
		if (a0_33 == 0x00)
		{
			word32 a0_114;
			word32 a1_357;
			word32 a7_358;
			word32 s2_359;
			word32 s4_360;
			word32 s5_361;
			word32 s6_362;
			sys_mbox_trypost(s2_31, a4_28, a5_29, mstatus, dwLoc1C, s3, dwArgD8, dwArg0118, dwArg0158, out s1_123, out a0_114, out a1_357, out a3_117, out a4_118, out a5_119, out a7_358, out s2_359, out s3_125, out s4_360, out s5_361, out s6_362);
			s2_137 = ~0x00;
			if (a0_114 != 0x00)
				return;
		}
		else
		{
			*((word32) a0_33 + 4) = s3_36;
			word32 a1_350;
			setup_tcp(s0_21, out a1_350);
			word32 a0_47;
			word32 a7_352;
			word32 a1_351;
			word32 s2_353;
			word32 s4_354;
			word32 s5_355;
			word32 s6_356;
			Eq_2 s0_55 = sys_mbox_trypost(s2_31, a4_28, a5_29, mstatus, dwLoc1C, s3, dwArgD8, dwArg0118, dwArg0158, out s1_123, out a0_47, out a1_351, out a3_117, out a4_118, out a5_119, out a7_352, out s2_353, out s3_125, out s4_354, out s5_355, out s6_356);
			s2_137 = a0_47;
			if (a0_47 != 0x00)
			{
				struct Eq_427792 * s1_71 = *((word32) s0_55 + 4);
				tcp_arg(s0_55, 0x00);
				tcp_recv(s0_55, 0x00);
				tcp_sent(s0_55, 0x00);
				tcp_poll(s0_55, 0x00, 0x00);
				tcp_err(s0_55, 0x00);
				s1_71->dw0004 = 0x00;
				Eq_2 a3_90;
				word32 a0_363;
				word32 a2_364;
				word32 a4_365;
				word32 a5_366;
				word32 s4_367;
				Eq_2 s1_94 = sys_mbox_free(&s1_71->dw0004 + 3, a3_117, a4_118, mstatus, dwArg0128, dwArg0168, out a0_363, out a2_364, out a3_90, out a4_365, out a5_366, out s4_367);
				sys_mbox_set_invalid(&s1_71->dw0004 + 3);
				word32 a3_368;
				word32 a4_369;
				word32 a5_370;
				word32 s4_371;
				netconn_free(s1_94, a3_90, mstatus, dwArg0128, dwArg0168, out a3_368, out a4_369, out a5_370, out s4_371);
				return;
			}
		}
		word32 s0_140 = a5_119->dw002C;
		if (a5_119 != null)
		{
			word32 a5_165;
			word32 tp_169;
			word32 a7_170;
			word32 s5_171;
			word32 s6_172;
			word32 t0_173;
			word32 t1_174;
			word32 t4_175;
			word32 t5_176;
			word32 t6_177;
			a5_119();
		}
	}
	else
	{
		word32 a0_182;
		word32 a4_186;
		struct Eq_427688 * a5_187;
		word32 s5_348;
		word32 s6_349;
		word32 s2_345;
		word32 s4_347;
		word32 s3_346;
		word32 a1_342;
		word32 a7_344;
		word32 a3_343;
		word32 s1_341;
		sys_mbox_trypost(a0 + 20, a4, a5, mstatus, dwLoc1C, s3, dwArgD8, dwArg0118, dwArg0158, out s1_341, out a0_182, out a1_342, out a3_343, out a4_186, out a5_187, out a7_344, out s2_345, out s3_346, out s4_347, out s5_348, out s6_349);
		if (a0_182 == 0x00)
		{
			word32 s0_205 = a5_187->dw002C;
			if (a5_187 != null)
				a5_187();
		}
	}
}

// 2307657A: void lwip_netconn_do_delconn(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_427848) a0, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_delconn(Eq_2 ra, Eq_2 s0, struct Eq_427848 * a0, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_110;
	Eq_2 a0_10 = a0->t0000;
	Eq_2 a5_11 = (word32) *((word32) a0_10 + 1);
	Eq_2 a4_111 = a5_11 & 0x00FD;
	if ((a5_11 & 0x00FD) != 0x00)
	{
		a4_111.u0 = 0x03;
		if (a5_11 != 0x03)
		{
l2307659C:
			a0->b0004 = ~0x04;
			a5_110.u0 = ~0x04;
			goto l230765A2;
		}
		ui32 a5_14 = (word32) *((word32) a0_10 + 36);
		a5_11 = a5_14 & 0x04;
		if ((a5_14 & 0x04) == 0x00)
			goto l2307659C;
	}
	a0->b0004 = 0x00;
	struct Eq_427930 ** a4_33;
	Eq_2 s1_40;
	Eq_2 s3_44;
	Eq_2 s4_45;
	Eq_2 s6_47;
	word32 s0_620;
	Eq_2 a0_29;
	word32 a3_100;
	Eq_2 s7_116;
	Eq_2 ra_108 = netconn_drain(ra, a0_10, a3, a4_111, a5_11, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0148, out s0_620, out s1_40, out a0_29, out a3_100, out a4_33, out a5_110, out s3_44, out s4_45, out s6_47, out s7_116, out mstatus);
	struct Eq_427930 * s0_58 = *a4_33;
	a4_111 = *((word32) a0_29 + 4);
	if (a0_29 != 0x00)
	{
		ui32 a5_60 = (word32) *a4_111.u0;
		a5_110 = a5_60 & 0x00F0;
		if ((a5_60 & 0x00F0) != 32)
		{
			if ((a5_60 & 0x00F0) != 64)
			{
				a3_100 = 0x10;
				if ((a5_60 & 0x00F0) == 0x10)
				{
					*((byte) a4_111.u0 + 1) = 0x04;
					s0_58->b0008 = 0x03;
					*((word32) *(union Eq_2 *) 0x03 + 40) = 0x03;
					word32 mstatus_640;
					word32 s3_634;
					word32 s8_639;
					word32 s5_636;
					word32 s4_635;
					word32 s7_638;
					word32 s6_637;
					word32 a5_633;
					word32 s1_632;
					word32 s0_631;
					lwip_netconn_do_close_internal(ra_108, s0, s1_40, dwArg10, 0x10, 0x03, s3_44, s4_45, s6_47, s7_116, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s0_631, out s1_632, out a5_633, out s3_634, out s4_635, out s5_636, out s6_637, out s7_638, out s8_639, out mstatus_640);
					return;
				}
			}
			else
				a0_29 = raw_remove(a0_29, 64, a5_60 & 0x00F0, mstatus, out a3_100, out a4_111, out a5_110);
		}
		else
		{
			((word32) a0_29 + 36)->u0 = 0x00;
			word32 a2_630;
			udp_remove(a0_29, 32, mstatus, out a0_29, out a2_630, out a3_100, out a4_111, out a5_110);
		}
		*((byte) a5_110.u0 + 4) = 0x00;
	}
	word32 s0_91 = *a0_29;
	Eq_2 a0_109 = *((byte) a5_110.u0 + 44);
	if (a5_110 != 0x00)
	{
		word32 a6_117;
		word32 a7_118;
		word32 s1_119;
		word32 s10_120;
		word32 s11_121;
		word32 s2_122;
		word32 s3_123;
		word32 s4_124;
		word32 s5_125;
		word32 s6_126;
		word32 s8_127;
		word32 s9_128;
		word32 t0_129;
		word32 t1_130;
		word32 t3_131;
		word32 t4_132;
		word32 t5_133;
		word32 t6_134;
		word32 tp_135;
		a5_110();
	}
	word32 s0_138 = *a0_109;
	a0_10 = *((byte) a5_110.u0 + 44);
	if (a5_110 != 0x00)
	{
		word32 a6_159;
		word32 a7_160;
		word32 s1_161;
		word32 s10_162;
		word32 s11_163;
		word32 s2_164;
		word32 s3_165;
		word32 s4_166;
		word32 s5_167;
		word32 s6_168;
		word32 s8_169;
		word32 s9_170;
		word32 t0_171;
		word32 t1_172;
		word32 t3_173;
		word32 t4_174;
		word32 t5_175;
		word32 t6_176;
		word32 tp_177;
		a5_110();
	}
l230765A2:
	word32 a0_225 = sys_sem_valid((word32) a0_10 + 0x0C);
	if (a0_225 == 0x00)
		return;
	word32 s6_628;
	word32 s8_629;
	word32 a1_622;
	word32 s5_627;
	word32 a3_623;
	word32 s2_624;
	word32 s4_626;
	word32 s3_625;
	word32 s1_621;
	sys_sem_signal(a0_225 + 0x0C, a4_111, a5_110, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_621, out a1_622, out a3_623, out s2_624, out s3_625, out s4_626, out s5_627, out s6_628, out s8_629);
}

// 2307663C: void lwip_netconn_do_bind(Register Eq_2 s1, Register Eq_2 a1, Register (ptr32 Eq_2) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_bind(Eq_2 s1, Eq_2 a1, union Eq_2 * a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_19 = *a4;
	Eq_2 a5_11 = ~0x05;
	Eq_2 a4_12 = *((word32) a0_19 + 4);
	if (a0_19 != 0x00)
	{
		ui32 a5_13 = (word32) *a4_12;
		if ((a5_13 & 0x00F0) != 32)
		{
			a4_12.u0 = 64;
			if ((a5_13 & 0x00F0) != 64)
			{
				a4_12.u0 = 0x10;
				if ((a5_13 & 0x00F0) != 0x10)
				{
					a5_11.u0 = ~0x05;
					goto l2307666C;
				}
				a0_19 = tcp_bind(s1, a0_19, a1, (word32) *((word32) a0_19 + 0x0C), a5_13 & 0x00F0, mstatus, dwArg14, dwArg34, out a4_12);
			}
			else
				a0_19 = raw_bind(a0_19, a1);
		}
		else
		{
			word32 a3_119;
			word32 a5_120;
			a0_19 = udp_bind(a0_19, a1, (word32) *((word32) a0_19 + 0x0C), out a3_119, out a4_12, out a5_120);
		}
		a5_11 = a0_19;
	}
l2307666C:
	*((word32) *a0_19 + 4) = (byte) a5_11;
	Eq_2 a0_63 = (word32) a0_19 + 0x0C;
	word32 s8_129;
	word32 s5_127;
	word32 s6_128;
	word32 s3_125;
	word32 s4_126;
	word32 a3_123;
	word32 s2_124;
	word32 s1_121;
	word32 a1_122;
	sys_sem_signal(a0_63, a4_12, a5_11, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_121, out a1_122, out a3_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s8_129);
}

// 230766A0: void lwip_netconn_do_connect(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_392074) a1, Register (ptr32 Eq_2) a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_connect(Eq_2 ra, Eq_2 s0, struct Eq_392074 * a1, union Eq_2 * a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_100;
	Eq_2 a0_11 = *a4;
	Eq_2 s0_104 = a0_11;
	Eq_2 a4_101 = *((word32) a0_11 + 4);
	if (a0_11 != 0x00)
	{
		ui32 a5_15 = (word32) *a4_101;
		a5 = a5_15 & 0x00F0;
		if ((a5_15 & 0x00F0) != 32)
		{
			if ((a5_15 & 0x00F0) != 64)
			{
				a0_100.u0 = ~0x05;
				if ((a5_15 & 0x00F0) == 0x10)
				{
					a5 = (word32) *((word32) a4_101 + 1);
					if (a5 != 0x03)
					{
						a0_100.u0 = ~0x09;
						if (a5 == 0x00)
						{
							word32 a1_46;
							word32 s1_60;
							s0_104 = tcp_connect(ra, 0x03, setup_tcp(a0_11, out a1_46), a1_46, (word32) *((word32) *a5 + 0x0C), 587684708, s7, mstatus, s0, dwArg14, dwArg28, dwArg38, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s1_60, out a0_100, out a4_101, out a5, out mstatus);
							if (a0_100 == 0x00)
							{
								ui32 a4_86 = (word32) *((word32) a5 + 36);
								*((word32) a5 + 1) = (byte) s1_60;
								s0_104 = *a5;
								if ((a4_86 & 0x02) == 0x00)
								{
									*((word32) a5 + 36) = (byte) ((word32) *((word32) a5 + 36) & ~0x04);
									*((word32) *a5 + 40) = a5;
									return;
								}
								ui32 a4_99 = (word32) *((word32) a5 + 36);
								*((word32) a5 + 36) = (byte) (a4_99 | 4);
								a0_100.u0 = ~0x04;
								a4_101 = a4_99 | 4;
							}
						}
					}
					else
						a0_100.u0 = ~0x08;
				}
			}
			else
			{
				s0_104 = a1->t0008;
				a0_100 = raw_connect(a0_11, a1, a4_101, out a4_101, out a5);
			}
		}
		else
		{
			s0_104 = a1->t0008;
			word32 a3_213;
			word32 s2_214;
			a0_100 = udp_connect(a0_11, a1, (word32) *((word32) a0_11 + 0x0C), dwArg28, out a3_213, out a4_101, out a5, out s2_214);
		}
	}
	else
		a0_100.u0 = ~0x0E;
	*((word32) s0_104 + 4) = (byte) a0_100;
	Eq_2 a0_111 = (byte) a0_100.u0 + 0x0C;
	word32 s1_215;
	word32 a1_216;
	word32 a3_217;
	word32 s2_218;
	word32 s3_219;
	word32 s4_220;
	word32 s5_221;
	word32 s6_222;
	word32 s8_223;
	sys_sem_signal(a0_111, a4_101, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_215, out a1_216, out a3_217, out s2_218, out s3_219, out s4_220, out s5_221, out s6_222, out s8_223);
}

// 23076762: void lwip_netconn_do_disconnect(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_disconnect(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_14;
	Eq_423050 a0_9 = *a4;
	if (((word32) *a4 & 0x00F0) == 32)
	{
		a4 = *((word32) a0_9 + 4);
		a5_14 = udp_disconnect(a0_9);
		*((word32) a0_9 + 4) = 0x00;
	}
	else
	{
		*((word32) a0_9 + 4) = ~0x05;
		a5_14.u0 = ~0x05;
	}
	word32 s6_78;
	word32 s5_77;
	word32 s4_76;
	word32 s3_75;
	word32 s2_74;
	word32 a3_73;
	word32 a1_72;
	word32 s1_71;
	word32 s8_79;
	sys_sem_signal((word32) a0_9 + 0x0C, a4, a5_14, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_71, out a1_72, out a3_73, out s2_74, out s3_75, out s4_76, out s5_77, out s6_78, out s8_79);
}

