pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307679C: void lwip_netconn_do_listen(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a4, Register (ptr32 Eq_2) a5, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void lwip_netconn_do_listen(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a4, union Eq_2 * a5, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	word32 a5_146;
	Eq_2 a0_100 = *a5;
	byte bLoc11_197 = SLICE(s0, byte, 24);
	Eq_2 a5_13 = *((word32) a0_100 + 4);
	if (a0_100 != 0x00)
	{
		ui32 a4_14 = (word32) *a5_13;
		a4 = a4_14 & 0x00F0;
		if ((a4_14 & 0x00F0) != 0x10)
		{
			a5_146 = ~0x0F;
			goto l230767C8;
		}
		word32 a5_18 = (word32) *((word32) a5_13 + 1);
		if (a5_18 == 0x00)
		{
			if ((word32) *((word32) a0_100 + 20) == 0x00)
			{
				Eq_2 a5_28;
				Eq_2 a3_32;
				Eq_2 a2_27;
				a0_100 = tcp_listen_with_backlog_and_err(s1, a0_100, fp + ~0x10, 0x10, a4_14 & 0x00F0, mstatus, dwArg14, dwArg18, out a2_27, out a3_32, out a4, out a5_28);
				Eq_2 s1_34 = a0_100;
				if (a0_100 != 0x00)
				{
					Eq_2 a0_37 = sys_mbox_valid((word32) a0_100 + 16);
					if (a0_37 != 0x00)
					{
						word32 a0_40;
						s1_34 = sys_mbox_free((word32) a0_37 + 16, a3_32, a4, mstatus, dwArg0128, dwArg0168, out a0_40, out a2_27, out a3_32, out a4, out a5_28, out s4);
						sys_mbox_set_invalid(a0_40 + 0x10);
						a0_37 = a0_40 + 0x10;
					}
					bLoc11_197 = 0x00;
					a0_100 = sys_mbox_valid((word32) a0_37 + 20);
					if (a0_100 == 0x00)
					{
						word32 a4_356;
						word32 s2_358;
						word32 a5_357;
						word32 s3_359;
						s1_34 = sys_mbox_new(ra, a3_32, a4, a5_28, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a0_100, out a2_27, out a3_32, out a4_356, out a5_357, out s2_358, out s3_359, out s4);
						bLoc11_197 = (byte) a0_100;
					}
					Eq_2 a5_85 = (int32) bLoc11_197;
					if (a5_85 == 0x00)
					{
						*((word32) a5_85 + 1) = 0x02;
						*((word32) s1_34 + 4) = a5_85;
						tcp_arg(a0_100, *((word32) a0_100 + 4));
						a4 = tcp_accept(a0_100, &g_t2307649C);
					}
					else
					{
						struct Eq_428645 * a5_105;
						word32 s11_372;
						word32 s8_369;
						word32 s9_370;
						word32 s10_371;
						word32 s3_364;
						word32 s6_367;
						word32 s7_368;
						word32 s4_365;
						word32 s5_366;
						word32 s2_363;
						word32 s1_360;
						word32 a1_361;
						word32 a3_362;
						tcp_close(ra, s1_34, a2_27, a3_32, s4, s7, mstatus, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg64, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s1_360, out a0_100, out a1_361, out a3_362, out a4, out a5_105, out s2_363, out s3_364, out s4_365, out s5_366, out s6_367, out s7_368, out s8_369, out s9_370, out s10_371, out s11_372, out mstatus);
						a5_105->dw0004 = 0x00;
					}
				}
				goto l23076840;
			}
			a5_146 = ~0x05;
l230767C8:
			bLoc11_197 = (byte) a5_146;
			goto l23076840;
		}
		a4.u0 = 0x02;
		if (a5_18 == 0x02)
		{
			bLoc11_197 = 0x00;
l23076840:
			Eq_2 a5_153 = (word32) bLoc11_197;
			*((word32) *a0_100 + 4) = (byte) a5_153;
			word32 a1_348;
			word32 s2_350;
			word32 s1_347;
			word32 a3_349;
			word32 s3_351;
			word32 s4_352;
			word32 s8_355;
			word32 s5_353;
			word32 s6_354;
			sys_sem_signal((word32) a0_100 + 0x0C, a4, a5_153, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_347, out a1_348, out a3_349, out s2_350, out s3_351, out s4_352, out s5_353, out s6_354, out s8_355);
			return;
		}
	}
	a5_146 = ~0x0A;
	goto l230767C8;
}

// 2307687C: void lwip_netconn_do_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack word32 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, word32 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	word32 a3_287;
	word32 a2_286;
	word32 a0_113;
	Eq_2 a4_103;
	Eq_2 a5_118;
	netconn_err(*a0, a3, a4, mstatus, out a0_113, out a2_286, out a3_287, out a4_103, out a5_118);
	Eq_2 s0_123 = a0;
	if (a0_113 == 0x00)
	{
		s0_123 = *a5_118;
		a0_113 = ~0x0A;
		Eq_2 a7_23 = *((word32) a5_118 + 4);
		if (a7_23 == 0x00)
			goto l230768C4;
		ui32 a5_24 = (word32) *a5_118;
		a5_118 = a5_24 & 0x00F0;
		if ((a5_24 & 0x00F0) != 32)
		{
			a4_103.u0 = 64;
			if ((a5_24 & 0x00F0) != 64)
				goto l230768C4;
			Eq_2 a2_106 = (a5_24 & 0x00F0) + 8;
			Eq_2 a5_108 = *a1;
			if (a2_106 == 0x00)
			{
l230768C0:
				s0_123 = raw_send(ra, a7_23, a1, a5_108, s4, s5, s6, s7, mstatus, s0, dwArg14, dwArg28, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out a0_113, out a4_103, out a5_118, out mstatus);
				goto l230768C4;
			}
			a5_108 = *((word32) a5_108 + 8);
			if (a5_108 == 0x00)
				goto l230768C0;
			s0_123 = raw_sendto(ra, a7_23, a1, a2_106, a5_108, s4, s5, s6, s7, mstatus, s0, dwArg14, dwArg28, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out a0_113, out a4_103, out a5_118, out mstatus);
		}
		else
		{
			struct Eq_428775 * a6_27 = *((word32) s0_123 + 8);
			ui32 a4_28 = (word32) a6_27->b000E;
			Eq_2 a1_30 = a6_27->t0000;
			struct Eq_422590 * a5_32 = (word32) a6_27->w0010;
			if (a6_27 != (struct Eq_428775 *) 0x08 && a6_27->dw0008 != 0x00)
			{
				word32 s5_302;
				word32 s9_303;
				word32 a3_299;
				word32 s4_301;
				word32 s3_300;
				word32 a2_298;
				word32 s1_297;
				udp_sendto_chksum(ra, a7_23, a1_30, &a6_27->dw0008, (word32) a6_27->w000C, a4_28 & 0x02, a5_32, s4, mstatus, dwArg04, dwArg18, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_123, out s1_297, out a0_113, out a2_298, out a3_299, out a4_103, out a5_118, out s3_300, out s4_301, out s5_302, out s9_303, out mstatus);
			}
			else
				s0_123 = udp_send_chksum(ra, a7_23, a1_30, a4_28 & 0x02, a5_32, s4, mstatus, dwArg04, dwArg18, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out a0_113, out a4_103, out a5_118, out mstatus);
		}
	}
l230768C4:
	*((word32) s0_123 + 4) = (byte) a0_113;
	Eq_2 a0_185 = a0_113 + 0x0C;
	word32 s8_296;
	word32 s5_294;
	word32 s6_295;
	word32 s2_291;
	word32 s4_293;
	word32 s3_292;
	word32 s1_288;
	word32 a3_290;
	word32 a1_289;
	sys_sem_signal(a0_185, a4_103, a5_118, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_288, out a1_289, out a3_290, out s2_291, out s3_292, out s4_293, out s5_294, out s6_295, out s8_296);
}

// 23076912: void lwip_netconn_do_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a4, Register (ptr32 Eq_2) a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_recv(Eq_2 ra, Eq_2 s1, Eq_2 a4, union Eq_2 * a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_17 = *a5;
	*((word32) a0_17 + 4) = 0x00;
	Eq_2 a5_21 = *((word32) a4 + 4);
	if (a4 != 0x00)
	{
		ui32 a5_22 = (word32) *a5_21;
		a4.u0 = 0x10;
		a5_21 = a5_22 & 0x00F0;
		if ((a5_22 & 0x00F0) == 0x10)
		{
			a0_17 = *((word32) s1 + 8);
			Eq_2 s3_26 = 0x10000000;
			Eq_2 s4_27 = 0x0FFFFFFF;
			s1_28 = s1;
			do
			{
				Eq_2 s1_28;
				Eq_2 s2_29 = s1_28;
				if (s1_28 >= s3_26)
					s2_29 = s4_27;
				word32 s10_234;
				word32 s11_235;
				word32 s0_231;
				word32 a3_232;
				word32 s9_233;
				ra = tcp_recved(ra, s1_28 - s2_29, a0_17, (word32) (word16) s2_29, s7, mstatus, dwLoc10, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s0_231, out s1_28, out a0_17, out a3_232, out a4, out a5_21, out s3_26, out s4_27, out s7, out s9_233, out s10_234, out s11_235, out mstatus);
			} while (s1_28 != 0x00);
		}
	}
	Eq_2 a0_93 = (word32) a0_17 + 0x0C;
	word32 s5_228;
	word32 s6_229;
	word32 s8_230;
	word32 s4_227;
	word32 s3_226;
	word32 s2_225;
	word32 a3_224;
	word32 s1_222;
	word32 a1_223;
	sys_sem_signal(a0_93, a4, a5_21, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_222, out a1_223, out a3_224, out s2_225, out s3_226, out s4_227, out s5_228, out s6_229, out s8_230);
}

