pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23076976: void lwip_netconn_do_write(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register (ptr32 (ptr32 Eq_425660)) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_write(Eq_2 ra, union Eq_2 * a0, struct Eq_425660 ** a1, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	word32 a3_169;
	word32 a2_168;
	word32 a0_14;
	Eq_2 a5_20;
	Eq_2 a4_19;
	Eq_2 s1_16 = netconn_err(*a0, a3, a4, mstatus, out a0_14, out a2_168, out a3_169, out a4_19, out a5_20);
	Eq_429038 s0_21 = *a5_20;
	if (a0_14 == 0x00)
	{
		ui32 a4_22 = (word32) *a5_20;
		a0_14 = ~0x05;
		a4_19 = a4_22 & 0x00F0;
		if ((a4_22 & 0x00F0) == 0x10)
		{
			a4_19 = (word32) *((word32) a5_20 + 1);
			if (a4_19 == 0x00)
			{
				a5_20 = *((word32) a4_19 + 4);
				a0_14 = ~0x0A;
				if (a4_19 != 0x00)
				{
					*((word32) a5_20 + 1) = 0x01;
					*((word32) *a5_20 + 40) = a5_20;
					word32 s0_179;
					word32 s1_180;
					word32 a5_181;
					word32 s3_182;
					word32 s4_183;
					word32 s5_184;
					word32 s6_185;
					word32 s7_186;
					word32 s8_187;
					word32 mstatus_188;
					lwip_netconn_do_writemore(ra, s1_16, a1, dwArg10, 0x10, a5_20, s5, s6, s7, s8, mstatus, dwArg28, dwArg48, dwArg68, dwArg88, dwArg98, dwArgC8, dwArg0128, out s0_179, out s1_180, out a5_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out mstatus_188);
					return;
				}
			}
			else
				a0_14 = ~0x04;
		}
	}
	((word32) s0_21 + 4)->u0 = (byte) a0_14;
	Eq_2 a0_37 = (word32) a5_20 + 0x0C;
	word32 a3_172;
	word32 a1_171;
	word32 s1_170;
	word32 s2_173;
	word32 s3_174;
	word32 s4_175;
	word32 s5_176;
	word32 s6_177;
	word32 s8_178;
	sys_sem_signal(a0_37, a4_19, a5_20, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_170, out a1_171, out a3_172, out s2_173, out s3_174, out s4_175, out s5_176, out s6_177, out s8_178);
}

// 230769CE: void lwip_netconn_do_getaddr(Register Eq_2 a4, Register (ptr32 Eq_429129) a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_getaddr(Eq_2 a4, struct Eq_429129 * a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_19;
	Eq_429138 a0_15 = a5->t0000;
	struct Eq_429142 * a5_6 = a5->ptr0004;
	if (a5_6 != null)
	{
		union Eq_2 * a5_10;
		if ((word32) *((word32) a0_15 + 16) != 0x00)
			a5_10 = a5_6->ptr0000;
		else
			a5_10 = a5_6->ptr0004;
		*a5_10 = (union Eq_2 *) a4;
		a0_15 = *a4;
		((word32) a0_15 + 4)->u0 = 0x00;
		ui32 a5_18 = (word32) *a4;
		a5_19 = a5_18 & 0x00F0;
		if ((a5_18 & 0x00F0) != 32)
		{
			if ((a5_18 & 0x00F0) == 64)
			{
				a5_19 = (word32) *((word32) a0_15 + 16);
				if (a5_19 == 0x00)
					goto l23076A16;
				a0_15 = *((word32) a5_19 + 0x0C);
				a4 = (word32) *((word32) *((byte) a4.u0 + 4) + 16);
				*a5_19 = (word16) a4;
l23076A34:
				word32 a0_54 = *a0_15;
				word32 s4_134;
				word32 s8_137;
				word32 s5_135;
				word32 s6_136;
				word32 s1_129;
				word32 s3_133;
				word32 s2_132;
				word32 a1_130;
				word32 a3_131;
				sys_sem_signal(a0_54 + 0x0C, a4, a5_19, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_129, out a1_130, out a3_131, out s2_132, out s3_133, out s4_134, out s5_135, out s6_136, out s8_137);
				return;
			}
			if ((a5_18 & 0x00F0) != 0x10)
				goto l23076A34;
			a4 = (word32) *((word32) a0_15 + 16);
			if (a4 == 0x00)
			{
				a4.u0 = 0x01;
				if ((word32) (a5_18 & 0x00F0)->b0014 <= 0x01)
					goto l23076A16;
				a5_19 = (word32) (a5_18 & 0x00F0)->w0018;
			}
			else
				a5_19 = (word32) (a5_18 & 0x00F0)->w0016;
			a0_15 = *((byte) a4.u0 + 0x0C);
l23076A4A:
			*a4.u0 = (word16) a5_19;
			goto l23076A34;
		}
		a4 = (word32) *((word32) a0_15 + 16);
		if (a4 != 0x00)
		{
			a0_15 = *((word32) a4 + 0x0C);
			a5_19 = (word32) (a5_18 & 0x00F0)->w0012;
			goto l23076A4A;
		}
		ui32 a4_22 = (word32) (a5_18 & 0x00F0)->b0010;
		a4 = a4_22 & 0x04;
		if ((a4_22 & 0x04) != 0x00)
		{
			a0_15 = (a4_22 & 0x04)->t000C;
			a5_19 = (word32) (a5_18 & 0x00F0)->w0014;
			goto l23076A4A;
		}
	}
l23076A16:
	((word32) a0_15 + 4)->u0 = ~0x0A;
	a5_19.u0 = ~0x0A;
	goto l23076A34;
}

// 23076A6E: void lwip_netconn_do_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_429306) a0, Register (ptr32 Eq_429307) a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_close(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_429306 * a0, struct Eq_429307 * a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a4_122;
	Eq_2 a0_12 = a4->t0004;
	if (a4 != null && ((word32) (*a0_12) & 0x00F0) == 0x10)
	{
		ui32 a4_16 = (word32) a0->b0008;
		Eq_2 a3_18 = (word32) *((word32) a0_12 + 1);
		if ((a4_16 == 0x03 || a3_18 != 0x02) && a3_18 != 0x03)
		{
			if (a3_18 != 0x01)
			{
				if ((a4_16 & 0x01) != 0x00)
				{
					word32 a0_334;
					word32 s0_333;
					word32 a4_335;
					ra = netconn_drain(ra, a0_12, a3_18, a4_16 & 0x01, a5, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0148, out s0_333, out s1, out a0_334, out a3_18, out a4_335, out a5, out s3, out s4, out s6, out s7, out mstatus);
				}
				*((word32) a5 + 1) = 0x04;
				*((word32) *a5 + 40) = a5;
				word32 mstatus_345;
				word32 s7_343;
				word32 s8_344;
				word32 s5_341;
				word32 s6_342;
				word32 s4_340;
				word32 s3_339;
				word32 s1_337;
				word32 a5_338;
				word32 s0_336;
				lwip_netconn_do_close_internal(ra, s0, s1, dwArg10, a3_18, a5, s3, s4, s6, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, dwArg0108, out s0_336, out s1_337, out a5_338, out s3_339, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out mstatus_345);
				return;
			}
			a4_122.u0 = ~0x04;
l23076AA6:
			a0->b0004 = (byte) a4_122;
			word32 a3_326;
			word32 a1_325;
			word32 s1_324;
			word32 s2_327;
			word32 s3_328;
			word32 s6_331;
			word32 s4_329;
			word32 s5_330;
			word32 s8_332;
			sys_sem_signal((word32) a0_12 + 0x0C, a4_122, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_324, out a1_325, out a3_326, out s2_327, out s3_328, out s4_329, out s5_330, out s6_331, out s8_332);
			return;
		}
	}
	a4_122.u0 = ~0x0A;
	goto l23076AA6;
}

