pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23076AE0: void lwip_netconn_do_join_leave_group(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_429465) a0, Register (ptr32 Eq_429466) a1, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_join_leave_group(Eq_2 ra, Eq_2 s1, struct Eq_429465 * a0, struct Eq_429466 * a1, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	a0->b0004 = ~0x0A;
	struct Eq_429487 * a0_11 = *(struct Eq_429487 **) ~0x0A;
	Eq_2 a5_14 = *((word32) a4 + 4);
	if (a4 != 0x00)
	{
		a4.u0 = 32;
		if (((word32) *a5_14 & 0x00F0) == 32)
		{
			Eq_2 a5_20 = (word32) a0_11->b0011;
			union Eq_2 * a0_21 = a0_11->ptr000C;
			struct Eq_429522 * s0_23 = a1->ptr0008;
			if (a5_20 == 0x00)
				a0_11 = igmp_joingroup(ra, a0_21, a5_20, s7, mstatus, dwArg08, dwArg18, dwArg28, out a4, out a5_14, out mstatus);
			else
				s0_23 = igmp_leavegroup(ra, s1, a0_21, a5_20, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg48, dwArg68, dwArg88, dwArg98, dwArgC8, out a0_11, out a4, out a5_14, out mstatus);
			s0_23->b0004 = (byte) a0_11;
		}
		else
		{
			a0_11->b0004 = ~0x05;
			a5_14.u0 = ~0x05;
		}
	}
	Eq_2 a0_90 = &a0_11->ptr000C;
	word32 s6_167;
	word32 s8_168;
	word32 s4_165;
	word32 s5_166;
	word32 s2_163;
	word32 s3_164;
	word32 a1_161;
	word32 a3_162;
	word32 s1_160;
	sys_sem_signal(a0_90, a4, a5_14, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_160, out a1_161, out a3_162, out s2_163, out s3_164, out s4_165, out s5_166, out s6_167, out s8_168);
}

// 23076B32: void lwip_netconn_do_gethostbyname(Register Eq_2 ra, Register (ptr32 Eq_429566) s1, Register (ptr32 Eq_389890) a1, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_gethostbyname(Eq_2 ra, struct Eq_429566 * s1, struct Eq_389890 * a1, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_24;
	int8 * a5_34;
	byte * s1_47;
	ptr32 mstatus_51;
	word32 s4_145;
	word32 s3_144;
	word32 s2_143;
	word32 a4_142;
	word32 a3_141;
	word32 s0_140;
	dns_gethostbyname_addrtype(ra, *a1->ptr0004, a1, s1->t000C, s2, s5, s6, s8, mstatus, dwLoc08, dwArg0C, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgD8, dwArg0118, dwArg0158, out s0_140, out s1_47, out a0_24, out a3_141, out a4_142, out a5_34, out s2_143, out s3_144, out s4_145, out mstatus_51);
	*s1_47 = (byte) a0_24;
	Eq_2 a4_55 = (int32) *a5_34;
	if (a4_55 == ~0x04)
		return;
	word32 s1_146;
	word32 a1_147;
	word32 a3_148;
	word32 s2_149;
	word32 s3_150;
	word32 s4_151;
	word32 s5_152;
	word32 s6_153;
	word32 s8_154;
	sys_sem_signal(a0_24, a4_55, ~0x04, mstatus_51, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_146, out a1_147, out a3_148, out s2_149, out s3_150, out s4_151, out s5_152, out s6_153, out s8_154);
}

// 23076B7A: Register Eq_2 err_to_errno(Register Eq_2 a0, Register out Eq_2 a4Out, Register out (ptr32 (ptr32 Eq_2)) a5Out)
// Called from:
//      lwip_recv_tcp
//      lwip_accept
//      lwip_bind
//      lwip_close
//      lwip_connect
//      lwip_listen
//      lwip_recv
//      lwip_sendto
//      lwip_send
//      lwip_setsockopt
Eq_2 err_to_errno(Eq_2 a0, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	union Eq_2 ** a5_5 = (word32) a0 + 16 & 0x00FF;
	if (a5_5 > (union Eq_2 **) 0x10)
	{
		a4Out.u0 = <invalid>;
		a5Out = a5_5;
		return 0x05;
	}
	else
	{
		Eq_2 a0_13 = 588003280 - (a0 << 0x02);
		a4Out.u0 = <invalid>;
		a5Out = a0 << 0x02;
		return a0_13;
	}
}

// 23076B9E: Register Eq_2 netbuf_delete(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0108, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      free_socket
//      lwip_recvfrom_udp_raw.isra.6
//      recv_udp
//      recv_raw
//      netconn_drain
Eq_2 netbuf_delete(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0108, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	if (a0 == 0x00)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a1_21 = a0;
		Eq_2 a0_6 = *a0;
		if (a0_6 != 0x00)
		{
			word32 s0_130;
			word32 s1_131;
			word32 a0_132;
			word32 a2_133;
			word32 a5_134;
			word32 a7_135;
			word32 s2_136;
			word32 s3_137;
			word32 s4_138;
			word32 s5_139;
			word32 s6_140;
			word32 s8_141;
			pbuf_free(ra, a0_6, a3, a4, s4, mstatus, dwArg0108, out s0_130, out s1_131, out a0_132, out a1_21, out a2_133, out a3, out a4, out a5_134, out a7_135, out s2_136, out s3_137, out s4_138, out s5_139, out s6_140, out s8_141, out mstatus);
			*((word32) a1_21 + 4) = 0x00;
			*a1_21 = 0x00;
		}
		ptr32 a5_52;
		ptr32 a2_54;
		Eq_2 a3_55;
		Eq_2 a4_56;
		word32 a0_142;
		Eq_2 s1_57 = memp_free(0x06, a1_21, a3, a4, mstatus, out a0_142, out a2_54, out a3_55, out a4_56, out a5_52);
		a2Out = a2_54;
		a3Out = a3_55;
		a4Out = a4_56;
		a5Out = a5_52;
		return s1_57;
	}
}

