pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23076BCA: Register Eq_2 netbuf_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_387425) s0Out, Register out (ptr32 Eq_387425) a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_sendto
Eq_2 netbuf_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, struct Eq_387425 & s0Out, struct Eq_387425 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		Eq_2 s0_19 = a0;
		Eq_2 a0_10 = *a0;
		if (a0_10 != 0x00)
		{
			word32 a5_201;
			word32 a7_202;
			word32 s2_203;
			word32 s3_204;
			word32 a2_200;
			word32 a0_199;
			word32 s4_205;
			word32 s5_206;
			word32 s6_207;
			word32 s8_208;
			ra = pbuf_free(ra, a0_10, a3, a4, s4, mstatus, dwArg0108, out s0_19, out s1, out a0_199, out a1, out a2_200, out a3, out a4, out a5_201, out a7_202, out s2_203, out s3_204, out s4_205, out s5_206, out s6_207, out s8_208, out mstatus);
		}
		struct Eq_387425 * a0_119;
		struct Eq_429744 * a0_55;
		Eq_2 a3_57;
		Eq_2 a4_58;
		struct Eq_387425 * s0_60;
		ptr32 s2_66;
		Eq_2 s4_68;
		ptr32 mstatus_71;
		word32 s8_198;
		word32 s6_197;
		word32 s5_196;
		word32 s3_195;
		word32 a7_194;
		word32 a5_193;
		word32 a2_192;
		word32 a1_191;
		word32 s1_190;
		Eq_2 ra_72 = pbuf_alloc(ra, s0_19, s1, 0x00B6, a1, 640, a3, a4, mstatus, dwLoc1C, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_60, out s1_190, out a0_55, out a1_191, out a2_192, out a3_57, out a4_58, out a5_193, out a7_194, out s2_66, out s3_195, out s4_68, out s5_196, out s6_197, out s8_198, out mstatus_71);
		a0_55->ptr0000 = s0_60;
		if (a0_55 != null)
		{
			a0_55->ptr0004 = s0_60;
			a0_119 = a0_55->ptr0004;
		}
		else
			a0_119 = null;
		s0Out = s0_60;
		a0Out = a0_119;
		a3Out = a3_57;
		a4Out = a4_58;
		s2Out = s2_66;
		s4Out = s4_68;
		mstatusOut = mstatus_71;
		return ra_72;
	}
	else
	{
		s0Out = s0;
		a0Out = null;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23076C04: Register word32 netbuf_free(Register Eq_2 ra, Register (ptr32 Eq_387311) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_sendto
word32 netbuf_free(Eq_2 ra, struct Eq_387311 * a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0118, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	if (a0 == null)
	{
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		mstatusOut = mstatus;
		return a2;
	}
	else
	{
		struct Eq_387311 * s0_17 = a0;
		Eq_2 a0_10 = a0->t0000;
		if (a0_10 != 0x00)
		{
			word32 s1_127;
			word32 a0_128;
			word32 a1_129;
			word32 a2_130;
			word32 a3_131;
			word32 a4_132;
			word32 a5_133;
			word32 a7_134;
			word32 s6_135;
			word32 s8_136;
			pbuf_free(ra, a0_10, a3, a4, s4, mstatus, dwArg0118, out s0_17, out s1_127, out a0_128, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out a7_134, out s2, out s3, out s4, out s5, out s6_135, out s8_136, out mstatus);
		}
		s0_17->t0004.u1 = 0x00;
		s0_17->t0000.u0 = 0x00;
		s0_17->b000E = 0x00;
		s0_17->w0010 = 0x00;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		mstatusOut = mstatus;
		return dwArg10;
	}
}

// 23076C30: Register word32 icmp_input(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      ip4_input
word32 icmp_input(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	word32 s1_458;
	g_w4202683A = (word16) ((word32) g_w4202683A + 0x01);
	Eq_2 s7_30 = g_t42026920;
	Eq_2 a4_26 = 0x13;
	Eq_2 s0_108 = a0;
	if (((word32) *s7_30 & 0x0F) << 2 > 0x13)
	{
		a3 = (word32) *((word32) a0 + 0x0A);
		a4_26.u0 = 0x03;
		if (a3 > 0x03)
		{
			Eq_2 a0_39 = *(union Eq_2 *) 0x07;
			Eq_2 a4_250 = (word32) *(union Eq_2 *) 0x03;
			if (a4_250 == 0x00)
			{
l23076E20:
				0x00 = (int8) dwArg0128;
				word32 s1_382;
				word32 s0_722;
				word32 a0_723;
				word32 a1_724;
				word32 a2_725;
				word32 a3_726;
				word32 a4_727;
				word32 a5_728;
				word32 a7_729;
				word32 s2_730;
				word32 s3_731;
				word32 s4_732;
				word32 s5_733;
				word32 s6_734;
				word32 s8_735;
				word32 mstatus_736;
				pbuf_free(ra, s0_108, a3, a4_250, dwArg78, mstatus, dwArg0128, out s0_722, out s1_382, out a0_723, out a1_724, out a2_725, out a3_726, out a4_727, out a5_728, out a7_729, out s2_730, out s3_731, out s4_732, out s5_733, out s6_734, out s8_735, out mstatus_736);
				return s1_382;
			}
			a3.u0 = 0x08;
			if (a4_250 != 0x08)
			{
				g_w42026848 = (word16) ((word32) g_w42026848 + 0x01);
				g_w4202683E = (word16) ((word32) g_w4202683E + 0x01);
				goto l23076E20;
			}
			Eq_2 a4_125 = 224;
			a3 = a0_39 & 0x00F0;
			if ((a0_39 & 0x00F0) == 224)
			{
l23076D2C:
				word32 s0_691;
				word32 a3_695;
				word32 a4_696;
				word32 a2_694;
				word32 a7_698;
				word32 s3_699;
				word32 a5_697;
				word32 s5_701;
				word32 s6_702;
				word32 s4_700;
				word32 s8_703;
				struct Eq_430003 * s2_459;
				word32 a1_693;
				word32 a0_692;
				word32 mstatus_704;
				pbuf_free(ra, s0_108, a3, a4_125, s4, mstatus, dwArgF8, out s0_691, out s1_458, out a0_692, out a1_693, out a2_694, out a3_695, out a4_696, out a5_697, out a7_698, out s2_459, out s3_699, out s4_700, out s5_701, out s6_702, out s8_703, out mstatus_704);
				s2_459->w005C = (word16) ((word32) s2_459->w005C + 0x01);
				goto l23076CCA;
			}
			s4 = a1;
			word32 a5_705;
			if (ip4_addr_isbroadcast_u32(a0_39, a1, out a3, out a4_125, out a5_705) != null)
				goto l23076D2C;
			a4_26 = (word32) *((word32) a0 + 8);
			if (a4_26 > 0x07)
			{
				word32 a0_101;
				Eq_2 a3_104;
				Eq_2 a4_105;
				Eq_2 s1_109;
				struct Eq_430053 * s2_110;
				s0_108 = inet_chksum_pbuf(a0, a4_26, out s1_109, out a0_101, out a3_104, out a4_105, out s2_110, out s4);
				if (a0_101 != 0x00)
				{
					struct Eq_430084 * s3_489;
					word32 s0_708;
					word32 a0_709;
					word32 a1_710;
					word32 a2_711;
					word32 a3_712;
					word32 a4_713;
					word32 a5_714;
					word32 a7_715;
					word32 s2_716;
					word32 s4_717;
					word32 s5_718;
					word32 s6_719;
					word32 s8_720;
					word32 mstatus_721;
					pbuf_free(ra, s0_108, a3_104, a4_105, s4, mstatus, dwArgF8, out s0_708, out s1_458, out a0_709, out a1_710, out a2_711, out a3_712, out a4_713, out a5_714, out a7_715, out s2_716, out s3_489, out s4_717, out s5_718, out s6_719, out s8_720, out mstatus_721);
					s3_489->w0050 = (word16) ((word32) s3_489->w0050 + 0x01);
l23076CCA:
					0x00 = (int8) dwArg0128;
					return s1_458;
				}
				Eq_2 s6_119 = 0x42026918;
				Eq_2 s3_120 = (word32) (word16) s1_109;
				Eq_2 a2_123;
				word32 a1_706;
				word32 a5_707;
				if (pbuf_add_header(s0_108, (word32) s1_109 + 0x008E, out a1_706, out a2_123, out a3, out a4_125, out a5_707) == 0x00)
				{
					word32 a1_737;
					word32 a5_738;
					if (pbuf_remove_header(s0_108, (word32) s1_109 + 0x008E, a2_123, out a1_737, out a3, out a4_125, out a5_738) != 0x00)
						goto l23076D2C;
					goto l23076D68;
				}
				Eq_2 a5_134 = (word32) *((word32) s0_108 + 8);
				word32 a1_137 = CONVERT(SLICE(a5_134 + s3_120, word16, 0), word16, word32);
				if (a1_137 < a5_134)
					goto l23076D2C;
				Eq_2 a0_140;
				Eq_2 s1_146;
				word32 a1_739;
				word32 a2_740;
				word32 a5_741;
				word32 a7_742;
				word32 s2_743;
				word32 s3_744;
				word32 s5_745;
				word32 s6_746;
				word32 s8_747;
				ra = pbuf_alloc(ra, s0_108, s1_109, 0x008E, a1_137, 640, a3, a4_125, mstatus, dwLoc2C, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_108, out s1_146, out a0_140, out a1_739, out a2_740, out a3, out a4_125, out a5_741, out a7_742, out s2_743, out s3_744, out s4, out s5_745, out s6_746, out s8_747, out mstatus);
				if (a0_140 != 0x00)
				{
					Eq_2 a4_166 = (word32) *((word32) a0_140 + 0x0A);
					if (a4_166 < (word32) s1_146 + 8)
					{
l23076D28:
						word32 s1_756;
						word32 a0_757;
						word32 a1_758;
						word32 a2_759;
						word32 a5_760;
						word32 a7_761;
						word32 s2_762;
						word32 s3_763;
						word32 s5_764;
						word32 s6_765;
						word32 s8_766;
						ra = pbuf_free(ra, a0_140, a3, a4_166, s4, mstatus, dwArgF8, out s0_108, out s1_756, out a0_757, out a1_758, out a2_759, out a3, out a4_125, out a5_760, out a7_761, out s2_762, out s3_763, out s4, out s5_764, out s6_765, out s8_766, out mstatus);
						goto l23076D2C;
					}
					Eq_2 a2_175;
					word32 a1_748;
					word32 a3_749;
					word32 a4_750;
					word32 a5_751;
					word32 a6_752;
					word32 a7_753;
					memcpy(*((word32) a0_140 + 4), s7_30, s1_146, out a1_748, out a2_175, out a3_749, out a4_750, out a5_751, out a6_752, out a7_753);
					word32 a1_754;
					word32 a5_755;
					if (pbuf_remove_header(a0_140, s1_146, a2_175, out a1_754, out a3, out a4_166, out a5_755) != 0x00)
					{
l23076D52:
						goto l23076D28;
					}
					word32 a0_193;
					word32 s1_770;
					word32 s2_771;
					word32 s3_772;
					Eq_2 s0_196 = pbuf_copy(a0_140, s0_108, out s1_770, out a0_193, out a3, out a4_166, out s2_771, out s3_772, out s4);
					if (a0_193 != 0x00)
						goto l23076D52;
					Eq_2 s5_229;
					word32 s0_773;
					word32 a0_774;
					word32 a1_775;
					word32 a2_776;
					word32 a3_777;
					word32 a4_778;
					word32 a5_779;
					word32 a7_780;
					word32 s8_781;
					ra = pbuf_free(ra, s0_196, a3, a4_166, s4, mstatus, dwArgF8, out s0_773, out s1_109, out a0_774, out a1_775, out a2_776, out a3_777, out a4_778, out a5_779, out a7_780, out s2_110, out s3_120, out s4, out s5_229, out s6_119, out s8_781, out mstatus);
					s0_108 = s5_229;
l23076D68:
					Eq_2 s5_245 = *((word32) s0_108 + 4);
					word32 a1_767;
					word32 a2_768;
					word32 a5_769;
					if (pbuf_add_header(s0_108, s1_109, out a1_767, out a2_768, out a3, out a4_250, out a5_769) == 0x00)
					{
						uint32 a5_277;
						Eq_430316 a5_253 = *((word32) s6_119 + 20);
						Eq_2 s0_254 = *((word32) s1_109 + 4);
						*((word32) s1_109 + 0x0C) = (byte) a5_253;
						*((word32) s1_109 + 0x0D) = (byte) (a5_253 >> 0x08);
						*((word32) s1_109 + 0x0E) = (byte) (a5_253 >> 0x10);
						*((word32) s1_109 + 0x0F) = (byte) (a5_253 >> 24);
						Eq_430346 a5_262 = *((word32) s6_119 + 16);
						*((word32) s1_109 + 16) = (byte) a5_262;
						*((word32) s1_109 + 0x0011) = (byte) (a5_262 >> 0x08);
						*((word32) s1_109 + 18) = (byte) (a5_262 >> 0x10);
						*((word32) s1_109 + 19) = (byte) (a5_262 >> 24);
						ui32 a5_270 = (word32) *((word32) s5_245 + 3);
						ui32 a4_271 = (word32) *((word32) s5_245 + 2);
						*s5_245 = 0x00;
						uint32 a5_274 = a5_270 << 8 | a4_271;
						if (a5_274 > 0x0FFFFFF7)
							a5_277 = a5_274 + 0x09;
						else
							a5_277 = a5_274 + 0x08;
						uint32 a5_280 = a5_277 << 16;
						*((word32) s5_245 + 2) = (byte) (a5_280 >> 16);
						*((word32) s5_245 + 3) = (byte) (a5_280 >> 24);
						*((word32) s1_109 + 8) = ~0x00;
						*((word32) s1_109 + 0x0A) = 0x00;
						*((word32) s1_109 + 11) = 0x00;
						word32 a2_782;
						word32 a3_783;
						word32 a4_784;
						word32 a5_785;
						Eq_2 a0_296 = inet_chksum(s1_109, s3_120, 0x0FFFFFF7, out a2_782, out a3_783, out a4_784, out a5_785);
						*((word32) s1_109 + 0x0A) = (byte) a0_296;
						*((word32) s1_109 + 11) = (byte) (a0_296 >> 8);
						s2_110->w0048 = (word16) ((word32) s2_110->w0048 + 0x01);
						word32 s1_786;
						word32 a0_787;
						word32 a1_788;
						word32 a5_789;
						word32 a7_790;
						word32 s2_791;
						word32 s3_792;
						word32 s4_793;
						word32 s5_794;
						word32 s6_795;
						word32 s7_796;
						word32 s8_797;
						word32 s9_798;
						ra = ip4_output_if(ra, s0_254, s1_109, s0_254, 0x4202692C, 0x00, 0x00FF, 0x00, 0x01, s4, s4, s5_245, s6_119, s7_30, out s0_108, out s1_786, out a0_787, out a1_788, out a3, out a4_250, out a5_789, out a7_790, out s2_791, out s3_792, out s4_793, out s5_794, out s6_795, out s7_796, out s8_797, out s9_798);
					}
					goto l23076E20;
				}
				goto l23076D2C;
			}
		}
	}
	struct Eq_429906 * s2_82;
	word32 s6_688;
	word32 mstatus_690;
	word32 s8_689;
	word32 s0_677;
	word32 a3_681;
	word32 a4_682;
	word32 a1_679;
	word32 a2_680;
	word32 s4_686;
	word32 a0_678;
	word32 s3_685;
	word32 a5_683;
	word32 s5_687;
	word32 a7_684;
	pbuf_free(ra, a0, a3, a4_26, s4, mstatus, dwArgF8, out s0_677, out s1_458, out a0_678, out a1_679, out a2_680, out a3_681, out a4_682, out a5_683, out a7_684, out s2_82, out s3_685, out s4_686, out s5_687, out s6_688, out s8_689, out mstatus_690);
	s2_82->w0052 = (word16) ((word32) s2_82->w0052 + 0x01);
	goto l23076CCA;
}

// 23076E72: Register Eq_2 icmp_dest_unreach(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_399784) s0Out, Register out (ptr32 Eq_399785) s1Out, Register out Eq_399786 a3Out, Register out (ptr32 Eq_399787) a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      ip4_input
//      udp_input
Eq_2 icmp_dest_unreach(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, struct Eq_399784 & s0Out, struct Eq_399785 & s1Out, union Eq_399786 & a3Out, struct Eq_399787 & a4Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	word32 a0_26;
	Eq_2 s0_31;
	struct Eq_430521 * s3_38;
	Eq_2 s5_44;
	Eq_2 s6_45;
	word32 a1_259;
	word32 a2_260;
	word32 a5_261;
	word32 a7_262;
	word32 s8_263;
	Eq_2 s4_135;
	struct Eq_399785 * s1_166;
	ptr32 s2_167;
	ptr32 mstatus_180;
	Eq_399786 a3_163;
	struct Eq_399787 * a4_164;
	Eq_2 ra_130 = pbuf_alloc(ra, s0, s1, 0x00A2, 36, 640, a3, a4, mstatus, dwLoc3C, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_31, out s1_166, out a0_26, out a1_259, out a2_260, out a3_163, out a4_164, out a5_261, out a7_262, out s2_167, out s3_38, out s4_135, out s5_44, out s6_45, out s8_263, out mstatus_180);
	if (a0_26 != 0x00)
	{
		Eq_2 a0_51 = *((word32) s0_31 + 4);
		Eq_2 s2_53 = s3_38->t0004;
		*s0_31 = 0x03;
		*((word32) s0_31 + 1) = (byte) s4_135;
		((word32) s0_31 + 4)->u0 = 0x00;
		*((word32) s0_31 + 5) = 0x00;
		*((word32) s0_31 + 6) = 0x00;
		((word32) s0_31 + 7)->u0 = 0x00;
		Eq_2 a2_69;
		Eq_2 a6_71;
		word32 a1_264;
		word32 a3_265;
		word32 a4_266;
		word32 a5_267;
		word32 a7_268;
		memcpy((word32) *((word32) a0_51 + 4) + 8, s3_38->t0004, 0x1C, out a1_264, out a2_69, out a3_265, out a4_266, out a5_267, out a6_71, out a7_268);
		Eq_2 s1_132 = a0_51;
		word32 a2_269;
		word32 a5_270;
		Eq_2 a4_126;
		Eq_2 a3_125;
		if (ip4_route(a2_69, (word32) *((word32) s2_53 + 0x0F) << 24 | (((word32) (*((word32) s2_53 + 0x0D)) << 8 | (word32) (*((word32) s2_53 + 0x0C))) | (word32) (*((word32) s2_53 + 0x0E)) << 16), out a2_269, out a3_125, out a4_126, out a5_270) != 0x00)
		{
			*((word32) s0_31 + 2) = 0x00;
			*((word32) s0_31 + 3) = 0x00;
			word32 a2_282;
			word32 a3_283;
			word32 a4_284;
			word32 a5_285;
			Eq_2 a0_100 = inet_chksum(s0_31, (word32) *((word32) a0_51 + 0x0A), a4_126, out a2_282, out a3_283, out a4_284, out a5_285);
			*((word32) s0_31 + 2) = (byte) a0_100;
			*((word32) s0_31 + 3) = (byte) (a0_100 >> 8);
			g_w42026838 = (word16) ((word32) g_w42026838 + 0x01);
			word32 s0_286;
			word32 a0_287;
			word32 a1_288;
			word32 a5_289;
			word32 a7_290;
			word32 s2_291;
			word32 s3_292;
			word32 s5_293;
			word32 s6_294;
			word32 s7_295;
			word32 s8_296;
			word32 s9_297;
			ra_130 = ip4_output_if(ra_130, s0_31, a0_51, a0_51, 0x00, fp + -36, 0x00FF, 0x00, 0x01, a6_71, s4_135, s5_44, s6_45, s7, out s0_286, out s1_132, out a0_287, out a1_288, out a3_125, out a4_126, out a5_289, out a7_290, out s2_291, out s3_292, out s4_135, out s5_293, out s6_294, out s7_295, out s8_296, out s9_297);
		}
		word32 s0_271;
		word32 a0_272;
		word32 a1_273;
		word32 a2_274;
		word32 a5_275;
		word32 a7_276;
		word32 s3_277;
		word32 s4_278;
		word32 s5_279;
		word32 s6_280;
		word32 s8_281;
		ra_130 = pbuf_free(ra_130, s1_132, a3_125, a4_126, s4_135, mstatus_180, dwArgE8, out s0_271, out s1_166, out a0_272, out a1_273, out a2_274, out a3_163, out a4_164, out a5_275, out a7_276, out s2_167, out s3_277, out s4_278, out s5_279, out s6_280, out s8_281, out mstatus_180);
	}
	s0Out = dwArg0158;
	s1Out = s1_166;
	a3Out = a3_163;
	a4Out = a4_164;
	s2Out = s2_167;
	s4Out = dwArgF4;
	mstatusOut = mstatus_180;
	return ra_130;
}

