pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23076F46: Register (ptr32 Eq_430764) dhcp_server_option_find(Register (ptr32 Eq_430764) a0, Register uint32 a1, Register int32 a2, Register out (ptr32 Eq_430764) a1Out, Register out Eq_430768 a4Out)
// Called from:
//      dhcp_server_recv
struct Eq_430764 * dhcp_server_option_find(struct Eq_430764 * a0, uint32 a1, int32 a2, struct Eq_430764 & a1Out, union Eq_430768 & a4Out)
{
	struct Eq_430764 * a1_5 = a0 + a1 / 2;
	for (; a0 < a1_5; a0 += ((word32) a0->b0001 + 0x02) / 2)
	{
		int32 a5_10 = (word32) a0->b0000;
		if (a5_10 == 0x00FF)
			break;
		if (a5_10 == a2)
			goto l23076F5A;
	}
	a0 = null;
l23076F5A:
	a1Out = a1_5;
	a4Out.u0 = 0x00FF;
	return a0;
}

// 23076F6A: Register (ptr32 Eq_430789) dhcp_client_find_by_ip.isra.0(Register Eq_2 a1, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_430793) a4Out, Register out ptr32 s8Out)
// Called from:
//      dhcp_server_recv
struct Eq_430789 * dhcp_client_find_by_ip.isra.0(Eq_2 a1, ptr32 & a1Out, ptr32 & a3Out, struct Eq_430793 & a4Out, ptr32 & s8Out)
{
	struct Eq_430793 * a4_13;
	struct Eq_430793 * a5_14;
	ptr32 a1_16;
	ptr32 a3_18;
	word32 a7_80;
	word32 a2_78;
	word32 a6_79;
	memcpy(fp + ~0x13, a1, 0x04, out a1_16, out a2_78, out a3_18, out a4_13, out a5_14, out a6_79, out a7_80);
	struct Eq_430789 * a0_28;
	for (a0_28 = fp + ~0x13; a0_28 != null; a0_28 = a0_28->ptr0000)
	{
		a0_28 = a4_13->ptr000C;
		if (a5_14 == a4_13)
			break;
	}
	a1Out = a1_16;
	a3Out = a3_18;
	a4Out = a4_13;
	s8Out = dwLoc1C;
	return a0_28;
}

// 23076F92: void dhcp_server_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
void dhcp_server_recv(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, word32 dwArg0198)
{
	Eq_2 a0_819;
	Eq_2 a3_162 = *a5;
	Eq_2 a4_100 = (word32) *((word32) a2 + 0x0A);
	Eq_2 s0_34 = a2;
	if (a4_100 <= 43)
	{
l23076FBE:
		a0_819 = s0_34;
		goto l23076FC0;
	}
	Eq_2 a0_43;
	word32 s5_1328;
	word32 s1_1321;
	word32 a1_1322;
	word32 s3_1327;
	word32 a5_1324;
	word32 s2_1326;
	word32 a7_1325;
	word32 s8_1330;
	word32 s6_1329;
	word32 a2_1323;
	ra = pbuf_alloc(ra, a2, a0, 0x00B6, 1500, 640, a3_162, a4_100, mstatus, a5, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_34, out s1_1321, out a0_43, out a1_1322, out a2_1323, out a3_162, out a4_100, out a5_1324, out a7_1325, out s2_1326, out s3_1327, out s4, out s5_1328, out s6_1329, out s8_1330, out mstatus);
	if (a0_43 == 0x00)
		goto l23076FBE;
	a4_100 = (word32) *((word32) a0_43 + 8);
	if (a4_100 < (word32) (*((word32) s0_34 + 8)))
		goto l23076FBE;
	Eq_2 s4_76;
	Eq_2 a4_79;
	Eq_2 a3_83;
	struct Eq_430916 * s1_102;
	word32 s8_1342;
	word32 a7_1340;
	word32 a5_1339;
	word32 a2_1338;
	word32 s3_1341;
	word32 s0_1335;
	word32 s2_1333;
	word32 a0_1332;
	word32 s1_1331;
	word32 s3_1334;
	word32 a1_1337;
	word32 a0_1336;
	Eq_2 s6_109;
	Eq_2 s5_108;
	Eq_2 s2_103;
	ra = pbuf_free(ra, pbuf_copy(a0_43, s0_34, out s1_1331, out a0_1332, out a3_83, out a4_79, out s2_1333, out s3_1334, out s4_76), a3_83, a4_79, s4_76, mstatus, dwArgE8, out s0_1335, out s1_102, out a0_1336, out a1_1337, out a2_1338, out a3_162, out a4_100, out a5_1339, out a7_1340, out s2_103, out s3_1341, out s4, out s5_108, out s6_109, out s8_1342, out mstatus);
	Eq_2 s0_118 = *((word32) s2_103 + 4);
	word32 s3_120 = (word32) *s0_118;
	if (s3_120 == 0x01)
	{
		a4_100.u0 = 1666417251;
		if (((word32) *((word32) s0_118 + 0x00EF) << 24 | (((word32) (*((word32) s0_118 + 0x00ED)) << 8 | (word32) (*((word32) s0_118 + 0x00EC))) | (word32) (*((word32) s0_118 + 0x00EE)) << 16)) != 1666417251)
			goto l23077234;
		Eq_2 s8_133 = (word32) *((word32) s0_118 + 2);
		if (s8_133 <= 0x06)
		{
			uint32 s4_139 = (word32) *((word32) s2_103 + 8) + -0x00F0 << 16;
			s4 = s4_139 >> 0x10;
			word32 a1_1343;
			struct Eq_431017 * a0_143 = dhcp_server_option_find((word32) s0_118 + 0x00F0, s4_139 >> 0x10, 53, out a1_1343, out a4_100);
			if (a0_143 == null)
				goto l23077234;
			Eq_2 a4_411;
			Eq_2 a3_399;
			Eq_2 s3_208;
			Eq_2 a1_413;
			word32 a1_305;
			word32 a5_147 = (word32) a0_143->b0002;
			if (a5_147 == s3_120)
			{
				Eq_2 s3_414 = s1_102->t000C;
				while (true)
				{
					word32 a1_426;
					if (s3_414 == 0x00)
						break;
					word32 a5_1347;
					word32 a4_1346;
					word32 a3_1345;
					word32 a2_1344;
					if (memcmp((word32) s3_414 + 4, (word32) s0_118 + 28, s8_133, out a1_426, out a2_1344, out a3_1345, out a4_1346, out a5_1347) == 0x00)
						goto l23077114;
					s3_414 = *s3_414;
				}
				word32 a4_1349;
				word32 a1_1348;
				struct Eq_431017 * a0_435 = dhcp_server_option_find((word32) s0_118 + 0x00F0, s4_139 >> 0x10, 50, out a1_1348, out a4_1349);
				if (a0_435 != null)
				{
					word32 a4_1351;
					word32 a3_1350;
					Eq_2 a0_443 = dhcp_client_find_by_ip.isra.0(&a0_435->b0002, out a1_426, out a3_1350, out a4_1351, out s8_133);
					s3_414 = a0_443;
					if (a0_443 != 0x00)
						goto l23077114;
				}
				while (true)
				{
					word32 s8_1403;
					Eq_2 a3_468;
					Eq_2 a4_469;
					word32 a1_1402;
					Eq_2 a0_465 = dhcp_client_find_by_ip.isra.0((char *) &s1_102->t000C + 0x0C, out a1_1402, out a3_468, out a4_469, out s8_1403);
					if (a0_465 == 0x00)
						break;
					word32 a4_1370;
					word32 a5_1371;
					word32 a3_1369;
					Eq_2 a0_821 = lwip_htonl(a0_465, out a3_1369, out a4_1370, out a5_1371);
					word32 s1_826 = *((word32) a0_821 + 20);
					Eq_2 s3_825 = (word32) a0_821 + 1;
					word32 a4_1373;
					word32 a3_1372;
					word32 a5_1374;
					Eq_2 a0_827 = lwip_htonl(a0_821, out a3_1372, out a4_1373, out a5_1374);
					if (a0_827 < (word32) a0_821 + 1)
					{
						s1_826 = (word32) *((word32) a0_827 + 16);
						word32 a3_1378;
						word32 a5_1380;
						word32 a4_1379;
						s3_825 = lwip_htonl(a0_827, out a3_1378, out a4_1379, out a5_1380);
					}
					word32 a5_1377;
					word32 a4_1376;
					word32 a3_1375;
					*((word32) lwip_htonl(s3_825, out a3_1375, out a4_1376, out a5_1377) + 24) = s1_826;
				}
				Eq_2 a0_487;
				word32 a7_1367;
				word32 a5_1366;
				word32 a1_1365;
				word32 s3_1368;
				mem_malloc(ra, s0_118, 0x14, a3_468, a4_469, s2_103, mstatus, s4, dwLoc0C, s3, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0148, out a0_487, out a1_1365, out a3_162, out a4_100, out a5_1366, out a7_1367, out s2_103, out s3_1368, out s4, out s5_108, out s6_109, out s8_133);
				s3_414 = a0_487;
				if (a0_487 != 0x00)
				{
					struct Eq_431297 * a5_515;
					word32 a3_1398;
					word32 a6_1400;
					word32 a7_1401;
					word32 a4_1399;
					word32 a2_1397;
					memcpy((word32) a0_487 + 4, (word32) s0_118 + 28, (word32) *((word32) s0_118 + 2), out a1_426, out a2_1397, out a3_1398, out a4_1399, out a5_515, out a6_1400, out a7_1401);
					*((word32) a0_487 + 0x0C) = a5_515;
					struct Eq_431322 * s1_529 = a5_515->ptr000C;
					*a0_487 = a5_515;
					s1_529->t000C = a0_487;
l23077114:
					*((word32) s3_414 + 16) = 0x80510100;
					*s0_118 = 0x02;
					*((word32) s0_118 + 3) = 0x00;
					*((word32) s0_118 + 8) = 0x00;
					*((word32) s0_118 + 9) = 0x00;
					word32 a7_1358;
					word32 a4_1355;
					word32 a3_1354;
					word32 a2_1353;
					word32 a1_1352;
					word32 a6_1357;
					word32 a5_1356;
					memcpy((word32) s0_118 + 20, a1_426 + 0x04, 0x04, out a1_1352, out a2_1353, out a3_1354, out a4_1355, out a5_1356, out a6_1357, out a7_1358);
					*((word32) s0_118 + 0x00ED) = 0x82;
					((word32) s0_118 + 0x00EC)->u0 = 99;
					*((word32) s0_118 + 0x00EF) = 99;
					((word32) s0_118 + 44)->u0 = 0x00;
					((word32) s0_118 + 0x006C)->u0 = 0x00;
					*((word32) s0_118 + 0x00EE) = 0x53;
					word32 a7_1364;
					word32 a4_1361;
					word32 a3_1360;
					word32 a2_1359;
					word32 a6_1363;
					word32 a5_1362;
					memcpy((word32) s0_118 + 16, (word32) s3_414 + 0x0C, 0x04, out a1_305, out a2_1359, out a3_1360, out a4_1361, out a5_1362, out a6_1363, out a7_1364);
					*((word32) s0_118 + 0x00F0) = 0x35;
					*((word32) s0_118 + 0x00F1) = 0x01;
					*((word32) s0_118 + 242) = 0x02;
					goto l23077184;
				}
			}
			else
			{
				if (a5_147 == 0x03)
				{
					s3_208 = s1_102->t000C;
					while (true)
					{
						word32 a1_220;
						if (s3_208 == 0x00)
							break;
						word32 a3_1408;
						word32 a2_1407;
						word32 a5_1410;
						word32 a4_1409;
						if (memcmp((word32) s3_208 + 4, (word32) s0_118 + 28, s8_133, out a1_220, out a2_1407, out a3_1408, out a4_1409, out a5_1410) == 0x00)
							goto l23077376;
						s3_208 = *s3_208.u0;
					}
					word32 a4_1411;
					word32 a1_230;
					struct Eq_431017 * a0_229 = dhcp_server_option_find((word32) s0_118 + 0x00F0, s4_139 >> 0x10, 50, out a1_230, out a4_1411);
					if (a0_229 != null)
					{
						word32 a3_1431;
						word32 a4_1432;
						Eq_2 a0_236 = dhcp_client_find_by_ip.isra.0(&a0_229->b0002, out a1_230, out a3_1431, out a4_1432, out s8_133);
						s3_208 = a0_236;
						if (a0_236 != 0x00)
						{
							word32 a4_1435;
							word32 a5_1436;
							word32 a3_1434;
							word32 a2_1433;
							if (memcmp((word32) a0_236 + 4, (word32) s0_118 + 28, (word32) *((word32) s0_118 + 2), out a1_220, out a2_1433, out a3_1434, out a4_1435, out a5_1436) == 0x00)
							{
l23077376:
								*((word32) s3_208 + 16) = 0x80510100;
								*s0_118 = 0x02;
								*((word32) s0_118 + 3) = 0x00;
								*((word32) s0_118 + 8) = 0x00;
								*((word32) s0_118 + 9) = 0x00;
								word32 a4_1440;
								word32 a5_1441;
								word32 a7_1443;
								word32 a6_1442;
								word32 a3_1439;
								word32 a1_1437;
								word32 a2_1438;
								memcpy((word32) s0_118 + 20, a1_220 + 0x04, 0x04, out a1_1437, out a2_1438, out a3_1439, out a4_1440, out a5_1441, out a6_1442, out a7_1443);
								*((word32) s0_118 + 0x00ED) = 0x82;
								((word32) s0_118 + 0x00EC)->u0 = 99;
								*((word32) s0_118 + 0x00EF) = 99;
								((word32) s0_118 + 44)->u0 = 0x00;
								((word32) s0_118 + 0x006C)->u0 = 0x00;
								*((word32) s0_118 + 0x00EE) = 0x53;
								word32 a2_1444;
								word32 a5_1447;
								word32 a6_1448;
								word32 a7_1449;
								word32 a4_1446;
								word32 a3_1445;
								memcpy((word32) s0_118 + 16, (word32) s3_208 + 0x0C, 0x04, out a1_305, out a2_1444, out a3_1445, out a4_1446, out a5_1447, out a6_1448, out a7_1449);
								*((word32) s0_118 + 0x00F0) = 0x35;
								*((word32) s0_118 + 0x00F1) = 0x01;
								*((word32) s0_118 + 242) = 0x05;
l23077184:
								*((word32) s0_118 + 0x00F3) = 0x36;
								((word32) s0_118 + 244)->u0 = 0x04;
								word32 a6_1459;
								word32 a7_1460;
								word32 a5_1458;
								word32 a4_1457;
								word32 a3_1456;
								word32 a2_1455;
								word32 a1_1454;
								memcpy((word32) s0_118 + 0x00F5, a1_305 + 0x04, 0x04, out a1_1454, out a2_1455, out a3_1456, out a4_1457, out a5_1458, out a6_1459, out a7_1460);
								*((word32) s0_118 + 0x00F9) = 0x33;
								*((word32) s0_118 + 0x00FA) = 0x04;
								word32 a1_631;
								word32 a4_1463;
								word32 a7_1466;
								word32 a6_1465;
								word32 a5_1464;
								word32 a3_1462;
								word32 a2_1461;
								memcpy((word32) s0_118 + 0x00FB, fp + -52, 0x04, out a1_631, out a2_1461, out a3_1462, out a4_1463, out a5_1464, out a6_1465, out a7_1466);
								*((word32) s0_118 + 0x00FF) = 0x01;
								((word32) s0_118 + 0x0100)->u0 = 0x04;
								word32 a1_651;
								word32 a5_1470;
								word32 a7_1472;
								word32 a6_1471;
								word32 a4_1469;
								word32 a2_1467;
								word32 a3_1468;
								memcpy((word32) s0_118 + 0x0101, a1_631 + 0x08, 0x04, out a1_651, out a2_1467, out a3_1468, out a4_1469, out a5_1470, out a6_1471, out a7_1472);
								*((word32) s0_118 + 261) = 0x06;
								*((word32) s0_118 + 262) = 0x04;
								word32 a1_671;
								word32 a4_1475;
								word32 a5_1476;
								word32 a7_1478;
								word32 a6_1477;
								word32 a3_1474;
								word32 a2_1473;
								memcpy((word32) s0_118 + 263, a1_651 + 0x04, 0x04, out a1_671, out a2_1473, out a3_1474, out a4_1475, out a5_1476, out a6_1477, out a7_1478);
								*((word32) s0_118 + 267) = 0x03;
								((word32) s0_118 + 268)->u0 = 0x04;
								word32 a1_1479;
								word32 a5_1482;
								word32 a6_1483;
								word32 a7_1484;
								word32 a4_1481;
								word32 a2_1480;
								memcpy((word32) s0_118 + 269, a1_671 + 0x04, 0x04, out a1_1479, out a2_1480, out a3_399, out a4_1481, out a5_1482, out a6_1483, out a7_1484);
								*((word32) s0_118 + 0x0111) = ~0x00;
								s4.u0 = 0x01;
								s3_208.u0 = 0x04;
								a4_411 = (word32) *((word32) s2_103 + 8);
								if (a4_411 <= 0x0112)
									goto l23077222;
								a1_413.u0 = 0x0112;
l2307721C:
								word32 s4_1490;
								word32 a2_1486;
								word32 a5_1488;
								word32 s3_1489;
								word32 a3_1487;
								word32 s1_1485;
								ra = pbuf_realloc(ra, s0_118, s2_103, a1_413, a3_399, a4_411, s2_103, s3_208, s4, mstatus, s4, s1, dwArg88, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0128, out s1_1485, out a2_1486, out a3_1487, out a4_411, out a5_1488, out s2_103, out s3_1489, out s4_1490, out s5_108, out s6_109, out s8_133, out mstatus);
l23077222:
								word32 s3_1404;
								word32 s7_1405;
								word32 s8_1406;
								ra = udp_sendto_if(ra, s5_108, s2_103, fp + -56, s6_109, a4_411, s8_133, mstatus, s4, dwArg38, s9, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out a3_162, out a4_100, out s2_103, out s3_1404, out s4, out s7_1405, out s8_1406, out mstatus);
								goto l23077234;
							}
							word32 a2_1451;
							word32 a5_1453;
							word32 a4_1452;
							word32 a0_1450;
							puts(588003348, out a0_1450, out a1_230, out a2_1451, out a4_1452, out a5_1453, out s4, out s8_133);
						}
					}
					*s0_118 = 0x02;
					*((word32) s0_118 + 3) = 0x00;
					*((word32) s0_118 + 8) = 0x00;
					*((word32) s0_118 + 9) = 0x00;
					word32 a2_1413;
					word32 a1_1412;
					word32 a3_1414;
					word32 a4_1415;
					word32 a6_1417;
					word32 a5_1416;
					word32 a7_1418;
					memcpy((word32) s0_118 + 20, a1_230 + 0x04, 0x04, out a1_1412, out a2_1413, out a3_1414, out a4_1415, out a5_1416, out a6_1417, out a7_1418);
					*((word32) s0_118 + 0x00ED) = 0x82;
					*((word32) s0_118 + 0x00EE) = 0x53;
					((word32) s0_118 + 0x00EC)->u0 = 99;
					*((word32) s0_118 + 0x00EF) = 99;
					((word32) s0_118 + 44)->u0 = 0x00;
					((word32) s0_118 + 0x006C)->u0 = 0x00;
					word32 a1_372;
					word32 a0_1420;
					word32 a5_1424;
					word32 a3_1422;
					word32 a4_1423;
					word32 a2_1421;
					word32 t1_1419;
					ra = memset(ra, (word32) s0_118 + 16, 0x00, 0x04, out t1_1419, out a0_1420, out a1_372, out a2_1421, out a3_1422, out a4_1423, out a5_1424);
					*((word32) s0_118 + 0x00F0) = 0x35;
					*((word32) s0_118 + 0x00F1) = 0x01;
					*((word32) s0_118 + 242) = 0x06;
					*((word32) s0_118 + 0x00F3) = 0x36;
					((word32) s0_118 + 244)->u0 = 0x04;
					word32 a1_1425;
					word32 a5_1428;
					word32 a7_1430;
					word32 a6_1429;
					word32 a4_1427;
					word32 a2_1426;
					memcpy((word32) s0_118 + 0x00F5, a1_372 + 0x04, 0x04, out a1_1425, out a2_1426, out a3_399, out a4_1427, out a5_1428, out a6_1429, out a7_1430);
					*((word32) s0_118 + 0x00F9) = ~0x00;
					a4_411 = (word32) *((word32) s2_103 + 8);
					if (a4_411 <= 0x00FA)
						goto l23077222;
					a1_413.u0 = 0x00FA;
					goto l2307721C;
				}
				a4_100.u0 = 0x07;
				if (a5_147 == 0x07)
				{
					Eq_2 s3_150 = s1_102->t000C;
					s4.u0 = 0x00;
					while (s3_150 != 0x00)
					{
						word32 a1_1491;
						word32 a2_1492;
						word32 a5_1493;
						Eq_2 a0_160 = memcmp((word32) s3_150 + 4, (word32) s0_118 + 28, (word32) *((word32) s0_118 + 2), out a1_1491, out a2_1492, out a3_162, out a4_100, out a5_1493);
						struct Eq_431883 * a5_166 = *s3_150;
						if (a0_160 == 0x00)
						{
							word32 s1_169 = *((byte) a4_100.u0 + 0x0C);
							if (a4_100 == s3_150)
								a5_166->dw000C = s1_169;
							else
								*s4.u0 = a5_166;
							word32 s6_1500;
							word32 s8_1501;
							word32 a5_1496;
							word32 s5_1499;
							word32 a7_1497;
							word32 s3_1498;
							word32 a1_1495;
							word32 s1_1494;
							mem_free(s3_150, a3_162, a4_100, s2_103, s3_150, s4, mstatus, a5, dwLoc38, dwLoc1C, dwArg44, dwArg64, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_1494, out a1_1495, out a3_162, out a4_100, out a5_1496, out a7_1497, out s2_103, out s3_1498, out s4, out s5_1499, out s6_1500, out s8_1501);
							break;
						}
						s4 = s3_150;
						s3_150 = a5_166->t0000;
					}
				}
			}
		}
	}
l23077234:
	a0_819 = s2_103;
l23076FC0:
	word32 s6_1394;
	word32 s5_1393;
	word32 s8_1395;
	word32 a1_1384;
	word32 s4_1392;
	word32 a5_1388;
	word32 s0_1381;
	word32 mstatus_1396;
	word32 s2_1390;
	word32 s3_1391;
	word32 a7_1389;
	word32 a3_1386;
	word32 a4_1387;
	word32 a2_1385;
	word32 a0_1383;
	word32 s1_1382;
	pbuf_free(ra, a0_819, a3_162, a4_100, s4, mstatus, dwArgE8, out s0_1381, out s1_1382, out a0_1383, out a1_1384, out a2_1385, out a3_1386, out a4_1387, out a5_1388, out a7_1389, out s2_1390, out s3_1391, out s4_1392, out s5_1393, out s6_1394, out s8_1395, out mstatus_1396);
	0x00 = dwArg0198;
}

// 230773EA: Register Eq_2 dhcp_server_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg74, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      dhcpd_start
Eq_2 dhcp_server_start(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg74, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, union Eq_2 & a3Out)
{
	int32 a5_19 = g_dw4200F698;
	while (true)
	{
		ptr32 a0_121;
		if (a5_19 == 0x00)
			break;
		int32 * a5_22 = *((word32) a4 + 4);
		if (a4 == a0)
		{
			*((word32) a4 + 16) = a5_22;
			*((word32) a4 + 20) = a5_22;
			*((word32) a4 + 24) = a5_22;
			goto l2307743A;
		}
		a5_19 = *a5_22;
	}
	Eq_2 a0_47;
	union Eq_2 * s2_57;
	struct Eq_432021 ** s3_58;
	word32 s4_59;
	word32 s8_268;
	word32 s6_267;
	word32 s5_266;
	word32 a7_265;
	word32 a5_264;
	word32 a4_263;
	word32 a1_262;
	mem_malloc(ra, s0, 0x1C, a3, a4, 0x4200F698, mstatus, dwLoc0C, dwArg14, dwArg74, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out a0_47, out a1_262, out a3, out a4_263, out a5_264, out a7_265, out s2_57, out s3_58, out s4_59, out s5_266, out s6_267, out s8_268);
	if (a0_47 != 0x00)
	{
		Eq_2 a0_72;
		Eq_2 a3_75;
		Eq_2 a4_76;
		word32 a5_272;
		word32 a2_271;
		word32 a1_270;
		word32 t1_269;
		Eq_2 ra_78 = memset(ra, a0_47, 0x00, 0x1C, out t1_269, out a0_72, out a1_270, out a2_271, out a3_75, out a4_76, out a5_272);
		Eq_2 a5_81 = *s2_57;
		*((word32) a0_47 + 4) = s4_59;
		*((word32) a0_47 + 0x0C) = 0x00;
		*a5_81 = a0_47;
		*s2_57 = (union Eq_2 *) a0_47;
		*((word32) a5_81 + 16) = a0_47;
		struct Eq_432021 * a5_88 = *s3_58;
		a5_88->t0014 = a0_47;
		Eq_2 s1_90 = a5_88->t0000;
		a5_88->t0018 = a0_47;
		word32 a4_274;
		word32 s1_273;
		word32 a5_275;
		ra = udp_new(ra_78, s1_90, a3_75, a4_76, mstatus, out s1_273, out a3, out a4_274, out a5_275);
		*((word32) a0_72 + 8) = a0_47;
		if (a0_72 != 0x00)
		{
			*((word32) a0_72 + 9) = (byte) ((word32) *((word32) a0_72 + 9) | 32);
			word32 a4_276;
			word32 a5_277;
			Eq_2 a0_110 = udp_bind(a0_72, 588036828, (union Eq_2 *) 67, out a3, out a4_276, out a5_277);
			udp_recv(a0_110, &g_t23076F92, *((word32) a0_110 + 8));
l2307743A:
			a0_121 = 0x00;
l23077418:
			a0Out = a0_121;
			a3Out = a3;
			return ra;
		}
	}
	a0_121 = ~0x00;
	goto l23077418;
}

// 230774A2: void dhcp_server_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void dhcp_server_stop(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	int32 s0_13 = g_dw4200F698;
	Eq_2 s1_12 = 0x4200F698;
	while (s0_13 != 0x00)
	{
		int32 * s0_16 = g_ptr4200F004;
		if (a0 == 0x4200F000)
		{
			Eq_2 s0_18 = *((word32) a0 + 8);
			if (a0 != 0x00)
			{
				word32 a0_240;
				word32 a2_241;
				word32 a5_242;
				s1_12 = udp_remove(a0, a3, mstatus, out a0_240, out a2_241, out a3, out a4, out a5_242);
			}
			*s1_12 = 0x00;
			word32 s1_228;
			word32 a1_229;
			word32 a3_230;
			word32 a4_231;
			word32 a5_232;
			word32 a7_233;
			word32 s2_234;
			word32 s3_235;
			word32 s4_236;
			word32 s5_237;
			word32 s6_238;
			word32 s8_239;
			mem_free(s0_18, a3, a4, s2, s3, s4, mstatus, s0, dwLoc08, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s1_228, out a1_229, out a3_230, out a4_231, out a5_232, out a7_233, out s2_234, out s3_235, out s4_236, out s5_237, out s6_238, out s8_239);
			return;
		}
		s0_13 = *s0_16;
	}
	word32 a2_212;
	word32 s5_220;
	word32 a3_213;
	word32 a4_214;
	word32 a5_215;
	word32 s6_221;
	word32 s2_217;
	word32 a7_216;
	word32 s4_219;
	word32 s3_218;
	word32 a1_211;
	word32 a0_210;
	word32 s1_209;
	word32 s7_222;
	word32 s8_223;
	word32 s9_224;
	word32 s10_225;
	word32 s11_226;
	word32 t4_227;
	printf(ra, &g_t230C3840, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_209, out a0_210, out a1_211, out a2_212, out a3_213, out a4_214, out a5_215, out a7_216, out s2_217, out s3_218, out s4_219, out s5_220, out s6_221, out s7_222, out s8_223, out s9_224, out s10_225, out s11_226, out t4_227);
}

