pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 230774F0: void dhcpd_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void dhcpd_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	struct Eq_274 * a0_324;
	ptr32 mstatus_27;
	Eq_2 s1_30;
	Eq_2 s3_34;
	Eq_2 s7_38;
	Eq_2 ra_28 = dhcp_stop(ra, s0, s3, s4, s7, mstatus, dwLoc2C, s2, dwLoc18, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, out s1_30, out s3_34, out s7_38, out mstatus_27);
	Eq_2 s1_57;
	Eq_2 s0_56 = set_if(ra_28, s1_30, 0x230C388C, 0x230B2104, 0x230C387C, s3_34, s7_38, mstatus_27, dwLoc38, s2, s0, dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg38, dwArg48, dwArg68, dwArgE8, out s1_57);
	ptr32 mstatus_84;
	word32 s3_487;
	word32 s2_486;
	word32 a1_485;
	Eq_2 ra_311 = netif_set_up(ra_28, s0_56, s1_57, mstatus_27, dwLoc38, dwLoc30, dwLoc1C, dwArg18, dwArg28, dwArg48, s3, s1, dwArg68, dwArg70, dwArg74, dwArg88, dwArg98, dwArgC8, dwArg0148, out a1_485, out s2_486, out s3_487, out mstatus_84);
	word32 a2_489;
	word32 a3_490;
	word32 a4_491;
	word32 a5_492;
	word32 a1_488;
	word32 a6_493;
	word32 a7_494;
	memcpy(fp + -52, (word32) s0_56 - 0x0774, 0x0E, out a1_488, out a2_489, out a3_490, out a4_491, out a5_492, out a6_493, out a7_494);
	word32 a1_495;
	word32 a2_496;
	word32 a4_497;
	word32 a5_498;
	Eq_2 a3_124;
	Eq_2 a0_127 = strchr(fp + -52, 46, out a1_495, out a2_496, out a3_124, out a4_497, out a5_498);
	Eq_2 dwLoc28_408 = (uint32) (word16) s2;
	if (a0_127 != 0x00)
	{
		word32 a1_499;
		word32 a2_500;
		word32 a4_501;
		word32 a5_502;
		Eq_2 a0_138 = strchr((word32) a0_127 + 1, 46, out a1_499, out a2_500, out a3_124, out a4_501, out a5_502);
		if (a0_138 != 0x00)
		{
			word32 a1_503;
			word32 a2_504;
			word32 a4_505;
			word32 a5_506;
			Eq_2 a0_149 = strchr((word32) a0_138 + 1, 46, out a1_503, out a2_504, out a3_124, out a4_505, out a5_506);
			if (a0_149 != 0x00)
			{
				Eq_2 a3_186;
				word32 s3_217;
				word32 s2_241;
				Eq_2 a3_256;
				Eq_2 a3_278;
				Eq_2 a4_279;
				Eq_2 s1_282;
				word32 a0_298;
				word32 s0_507;
				word32 s1_508;
				word32 a0_509;
				word32 a1_510;
				word32 a2_511;
				word32 a4_512;
				word32 a5_513;
				word32 s2_514;
				word32 s3_515;
				word32 s4_516;
				word32 s5_517;
				word32 s6_518;
				word32 s7_519;
				word32 s8_520;
				word32 s9_521;
				word32 s10_522;
				word32 s11_523;
				word32 a0_524;
				word32 a4_525;
				word32 a5_526;
				word32 s4_527;
				word32 s8_528;
				word32 s1_529;
				word32 a0_530;
				word32 a1_531;
				word32 a2_532;
				word32 a3_533;
				word32 a4_534;
				word32 a5_535;
				word32 a7_536;
				word32 s2_537;
				word32 s4_538;
				word32 s5_539;
				word32 s6_540;
				word32 s7_541;
				word32 s8_542;
				word32 s9_543;
				word32 s10_544;
				word32 s11_545;
				word32 t4_546;
				word32 s0_547;
				word32 s1_548;
				word32 a0_549;
				word32 a1_550;
				word32 a2_551;
				word32 a4_552;
				word32 a5_553;
				word32 s3_554;
				word32 s4_555;
				word32 s5_556;
				word32 s6_557;
				word32 s7_558;
				word32 s8_559;
				word32 s9_560;
				word32 s10_561;
				word32 s11_562;
				word32 a0_563;
				word32 a4_564;
				word32 a5_565;
				word32 s4_566;
				word32 s8_567;
				word32 a0_568;
				word32 a1_569;
				word32 a2_570;
				word32 a5_571;
				word32 a7_572;
				word32 s2_573;
				word32 s3_574;
				word32 s4_575;
				word32 s5_576;
				word32 s6_577;
				word32 s7_578;
				word32 s8_579;
				word32 s9_580;
				word32 s10_581;
				word32 s11_582;
				word32 t4_583;
				ra_311 = dhcp_server_start(printf(sprintf(printf(sprintf(ra_311, (word32) a0_149 + 1, &g_t230C7894, dwLoc28_408, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_507, out s1_508, out a0_509, out a1_510, out a2_511, out a4_512, out a5_513, out s2_514, out s3_515, out s4_516, out s5_517, out s6_518, out s7_519, out s8_520, out s9_521, out s10_522, out s11_523), &g_t230C38C0, a3_186, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_529, out a0_530, out a1_531, out a2_532, out a3_533, out a4_534, out a5_535, out a7_536, out s2_537, out s3_217, out s4_538, out s5_539, out s6_540, out s7_541, out s8_542, out s9_543, out s10_544, out s11_545, out t4_546), ip4addr_aton(fp + -52, fp + -60, out a0_524, out a3_186, out a4_525, out a5_526, out s4_527, out s8_528), s3_217 + -1900, dwLoc28_408, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_547, out s1_548, out a0_549, out a1_550, out a2_551, out a4_552, out a5_553, out s2_241, out s3_554, out s4_555, out s5_556, out s6_557, out s7_558, out s8_559, out s9_560, out s10_561, out s11_562), s2_241 + -0x0740, a3_256, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_282, out a0_568, out a1_569, out a2_570, out a3_278, out a4_279, out a5_571, out a7_572, out s2_573, out s3_574, out s4_575, out s5_576, out s6_577, out s7_578, out s8_579, out s9_580, out s10_581, out s11_582, out t4_583), ip4addr_aton(fp + -52, fp + -56, out a0_563, out a3_256, out a4_564, out a5_565, out s4_566, out s8_567), s1_282, a3_278, a4_279, mstatus_84, dwLoc2C, dwArg34, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0128, out a0_298, out a3_124);
				if (a0_298 == 0x00)
					return;
				a0_324 = (struct Eq_274 *) &g_t230C38D8;
l23077554:
				word32 s1_584;
				word32 a0_585;
				word32 a1_586;
				word32 a2_587;
				word32 a3_588;
				word32 a4_589;
				word32 a5_590;
				word32 a7_591;
				word32 s2_592;
				word32 s3_593;
				word32 s4_594;
				word32 s5_595;
				word32 s6_596;
				word32 s7_597;
				word32 s8_598;
				word32 s9_599;
				word32 s10_600;
				word32 s11_601;
				word32 t4_602;
				printf(ra_311, a0_324, a3_124, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_584, out a0_585, out a1_586, out a2_587, out a3_588, out a4_589, out a5_590, out a7_591, out s2_592, out s3_593, out s4_594, out s5_595, out s6_596, out s7_597, out s8_598, out s9_599, out s10_600, out s11_601, out t4_602);
				return;
			}
		}
	}
	a0_324 = (struct Eq_274 *) &g_t230C389C;
	goto l23077554;
}

// 230775E0: void iperf_server_udp_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack word32 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ipus_test_cmd
void iperf_server_udp_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, word32 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	Eq_2 a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 1, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 0x230776B0, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

