pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23077614: void iperf_client_udp_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack word32 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ipu_test_cmd
void iperf_client_udp_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, word32 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	Eq_2 a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 4, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 587692566, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 23077648: void iperf_server_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack word32 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ips_test_cmd
void iperf_server_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, word32 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	Eq_2 a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 4, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 0x23077C90, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 2307767C: void iperf_client_tcp_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack word32 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ipc_test_cmd
void iperf_client_tcp_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, word32 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	Eq_2 a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 4, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 0x23077EE8, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 230776B0: void iperf_server_udp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void iperf_server_udp(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a0 == 0x00)
	{
		word32 a5_326;
		user_vAssertCalled(a4, mstatus, out a5_326);
	}
	Eq_2 a2_173;
	Eq_2 a5_176;
	Eq_2 s1_177;
	Eq_2 a3_23;
	Eq_2 s1_26;
	word32 a5_325;
	word32 a4_324;
	Eq_2 ra_139 = udp_new(ra, a0, a3, a4, mstatus, out s1_26, out a3_23, out a4_324, out a5_325);
	if (a0 == 0x00)
	{
		word32 s5_341;
		word32 s6_342;
		word32 s7_343;
		word32 s10_346;
		word32 s8_344;
		word32 s9_345;
		word32 a3_335;
		word32 s3_339;
		word32 s4_340;
		word32 a7_337;
		word32 s2_338;
		word32 a4_336;
		word32 a1_334;
		word32 a0_333;
		word32 s11_347;
		word32 t4_348;
		printf(ra_139, &g_t230C3A80, a3_23, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_177, out a0_333, out a1_334, out a2_173, out a3_335, out a4_336, out a5_176, out a7_337, out s2_338, out s3_339, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out s9_345, out s10_346, out s11_347, out t4_348);
	}
	else
	{
		struct Eq_274 * a0_136;
		word32 s4_329;
		word32 a3_328;
		word32 a0_327;
		word32 s8_330;
		Eq_2 s0_127 = ipaddr_addr(s1_26, out a0_327, out a3_328, out s4_329, out s8_330);
		word32 a4_331;
		word32 a5_332;
		Eq_2 a3_118;
		if (udp_bind(s0_127, fp + -84, (union Eq_2 *) 0x01000389, out a3_118, out a4_331, out a5_332) != 0x00)
			a0_136 = (struct Eq_274 *) &g_t230C3AA4;
		else
		{
			word32 s1_349;
			word32 a0_350;
			word32 a1_351;
			word32 a2_352;
			word32 a3_353;
			word32 a4_354;
			word32 a5_355;
			word32 a7_356;
			word32 s2_357;
			word32 s3_358;
			word32 s4_359;
			word32 s5_360;
			word32 s6_361;
			word32 s7_362;
			word32 s8_363;
			word32 s9_364;
			word32 s10_365;
			word32 s11_366;
			word32 t4_367;
			word32 t1_368;
			word32 a0_369;
			word32 a1_370;
			word32 a2_371;
			word32 a5_372;
			Eq_2 a4_117;
			ra_139 = memset(printf(ra_139, &g_t230C3AB4, a3_118, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_349, out a0_350, out a1_351, out a2_352, out a3_353, out a4_354, out a5_355, out a7_356, out s2_357, out s3_358, out s4_359, out s5_360, out s6_361, out s7_362, out s8_363, out s9_364, out s10_365, out s11_366, out t4_367), fp + -80, 0x00, 64, out t1_368, out a0_369, out a1_370, out a2_371, out a3_118, out a4_117, out a5_372);
			udp_recv(s0_127, &g_t2307775E, fp + -80);
			Eq_2 a5_105 = ~0x00;
			Eq_2 a2_106 = fp + -80;
			while (a5_105 == 0x00)
			{
				word32 s1_384;
				word32 a0_385;
				word32 a1_386;
				word32 s2_387;
				word32 s3_388;
				word32 s4_389;
				s0_127 = vTaskDelay(1000, a2_106, a3_118, a4_117, a5_105, mstatus, dwLoc3C, dwLoc38, dwArgD8, dwArg0118, out s1_384, out a0_385, out a1_386, out a2_106, out a3_118, out a4_117, out a5_105, out s2_387, out s3_388, out s4_389);
			}
			a0_136 = (struct Eq_274 *) &g_t230C3AD4;
		}
		Eq_2 a3_150;
		word32 s1_390;
		word32 a0_391;
		word32 a1_392;
		word32 a2_393;
		word32 a4_394;
		word32 a5_395;
		word32 a7_396;
		word32 s2_397;
		word32 s3_398;
		word32 s4_399;
		word32 s5_400;
		word32 s6_401;
		word32 s7_402;
		word32 s8_403;
		word32 s9_404;
		word32 s10_405;
		word32 s11_406;
		word32 t4_407;
		printf(ra_139, a0_136, a3_118, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_390, out a0_391, out a1_392, out a2_393, out a3_150, out a4_394, out a5_395, out a7_396, out s2_397, out s3_398, out s4_399, out s5_400, out s6_401, out s7_402, out s8_403, out s9_404, out s10_405, out s11_406, out t4_407);
		word32 a0_408;
		word32 a3_409;
		word32 a4_410;
		s1_177 = udp_remove(s0_127, a3_150, mstatus, out a0_408, out a2_173, out a3_409, out a4_410, out a5_176);
	}
	word32 s0_373;
	word32 s1_374;
	word32 a0_375;
	word32 a1_376;
	word32 a2_377;
	word32 a3_378;
	word32 a4_379;
	word32 a5_380;
	word32 a6_381;
	word32 s4_382;
	word32 t3_383;
	vPortFree(s1_177, a2_173, a5_176, mstatus, dwArgF8, dwArg0138, out s0_373, out s1_374, out a0_375, out a1_376, out a2_377, out a3_378, out a4_379, out a5_380, out a6_381, out s4_382, out t3_383);
}

// 2307775E: void iperf_server_udp_recv_fn(Register Eq_2 ra, Register word32 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack word32 dwArg0144)
void iperf_server_udp_recv_fn(Eq_2 ra, word32 s1, Eq_2 a0, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg98, word32 dwArg0144)
{
	Eq_2 s5_11 = a2;
	word32 t1_768;
	word32 a2_771;
	word32 a4_773;
	word32 a1_770;
	word32 a3_772;
	word32 a0_769;
	word32 a5_774;
	Eq_2 ra_296 = memset(ra, fp + -96, 0x00, 32, out t1_768, out a0_769, out a1_770, out a2_771, out a3_772, out a4_773, out a5_774);
	if (a2 == 0x00)
		return;
	word32 a1_52;
	struct Eq_433214 * a5_56;
	word32 a2_775;
	word32 a3_776;
	Eq_2 a4_55;
	Eq_2 a0_51 = bl_timer_now_us(out a1_52, out a2_775, out a3_776, out a4_55, out a5_56);
	Eq_2 s9_63 = *((word32) a0 + 24);
	*((word32) a0_51 + 32) = a0;
	Eq_2 s4_302 = a0_51;
	if (s9_63 == 0x00)
		s9_63 = a0_51;
	struct Eq_433237 * s0_69 = *((word32) a4_55 + 28);
	s0_69->t0018 = s9_63;
	if (a4_55 == 0x00)
		a4_55 = a0_51;
	Eq_2 a5_111;
	*((word32) a4_55 + 28) = s0_69;
	up32 s2_79 = (word32) *((word32) a2 + 8);
	struct Eq_433255 * s1_90 = s1 + (s2_79 + 54);
	struct Eq_433259 * s0_89 = a5_56->ptr0004;
	s1_90->ptr0030 = s0_89;
	Eq_2 s2_93 = (word32) (s1_90 < s2_79 + 54) + a1_52;
	s0_89->t0034 = s2_93;
	a5_56->ptr0005 = s0_89;
	struct Eq_433277 * a5_97 = *((word32) a2 + 4);
	Eq_2 a3_104 = (word32) a5_97->b0000 << 24 | (word32) a5_97->b0001 << 16 | (word32) a5_97->b0003;
	Eq_2 s3_107 = (word32) a5_97->b0002 << 8 | a3_104;
	if (s3_107 < 0x00)
	{
		a5_97->b000C = 0x80;
		a5_97->b000D = 0x00;
		a5_97->b000E = 0x00;
		a5_97->b000F = 0x00;
		a5_97->b0010 = 0x00;
		a5_97->b0011 = 0x00;
		a5_97->b0012 = 0x00;
		a5_97->b0013 = 0x00;
		a5_97->b0018 = 0x00;
		a5_97->b0019 = 0x00;
		a5_97->b0014 = ~0x00;
		a5_97->b0015 = ~0x00;
		a5_97->b0016 = ~0x00;
		a5_97->b0017 = 0x80;
		a5_97->b001A = 0x00;
		a5_97->b001B = 0x00;
		a5_97->b001C = 0x00;
		a5_97->b001D = 0x00;
		a5_97->b001E = 0x00;
		a5_97->b001F = 0x00;
		a5_97->b0020 = ~0x00;
		a5_97->b0021 = ~0x00;
		a5_97->b0022 = ~0x00;
		a5_97->b0023 = 0x80;
		a5_97->b0024 = ~0x00;
		a5_97->b0025 = ~0x00;
		a5_97->b0026 = ~0x00;
		a5_97->b0027 = 0x80;
		a5_97->b0028 = ~0x00;
		a5_97->b0029 = ~0x00;
		a5_97->b002A = ~0x00;
		a5_97->b002B = 0x80;
		word32 s1_777;
		Eq_2 s4_390;
		Eq_2 s5_391;
		Eq_2 s6_392;
		Eq_2 s7_393;
		Eq_2 s8_394;
		Eq_2 s0_415;
		word32 a1_779;
		word32 a0_778;
		word32 a2_780;
		word32 a3_781;
		word32 s2_785;
		word32 a5_783;
		word32 a4_782;
		word32 a7_784;
		word32 s11_789;
		word32 s9_787;
		word32 s10_788;
		word32 s3_786;
		word32 s1_791;
		word32 a0_792;
		word32 a2_793;
		word32 a4_794;
		word32 s9_795;
		word32 t4_790;
		ra_296 = udp_sendto(printf(ra_296, &g_t230C3AF4, 0x00FFFFFF, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_777, out a0_778, out a1_779, out a2_780, out a3_781, out a4_782, out a5_783, out a7_784, out s2_785, out s3_786, out s4_390, out s5_391, out s6_392, out s7_393, out s8_394, out s9_787, out s10_788, out s11_789, out t4_790), s6_392, s5_391, s7_393, s8_394, s4_390, mstatus, dwLoc7C, dwLoc68, dwLoc48, dwLoc18, dwLoc08, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg98, out s0_415, out s1_791, out a0_792, out a2_793, out a3_104, out a4_794, out s3_107, out s4_302, out s5_11, out s9_795, out mstatus);
		*(union Eq_2 *) 0x01 = s0_415;
		a5_111.u0 = 0x01;
	}
	else
	{
		a5_111.u0 = 499999;
		if (a0_51 - a4_55 > 499999)
		{
			word32 a0_122;
			struct Eq_433542 * a1_123;
			ptr32 fflags_131;
			ptr32 frm_132;
			int32 s2_134;
			word32 s5_799;
			word32 a5_797;
			word32 s4_798;
			word32 a3_796;
			word32 s7_801;
			word32 s9_802;
			word32 s6_800;
			word32 fa0_803;
			struct Eq_433255 * s1_133 = __floatundisf(ra_296, s1_90, s2_93, fflags, frm, out a0_122, out a1_123, out a3_796, out a5_797, out s2_134, out s4_798, out s5_799, out s6_800, out s7_801, out s9_802, out fa0_803, out fflags_131, out frm_132);
			struct Eq_433255 * a0_154 = s1_133 + a0_122 / 52;
			real32 fs1_150 = g_r230C4AEC;
			Eq_2 s0_152 = a1_123->t002C;
			a0_154->t0028 = s0_152;
			Eq_2 a1_158 = a1_123 + s2_134 / 48 + (word32) (a0_154 < s1_133) / 48;
			*((word32) a1_158 + 44) = s0_152;
			real32 fs2_162 = g_r230C4AF0;
			struct Eq_433612 * a0_164;
			Eq_2 a3_167;
			struct Eq_433614 * a5_169;
			Eq_8966 fa0_172;
			ptr32 fflags_173;
			ptr32 frm_174;
			word32 s4_178;
			word32 s9_183;
			word32 s5_806;
			word32 s2_805;
			word32 a1_804;
			word32 s6_807;
			word32 s7_808;
			__floatundisf(ra_296, a0_154, a1_158, fflags_131, frm_132, out a0_164, out a1_804, out a3_167, out a5_169, out s2_805, out s4_178, out s5_806, out s6_807, out s7_808, out s9_183, out fa0_172, out fflags_173, out frm_174);
			real32 fa5_194 = fa0_172 * fs1_150 / (real32) (s4_178 - s9_183);
			Eq_8966 fs2_195 = fa5_194 * fs2_162;
			struct Eq_433647 * a5_197 = (word32) (a5_169->r0038 < fa5_194);
			if (a5_197 != null)
				*((word32) s0_152 + 56) = s0_152;
			if ((word32) (fa5_194 < a5_197->r003C) != 0x00)
				*((word32) s0_152 + 60) = s0_152;
			Eq_8966 fs0_209 = a0_164->t0038;
			word32 a1_825;
			__extendsfdf2(ra_296, fa0_172, fflags_173, frm_174, out a1_825);
			word32 a1_826;
			__extendsfdf2(ra_296, fs0_209, fflags_173, frm_174, out a1_826);
			Eq_2 a1_241;
			__extendsfdf2(ra_296, fs0_209, fflags_173, frm_174, out a1_241);
			Eq_2 a1_250;
			__extendsfdf2(ra_296, fs2_195, fflags_173, frm_174, out a1_250);
			0x00 = dwArg0144;
			Eq_2 a3_265;
			struct Eq_433724 * a5_289;
			Eq_2 a4_294;
			word32 s0_827;
			word32 s1_828;
			word32 a0_829;
			word32 a1_830;
			word32 a2_831;
			word32 a4_832;
			word32 a5_833;
			word32 a7_834;
			word32 s2_835;
			word32 s3_836;
			word32 s4_837;
			word32 s5_838;
			word32 s6_839;
			word32 s7_840;
			word32 s8_841;
			word32 s9_842;
			word32 s10_843;
			word32 s11_844;
			word32 s1_845;
			word32 a0_846;
			word32 a1_847;
			word32 a2_848;
			word32 a7_849;
			word32 s2_850;
			word32 s6_851;
			word32 s7_852;
			word32 s8_853;
			word32 s9_854;
			word32 s10_855;
			word32 s11_856;
			word32 t4_857;
			ra_296 = printf(snprintf(ra_296, fp + -96, 32, &g_t230C3B24, dwLoc78, s6, dwLoc2C, a1_250, a1_241, dwArg18, dwArg3C, out s0_827, out s1_828, out a0_829, out a1_830, out a2_831, out a3_265, out a4_832, out a5_833, out a7_834, out s2_835, out s3_836, out s4_837, out s5_838, out s6_839, out s7_840, out s8_841, out s9_842, out s10_843, out s11_844), &g_t230C6978, a3_265, a3_167, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_845, out a0_846, out a1_847, out a2_848, out a3_104, out a4_294, out a5_289, out a7_849, out s2_850, out s3_107, out s4_302, out s5_11, out s6_851, out s7_852, out s8_853, out s9_854, out s10_855, out s11_856, out t4_857);
			Eq_2 s0_311 = *((word32) a4_294 + 20);
			a5_289->t001C = s0_311;
			*(union Eq_2 *) 48 = s0_311;
			Eq_2 s0_316 = *(union Eq_2 *) 0x0C;
			((word32) s0_316 + 52)->u0 = 0x00;
			*((word32) s0_316 + 20) = 0x00;
			*((word32) a4_294 + 0x0C) = s0_316;
			a5_111 = a4_294;
		}
	}
	struct Eq_433519 * s0_436 = *((byte) a5_111.u0 + 8);
	Eq_2 a4_437 = (byte) a5_111.u0 + 1;
	if (s3_107 != a4_437)
	{
		if (a5_111 >= s3_107)
		{
			*((byte) a5_111.u0 + 21) = *((byte) a5_111.u0 + 20);
			goto l230778EE;
		}
		s0_436 = (struct Eq_433519 *) *((word32) a4_437 + 16);
		(s3_107 - a5_111 + ((word32) a4_437 - 1))->ptr0010 = s0_436;
		a4_437 = (word32) a4_437 - 1;
	}
	else if (a5_111 >= s3_107)
		goto l230778EE;
	s0_436->t0008 = s3_107;
l230778EE:
	word32 a3_814;
	word32 a4_815;
	word32 a2_813;
	word32 s3_819;
	word32 a5_816;
	word32 a7_817;
	word32 s2_818;
	word32 s6_822;
	word32 s8_823;
	word32 s4_820;
	word32 s5_821;
	word32 s0_809;
	word32 a0_811;
	word32 a1_812;
	word32 s1_810;
	word32 mstatus_824;
	pbuf_free(ra_296, s5_11, a3_104, a4_437, s4_302, mstatus, dwArg98, out s0_809, out s1_810, out a0_811, out a1_812, out a2_813, out a3_814, out a4_815, out a5_816, out a7_817, out s2_818, out s3_819, out s4_820, out s5_821, out s6_822, out s8_823, out mstatus_824);
}

