pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23077A16: void iperf_client_udp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98)
void iperf_client_udp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98)
{
	Eq_2 dwLoc98 = (word32) qwLoc98;
	Eq_2 dwLocD8 = (word32) qwLocD8;
	Eq_2 a3_44;
	Eq_2 a4_45;
	Eq_2 a5_46;
	word32 a0_1268;
	word32 t1_1267;
	word32 a1_1269;
	word32 a2_1270;
	Eq_2 ra_47 = memset(ra, fp + -0x00A0, 0x00, 64, out t1_1267, out a0_1268, out a1_1269, out a2_1270, out a3_44, out a4_45, out a5_46);
	word32 a0_52;
	word32 a3_1273;
	word32 a1_1272;
	word32 s2_1276;
	word32 a6_1275;
	word32 s1_1271;
	word32 a4_1274;
	word32 s4_1277;
	word32 s8_1278;
	Eq_2 s3_62;
	Eq_2 a5_57;
	Eq_2 a2_54;
	pvPortMalloc(ra_47, s1, 1300, a3_44, a4_45, a5_46, mstatus, dwLocA0, dwLoc9C, SLICE(s5, word32, 32), dwArg58, dwArg98, out s1_1271, out a0_52, out a1_1272, out a2_54, out a3_1273, out a4_1274, out a5_57, out a6_1275, out s2_1276, out s3_62, out s4_1277, out s8_1278);
	Eq_2 dwLoc58_1134 = s5;
	if (a0_52 != 0x00)
	{
		int32 a5_68;
		for (a5_68 = 0x00; a5_68 != 1300; ++a5_68)
		{
			Eq_2 a3_72 = a0_52 + a5_68;
			*a3_72 = (byte) a5_68;
		}
		Eq_2 a2_584;
		Eq_2 a3_585;
		Eq_2 a4_586;
		Eq_2 a5_587;
		Eq_2 a3_84;
		word32 s2_1290;
		word32 s5_1291;
		Eq_2 a0_103 = lwip_socket(ra_47, 0x02, 0x11, a3_72, mstatus, dwLocAC, s10, s2, s1, dwLoc38, s9, s1, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg88, out a3_84, out s2_1290, out s5_1291);
		if (a0_103 < 0x00)
		{
			word32 s1_1304;
			word32 s4_1310;
			word32 s11_1317;
			word32 t4_1318;
			word32 s5_1311;
			word32 s7_1313;
			word32 s6_1312;
			word32 s10_1316;
			word32 s8_1314;
			word32 s9_1315;
			word32 s3_1309;
			word32 s2_1308;
			word32 a0_1305;
			word32 a1_1306;
			word32 a7_1307;
			printf(ra_47, &g_t230C39BC, a3_84, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, s1, dwLoc24, out s1_1304, out a0_1305, out a1_1306, out a2_584, out a3_585, out a4_586, out a5_587, out a7_1307, out s2_1308, out s3_1309, out s4_1310, out s5_1311, out s6_1312, out s7_1313, out s8_1314, out s9_1315, out s10_1316, out s11_1317, out t4_1318);
		}
		else
		{
			word32 t1_1292;
			word32 a1_1294;
			word32 a2_1295;
			word32 a3_1296;
			word32 a0_1293;
			word32 a4_1297;
			word32 a5_1298;
			Eq_2 ra_114 = memset(ra_47, fp + -0x00C0, 0x00, 0x10, out t1_1292, out a0_1293, out a1_1294, out a2_1295, out a3_1296, out a4_1297, out a5_1298);
			word32 a5_1299;
			lwip_htons(0x0100038A, out a5_1299);
			word32 s4_1302;
			word32 s8_1303;
			word32 a3_1301;
			word32 a0_1300;
			ipaddr_addr(0x230B2104, out a0_1300, out a3_1301, out s4_1302, out s8_1303);
			word32 a0_148;
			Eq_2 a3_151;
			lwip_bind(a0_103, fp + -0x00C0, mstatus, dwLocAC, dwLoc98, s5, dwLoc18, out a0_148, out a3_151);
			if (a0_148 != ~0x00)
			{
				word32 s2_186;
				Eq_2 s3_187;
				word32 a4_1340;
				word32 a5_1341;
				word32 s8_1330;
				word32 a1_1337;
				word32 a2_1338;
				word32 a3_1339;
				word32 s9_1331;
				word32 s11_1333;
				word32 s10_1332;
				word32 a0_1336;
				word32 t4_1334;
				word32 t1_1335;
				word32 a1_1320;
				word32 s5_1327;
				word32 s6_1328;
				word32 s7_1329;
				word32 a2_1321;
				word32 a4_1323;
				word32 a3_1322;
				word32 s4_1326;
				word32 a5_1324;
				word32 a7_1325;
				word32 a0_1319;
				Eq_2 s1_183;
				Eq_2 ra_205 = memset(printf(ra_114, &g_t230C3AB4, a3_151, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, s1, dwLoc24, out s1_183, out a0_1319, out a1_1320, out a2_1321, out a3_1322, out a4_1323, out a5_1324, out a7_1325, out s2_186, out s3_187, out s4_1326, out s5_1327, out s6_1328, out s7_1329, out s8_1330, out s9_1331, out s10_1332, out s11_1333, out t4_1334), fp + -0x00B0, 0x00, 0x10, out t1_1335, out a0_1336, out a1_1337, out a2_1338, out a3_1339, out a4_1340, out a5_1341);
				word32 a5_1342;
				lwip_htons(s2_186 + 905, out a5_1342);
				Eq_2 a0_214;
				word32 s8_1345;
				word32 a3_1343;
				word32 s4_1344;
				Eq_2 s0_222 = ipaddr_addr(s3_187, out a0_214, out a3_1343, out s4_1344, out s8_1345);
				word32 a5_1346;
				Eq_2 a0_233 = xTaskGetTickCount(out a5_1346);
				Eq_8966 fs3_236 = g_t230C4A7C;
				real32 fs5_238 = g_r230C49B4;
				Eq_8966 fs4_240 = 0x00;
				real32 fs2_241 = g_r230C49B8;
				Eq_2 s11_243 = a0_233;
				Eq_2 s4_244 = 0x01;
				struct Eq_433255 * s3_245 = null;
				word32 s5_246 = 0x00;
				int32 s10_247 = 0x00;
				up32 s2_248 = s2_186 + 903;
l23077B78:
				word32 a5_1383;
				up32 a5_254 = xTaskGetTickCount(out a5_1383) - s11_243;
				if (s2_248 < a5_254)
				{
					struct Eq_433255 * s10_264 = s3_245 + s10_247 / 52;
					real32 fa0_284;
					word32 s6_292;
					word32 s7_293;
					word32 s9_1382;
					word32 s2_1379;
					word32 s4_1380;
					word32 s5_1381;
					word32 a0_1375;
					word32 a5_1378;
					word32 a1_1376;
					word32 a3_1377;
					__floatundisf(ra_205, s10_264, s5_246 + (s10_247 >> 0x1F) + (word32) (s10_264 < s3_245), fflags, frm, out a0_1375, out a1_1376, out a3_1377, out a5_1378, out s2_1379, out s4_1380, out s5_1381, out s6_292, out s7_293, out s9_1382, out fa0_284, out fflags, out frm);
					Eq_8966 fs0_309 = (real32) s10_247 / fs5_238 / (real32) a5_254 * fs2_241 / fs2_241;
					Eq_8966 fs1_313 = fa0_284 / fs5_238 / (real32) (s7_293 - s6_292) * fs2_241 / fs2_241;
					if ((word32) (fs0_309 < fs3_236) != 0x00)
						fs3_236 = fs0_309;
					if ((word32) (fs4_240 < fs0_309) != 0x00)
						fs4_240 = fs0_309;
					word32 a1_1415;
					__extendsfdf2(ra_205, fs3_236, fflags, frm, out a1_1415);
					Eq_2 a1_345;
					Eq_2 a0_344 = __extendsfdf2(ra_205, fs0_309, fflags, frm, out a1_345);
					Eq_2 a1_353;
					__extendsfdf2(ra_205, fs4_240, fflags, frm, out a1_353);
					Eq_2 a1_362;
					__extendsfdf2(ra_205, fs1_313, fflags, frm, out a1_362);
					dwLoc58_1134 = a1_345;
					Eq_2 a3_377;
					word32 s9_393;
					word32 s9_1445;
					word32 t4_1446;
					word32 s8_1444;
					word32 s7_1443;
					word32 s5_1441;
					word32 s6_1442;
					word32 a7_1438;
					word32 s2_1439;
					word32 s3_1440;
					word32 a3_1435;
					word32 a4_1436;
					word32 a5_1437;
					word32 a2_1434;
					word32 s7_1428;
					word32 s10_1430;
					word32 s8_1429;
					word32 a1_1433;
					word32 s11_1431;
					word32 a0_1432;
					word32 s4_1425;
					word32 s5_1426;
					word32 s6_1427;
					word32 s2_1423;
					word32 s3_1424;
					word32 a7_1422;
					word32 a4_1420;
					word32 a5_1421;
					word32 a1_1418;
					word32 a2_1419;
					word32 s1_1416;
					word32 a0_1417;
					ra_205 = printf(snprintf(ra_205, fp + -0x00A0, 64, (word32) a0_344 - 0x062C, dwLocC8, dwLocA8, s4, a1_362, a1_353, dwLoc38, dwLoc14, out s0_222, out s1_1416, out a0_1417, out a1_1418, out a2_1419, out a3_377, out a4_1420, out a5_1421, out a7_1422, out s2_1423, out s3_1424, out s4_1425, out s5_1426, out s6_1427, out s7_1428, out s8_1429, out s9_393, out s10_1430, out s11_1431), s9_393 + -0x0688, a3_377, a0_344, dwLocB8, dwLoc70, dwLoc6C, a0_214, dwLoc24, out s1_183, out a0_1432, out a1_1433, out a2_1434, out a3_1435, out a4_1436, out a5_1437, out a7_1438, out s2_1439, out s3_1440, out s4_244, out s5_1441, out s6_1442, out s7_1443, out s8_1444, out s9_1445, out s10_247, out s11_243, out t4_1446);
				}
				word32 a3_1372;
				word32 a4_1373;
				word32 a5_1374;
				*lwip_htonl(s4_244, out a3_1372, out a4_1373, out a5_1374) = s0_222;
				*((word32) s0_222 + 4) = 0x00;
				*((word32) s0_222 + 8) = 0x00;
				do
				{
					Eq_2 a0_445;
					Eq_2 a2_447;
					word32 s4_459;
					word32 s8_1384;
					ra_205 = lwip_sendto(ra_205, s0_222, s1_183, mstatus, dwLocB8, dwLocA8, dwLoc98, s2, dwLoc6C, dwLoc68, dwLoc58_1134, dwLoc38, dwLoc28, dwLoc18, s1, out s0_222, out s1_183, out a0_445, out a2_447, out s2_248, out s3_245, out s4_459, out s5_246, out s8_1384, out mstatus);
					if (a0_445 > 0x00)
					{
						s10_247 = (word32) a0_445 + s10_247;
l23077C5E:
						s4_244 = s4_459 + 0x01;
						goto l23077B78;
					}
					if (a0_445 == 0x00)
						goto l23077C5E;
				} while (a0_445 == ~0x00);
				Eq_2 a2_475;
				Eq_2 a3_476;
				Eq_2 a4_477;
				Eq_2 a5_478;
				word32 s3_1385;
				lwip_close(ra_205, s1_183, a2_447, mstatus, dwLoc98, dwLoc68, dwLoc58_1134, dwLoc28, dwLoc18, s9, dwArg28, dwArg48, dwArg68, out a2_475, out a3_476, out a4_477, out a5_478, out s3_1385);
				Eq_2 a3_500;
				word32 s2_1392;
				word32 s3_1393;
				word32 s4_1394;
				word32 a2_1389;
				word32 a4_1390;
				word32 a5_1391;
				word32 a1_1388;
				word32 s1_1386;
				word32 a0_1387;
				vTaskDelay(2000, a2_475, a3_476, a4_477, a5_478, mstatus, dwLocBC, dwLocB8, dwArg58, dwArg98, out s1_1386, out a0_1387, out a1_1388, out a2_1389, out a3_500, out a4_1390, out a5_1391, out s2_1392, out s3_1393, out s4_1394);
				Eq_2 a5_516;
				Eq_2 a2_519;
				Eq_2 a3_520;
				Eq_2 a4_521;
				word32 s5_1402;
				word32 t4_1409;
				word32 s6_1403;
				word32 s8_1405;
				word32 s7_1404;
				word32 s11_1408;
				word32 s9_1406;
				word32 s10_1407;
				word32 s2_1399;
				word32 s3_1400;
				word32 s4_1401;
				word32 s1_1395;
				word32 a7_1398;
				word32 a0_1396;
				word32 a1_1397;
				printf(ra_205, &g_t230C39F4, a3_500, a0_445, dwLocB8, dwLoc70, dwLoc6C, a0_214, dwLoc24, out s1_1395, out a0_1396, out a1_1397, out a2_519, out a3_520, out a4_521, out a5_516, out a7_1398, out s2_1399, out s3_1400, out s4_1401, out s5_1402, out s6_1403, out s7_1404, out s8_1405, out s9_1406, out s10_1407, out s11_1408, out t4_1409);
				word32 s2_1414;
				word32 a4_1412;
				word32 a5_1413;
				word32 a0_1410;
				word32 a3_1411;
				vTaskDelete(0x00, a2_519, a3_520, a4_521, a5_516, mstatus, dwArg48, dwArg58, dwArg88, dwArg98, out a0_1410, out a3_1411, out a4_1412, out a5_1413, out s2_1414);
				return;
			}
			Eq_2 a2_563;
			Eq_2 s1_568;
			word32 s11_1362;
			word32 t4_1363;
			word32 s3_1364;
			word32 s9_1360;
			word32 s10_1361;
			word32 s6_1357;
			word32 s8_1359;
			word32 s7_1358;
			word32 a0_1347;
			word32 s3_1354;
			word32 s4_1355;
			word32 s5_1356;
			word32 a1_1348;
			word32 a4_1350;
			word32 a3_1349;
			word32 s2_1353;
			word32 a5_1351;
			word32 a7_1352;
			lwip_close(printf(ra_114, &g_t230C3AA4, a3_151, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, s1, dwLoc24, out s1_568, out a0_1347, out a1_1348, out a2_563, out a3_1349, out a4_1350, out a5_1351, out a7_1352, out s2_1353, out s3_1354, out s4_1355, out s5_1356, out s6_1357, out s7_1358, out s8_1359, out s9_1360, out s10_1361, out s11_1362, out t4_1363), s1_568, a2_563, mstatus, dwLoc98, dwLoc68, s5, dwLoc28, dwLoc18, s9, dwArg28, dwArg48, dwArg68, out a2_584, out a3_585, out a4_586, out a5_587, out s3_1364);
		}
		word32 a4_1369;
		word32 s2_1370;
		word32 s4_1371;
		word32 s1_1365;
		word32 a3_1368;
		word32 a0_1366;
		word32 a1_1367;
		vTaskDelay(1000, a2_584, a3_585, a4_586, a5_587, mstatus, dwLocBC, dwLocB8, dwArg58, dwArg98, out s1_1365, out a0_1366, out a1_1367, out a2_54, out a3_1368, out a4_1369, out a5_57, out s2_1370, out s3_62, out s4_1371);
	}
	word32 a3_1284;
	word32 a5_1286;
	word32 a0_1281;
	word32 s1_1280;
	word32 a1_1282;
	word32 s0_1279;
	word32 a2_1283;
	word32 a4_1285;
	word32 t3_1289;
	word32 s4_1288;
	word32 a6_1287;
	vPortFree(s3_62, a2_54, a5_57, mstatus, dwArg78, s0, out s0_1279, out s1_1280, out a0_1281, out a1_1282, out a2_1283, out a3_1284, out a4_1285, out a5_1286, out a6_1287, out s4_1288, out t3_1289);
}

// 23077C90: void iperf_server(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8)
void iperf_server(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8)
{
	uint16 wLoc8E_940 = SLICE(dwLoc90, uint16, 16);
	Eq_2 a2_607;
	Eq_2 a5_610;
	Eq_2 s1_611;
	Eq_2 a3_45;
	Eq_2 a4_46;
	Eq_2 a5_47;
	word32 a2_1035;
	word32 t1_1032;
	word32 a0_1033;
	word32 a1_1034;
	Eq_2 ra_48 = memset(ra, fp + -0x0080, 0x00, 32, out t1_1032, out a0_1033, out a1_1034, out a2_1035, out a3_45, out a4_46, out a5_47);
	word32 a0_53;
	Eq_2 a3_56;
	word32 a1_1037;
	word32 a5_1040;
	word32 s4_1044;
	word32 a2_1038;
	word32 a4_1039;
	word32 s8_1045;
	word32 a6_1041;
	word32 s2_1042;
	word32 s3_1043;
	word32 s1_1036;
	pvPortMalloc(ra_48, a0, 0x01000450, a3_45, a4_46, a5_47, mstatus, dwLoc90, dwLoc8C, SLICE(a0, word32, 32), dwArg68, s4, out s1_1036, out a0_53, out a1_1037, out a2_1038, out a3_56, out a4_1039, out a5_1040, out a6_1041, out s2_1042, out s3_1043, out s4_1044, out s8_1045);
	Eq_2 dwLoc48_744 = a0;
	Eq_2 dwLoc4C_765 = SLICE(s3, word32, 32);
	if (a0_53 == 0x00)
	{
		word32 s6_1056;
		word32 a7_1051;
		word32 s10_1060;
		word32 s9_1059;
		word32 s4_1054;
		word32 a3_1049;
		word32 s11_1061;
		word32 t4_1062;
		word32 s5_1055;
		word32 s7_1057;
		word32 s8_1058;
		word32 a4_1050;
		word32 s2_1052;
		word32 s3_1053;
		word32 a0_1047;
		word32 a1_1048;
		printf(ra_48, &g_t230C3A10, a3_56, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, out s1_611, out a0_1047, out a1_1048, out a2_607, out a3_1049, out a4_1050, out a5_610, out a7_1051, out s2_1052, out s3_1053, out s4_1054, out s5_1055, out s6_1056, out s7_1057, out s8_1058, out s9_1059, out s10_1060, out s11_1061, out t4_1062);
	}
	else
	{
		Eq_2 a2_555;
		Eq_2 a5_558;
		Eq_2 s3_564;
		Eq_2 a3_74;
		word32 s2_80;
		word32 s5_1046;
		Eq_2 a0_93 = lwip_socket(ra_48, 0x01, 0x00, a3_56, mstatus, dwLoc9C, s6, dwLoc68, dwLoc38, dwLoc28, s5, dwArg18, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, out a3_74, out s2_80, out s5_1046);
		if (a0_93 < 0x00)
		{
			word32 a4_1086;
			word32 s7_1092;
			word32 t4_1097;
			word32 s8_1093;
			word32 s9_1094;
			word32 s10_1095;
			word32 s11_1096;
			word32 s6_1091;
			word32 a7_1087;
			word32 s2_1088;
			word32 s4_1089;
			word32 s5_1090;
			word32 s1_1082;
			word32 a0_1083;
			word32 a1_1084;
			word32 a3_1085;
			printf(ra_48, &g_t230C3A1C, a3_74, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, out s1_1082, out a0_1083, out a1_1084, out a2_555, out a3_1085, out a4_1086, out a5_558, out a7_1087, out s2_1088, out s3_564, out s4_1089, out s5_1090, out s6_1091, out s7_1092, out s8_1093, out s9_1094, out s10_1095, out s11_1096, out t4_1097);
		}
		else
		{
			struct Eq_274 * a0_520;
			word32 a5_1074;
			lwip_htons(s2_80 + 905, out a5_1074);
			word32 a0_1076;
			word32 a5_1081;
			word32 a1_1077;
			word32 a2_1078;
			word32 a3_1079;
			word32 a4_1080;
			word32 t1_1075;
			Eq_2 ra_111 = memset(ra_48, fp + -0x0098, 0x00, 0x08, out t1_1075, out a0_1076, out a1_1077, out a2_1078, out a3_1079, out a4_1080, out a5_1081);
			word32 a0_117;
			Eq_2 a3_120;
			Eq_2 s0_125 = lwip_bind(a0_93, fp + -0x00A0, mstatus, dwLoc9C, dwLoc88, a0, dwLoc08, out a0_117, out a3_120);
			if (a0_117 == ~0x00)
				a0_520 = (struct Eq_274 *) &g_t230C3A2C;
			else
			{
				word32 a0_143;
				word32 s2_153;
				s0_125 = lwip_listen(s0_125, 0x05, mstatus, dwLoc8C, s6, 0x00, s5, out a0_143, out a3_120, out s2_153);
				if (a0_143 != s2_153)
				{
					Eq_8966 fs3_167 = g_t230C4A7C;
					real32 fs5_169 = g_r230C49B4;
					Eq_8966 fs4_171 = 0x00;
					real32 fs2_172 = g_r230C49B8;
l23077DAE:
					Eq_2 ra_194 = lwip_accept(ra_111, s0_125, a3_120, mstatus, dwLocCC, 0x10, dwLocA8, dwLoc68, dwLoc48_744, dwLoc2C, dwLoc28, dwLoc08, dwArg18, dwArg28, dwArg68, out mstatus);
					Eq_2 a3_215;
					word32 a2_1135;
					word32 a4_1136;
					word32 a5_1137;
					Eq_2 a0_212 = ip4addr_ntoa(out a2_1135, out a3_215, out a4_1136, out a5_1137);
					word32 a5_1138;
					lwip_htons((word32) wLoc8E_940, out a5_1138);
					Eq_2 s1_246;
					word32 t4_1156;
					word32 s11_1155;
					word32 s10_1154;
					word32 s9_1153;
					word32 s8_1152;
					word32 s6_1150;
					word32 s7_1151;
					word32 s4_1148;
					word32 s5_1149;
					word32 s3_1147;
					word32 s2_1146;
					word32 a3_1142;
					word32 a4_1143;
					word32 a5_1144;
					word32 a7_1145;
					word32 a0_1139;
					word32 a1_1140;
					word32 a2_1141;
					ra_111 = printf(ra_194, &g_t230C3A50, a3_215, a0_212, dwLocA8, dwLoc60, dwLoc5C, 0x00, dwLoc14, out s1_246, out a0_1139, out a1_1140, out a2_1141, out a3_1142, out a4_1143, out a5_1144, out a7_1145, out s2_1146, out s3_1147, out s4_1148, out s5_1149, out s6_1150, out s7_1151, out s8_1152, out s9_1153, out s10_1154, out s11_1155, out t4_1156);
					word32 s4_1158;
					word32 s2_1157;
					word32 s6_280;
					Eq_2 s1_275;
					up32 s8_281;
					lwip_setsockopt(s1_246, 0x06, 0x01, fp + -0x00A4, mstatus, dwLocCC, dwLoc4C_765, 0x00, dwLoc18, s5, dwArg28, dwArg48, out s1_275, out s2_1157, out s4_1158, out s6_280, out s8_281);
					word32 a5_1159;
					Eq_2 s10_292 = xTaskGetTickCount(out a5_1159);
					while (true)
					{
						Eq_2 s11_295 = s6_280 + 1104;
						do
						{
							int32 a0_303;
							Eq_2 a2_305;
							struct Eq_433255 * s2_312;
							word32 s4_314;
							word32 s9_316;
							s0_125 = lwip_recv(s1_275, s11_295, out s1_275, out a0_303, out a2_305, out a3_120, out s2_312, out s4_314, out s9_316);
							if (a0_303 <= 0x00)
							{
								if (s1_275 >= 0x00)
								{
									word32 s3_1163;
									word32 a5_1162;
									word32 a4_1161;
									word32 a2_1160;
									s0_125 = lwip_close(ra_111, s1_275, a2_305, mstatus, dwLoc88, s5, dwLoc48_744, dwLoc18, dwLoc08, s5, dwArg38, dwArg58, dwArg78, out a2_1160, out a3_120, out a4_1161, out a5_1162, out s3_1163);
								}
								goto l23077DAE;
							}
							int32 s9_346 = s9_316 + a0_303;
							word32 a5_1126;
							up32 a5_350 = xTaskGetTickCount(out a5_1126) - s10_292;
						} while (s8_281 >= a5_350);
						struct Eq_433255 * s9_359 = s2_312 + s9_346 / 52;
						real32 fa0_379;
						word32 s5_386;
						word32 s7_388;
						word32 s9_1134;
						word32 s2_1131;
						word32 s4_1132;
						word32 s6_1133;
						word32 a0_1127;
						word32 a1_1128;
						word32 a3_1129;
						word32 a5_1130;
						__floatundisf(ra_111, s9_359, s4_314 + (s9_346 >> 0x1F) + (word32) (s9_359 < s2_312), fflags, frm, out a0_1127, out a1_1128, out a3_1129, out a5_1130, out s2_1131, out s4_1132, out s5_386, out s6_1133, out s7_388, out s9_1134, out fa0_379, out fflags, out frm);
						Eq_8966 fs0_405 = (real32) s9_346 / fs5_169 / (real32) a5_350 * fs2_172 / fs2_172;
						Eq_8966 fs1_410 = fa0_379 / fs5_169 / (real32) (s7_388 - s5_386) * fs2_172 / fs2_172;
						if ((word32) (fs0_405 < fs3_167) != 0x00)
							fs3_167 = fs0_405;
						if ((word32) (fs4_171 < fs0_405) != 0x00)
							fs4_171 = fs0_405;
						word32 a1_1164;
						__extendsfdf2(ra_111, fs3_167, fflags, frm, out a1_1164);
						Eq_2 a1_441;
						Eq_2 a0_440 = __extendsfdf2(ra_111, fs0_405, fflags, frm, out a1_441);
						Eq_2 a1_449;
						dwLocCC = __extendsfdf2(ra_111, fs4_171, fflags, frm, out a1_449);
						Eq_2 a1_458;
						__extendsfdf2(ra_111, fs1_410, fflags, frm, out a1_458);
						dwLoc48_744 = a1_441;
						dwLoc4C_765 = a1_449;
						Eq_2 a3_474;
						word32 t4_1197;
						word32 s7_1194;
						word32 s9_1195;
						word32 s11_1196;
						word32 s3_1191;
						word32 s4_1192;
						word32 s5_1193;
						word32 a5_1188;
						word32 a7_1189;
						word32 s2_1190;
						word32 a2_1185;
						word32 a3_1186;
						word32 a4_1187;
						word32 s11_1182;
						word32 a0_1183;
						word32 a1_1184;
						word32 s8_1179;
						word32 s9_1180;
						word32 s10_1181;
						word32 s5_1176;
						word32 s6_1177;
						word32 s7_1178;
						word32 s2_1173;
						word32 s3_1174;
						word32 s4_1175;
						word32 a4_1170;
						word32 a5_1171;
						word32 a7_1172;
						word32 a0_1167;
						word32 a1_1168;
						word32 a2_1169;
						word32 s1_1166;
						word32 s0_1165;
						ra_111 = printf(snprintf(ra_111, fp + -0x0080, 32, &g_t230C39D4, dwLocB8, dwLoc98, s0, a1_458, a1_449, dwLoc28, s11, out s0_1165, out s1_1166, out a0_1167, out a1_1168, out a2_1169, out a3_474, out a4_1170, out a5_1171, out a7_1172, out s2_1173, out s3_1174, out s4_1175, out s5_1176, out s6_1177, out s7_1178, out s8_1179, out s9_1180, out s10_1181, out s11_1182), &g_t230C6978, a3_474, a0_440, dwLocA8, dwLoc60, dwLoc5C, 0x00, dwLoc14, out s1_275, out a0_1183, out a1_1184, out a2_1185, out a3_1186, out a4_1187, out a5_1188, out a7_1189, out s2_1190, out s3_1191, out s4_1192, out s5_1193, out s6_280, out s7_1194, out s8_281, out s9_1195, out s10_292, out s11_1196, out t4_1197);
					}
				}
				a0_520 = (struct Eq_274 *) &g_t230C3A40;
			}
			Eq_2 a2_532;
			word32 s11_1122;
			word32 t4_1123;
			word32 a3_1124;
			word32 a4_1125;
			word32 s7_1118;
			word32 s8_1119;
			word32 s9_1120;
			word32 s10_1121;
			word32 s3_1114;
			word32 s4_1115;
			word32 s5_1116;
			word32 s6_1117;
			word32 a4_1110;
			word32 a5_1111;
			word32 a7_1112;
			word32 s2_1113;
			word32 s1_1106;
			word32 a0_1107;
			word32 a1_1108;
			word32 a3_1109;
			lwip_close(printf(ra_111, a0_520, a3_120, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, 0x00, dwLoc14, out s1_1106, out a0_1107, out a1_1108, out a2_532, out a3_1109, out a4_1110, out a5_1111, out a7_1112, out s2_1113, out s3_1114, out s4_1115, out s5_1116, out s6_1117, out s7_1118, out s8_1119, out s9_1120, out s10_1121, out s11_1122, out t4_1123), s0_125, a2_532, mstatus, dwLoc88, s5, a0, dwLoc18, dwLoc08, s5, dwArg38, dwArg58, dwArg78, out a2_555, out a3_1124, out a4_1125, out a5_558, out s3_564);
		}
		word32 a4_1102;
		word32 a6_1103;
		word32 s4_1104;
		word32 t3_1105;
		word32 s0_1098;
		word32 a0_1099;
		word32 a1_1100;
		word32 a3_1101;
		vPortFree(s3_564, a2_555, a5_558, mstatus, dwArg88, dwArgC8, out s0_1098, out s1_611, out a0_1099, out a1_1100, out a2_607, out a3_1101, out a4_1102, out a5_610, out a6_1103, out s4_1104, out t3_1105);
	}
	if (s1_611 != 0x00)
	{
		word32 a6_1071;
		word32 a0_1065;
		word32 s4_1072;
		word32 t3_1073;
		word32 a5_1070;
		word32 a1_1066;
		word32 a2_1067;
		word32 a3_1068;
		word32 a4_1069;
		word32 s0_1063;
		word32 s1_1064;
		vPortFree(s1_611, a2_607, a5_610, mstatus, dwArg88, dwArgC8, out s0_1063, out s1_1064, out a0_1065, out a1_1066, out a2_1067, out a3_1068, out a4_1069, out a5_1070, out a6_1071, out s4_1072, out t3_1073);
	}
}

