pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23077EE8: void iperf_client_tcp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8)
void iperf_client_tcp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgD8)
{
	Eq_2 a3_45;
	Eq_2 a4_46;
	Eq_2 a5_47;
	word32 a1_973;
	word32 t1_971;
	word32 a2_974;
	word32 a0_972;
	Eq_2 ra_48 = memset(ra, fp + -0x0080, 0x00, 32, out t1_971, out a0_972, out a1_973, out a2_974, out a3_45, out a4_46, out a5_47);
	Eq_2 dwLoc4C_907 = SLICE(s3, word32, 32);
	ptr32 a0_53;
	Eq_2 a2_55;
	Eq_2 a5_58;
	word32 s3_980;
	word32 s8_982;
	word32 s4_981;
	word32 s2_979;
	word32 a6_978;
	word32 s1_975;
	word32 a4_977;
	word32 a1_976;
	Eq_2 a3_493;
	Eq_2 s0_60 = pvPortMalloc(ra_48, s1, 0x01000450, a3_45, a4_46, a5_47, mstatus, dwLoc80, dwLoc7C, dwLoc34, dwArg78, s0, out s1_975, out a0_53, out a1_976, out a2_55, out a3_493, out a4_977, out a5_58, out a6_978, out s2_979, out s3_980, out s4_981, out s8_982);
	if (a0_53 == 0x00)
	{
		word32 a5_990;
		word32 a2_987;
		word32 a0_985;
		word32 s0_983;
		word32 s4_992;
		word32 t3_993;
		word32 a6_991;
		word32 a4_989;
		word32 a3_988;
		word32 a1_986;
		word32 s1_984;
		vPortFree(a0, a2_55, a5_58, mstatus, dwArg98, dwArgD8, out s0_983, out s1_984, out a0_985, out a1_986, out a2_987, out a3_988, out a4_989, out a5_990, out a6_991, out s4_992, out t3_993);
		return;
	}
	int32 a5_69 = 0x00;
	do
	{
		a0_53 + a5_69 = (byte *) (byte) a5_69;
		++a5_69;
	} while (a5_69 != (word32) s0_60 + 1104);
	Eq_8966 fs3_293 = g_t230C4A7C;
	real32 fs5_80 = g_r230C49B4;
	Eq_8966 fs4_298 = 0x00;
	real32 fs2_83 = g_r230C49B8;
	while (true)
	{
l23077F90:
		Eq_2 a2_539;
		Eq_2 a3_540;
		Eq_2 a4_541;
		Eq_2 a5_542;
		Eq_2 a3_96;
		Eq_2 s5_105;
		word32 s2_1013;
		if (lwip_socket(ra_48, 0x01, 0x06, a3_493, mstatus, dwLoc8C, s2, a0, dwLoc28, dwLoc18, s1, dwArg28, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, s4, out a3_96, out s2_1013, out s5_105) < 0x00)
			break;
		word32 a5_994;
		lwip_htons(0x01000389, out a5_994);
		dwLoc28 = a0_125;
		Eq_2 a0_125;
		word32 a0_147;
		Eq_2 a3_150;
		word32 s4_996;
		word32 s8_997;
		word32 a3_995;
		Eq_2 s0_155 = lwip_connect(ipaddr_addr(s5_105, out a0_125, out a3_995, out s4_996, out s8_997), fp + -144, mstatus, dwLoc8C, s10, dwLoc38, s9, out a0_147, out a3_150);
		if (a0_147 == ~0x00)
		{
			word32 a3_1039;
			Eq_2 a2_518;
			word32 s3_1044;
			word32 a1_1038;
			word32 t4_1053;
			word32 s11_1052;
			word32 s10_1051;
			word32 s9_1050;
			word32 s8_1049;
			word32 s4_1045;
			word32 s5_1046;
			word32 s6_1047;
			word32 s7_1048;
			word32 s2_1043;
			word32 a7_1042;
			word32 a5_1041;
			word32 a4_1040;
			word32 a0_1037;
			word32 s1_1036;
			ra_48 = printf(ra_48, &g_t230C3964, a3_150, dwLocB8, dwLoc98, s3, dwLoc4C_907, a0_125, dwLoc04, out s1_1036, out a0_1037, out a1_1038, out a2_518, out a3_1039, out a4_1040, out a5_1041, out a7_1042, out s2_1043, out s3_1044, out s4_1045, out s5_1046, out s6_1047, out s7_1048, out s8_1049, out s9_1050, out s10_1051, out s11_1052, out t4_1053);
			word32 s3_1054;
			lwip_close(ra_48, s0_155, a2_518, mstatus, s10, s1, dwLoc38, dwLoc08, s9, s1, dwArg48, dwArg68, dwArg88, out a2_539, out a3_540, out a4_541, out a5_542, out s3_1054);
			goto l23077FAC;
		}
		word32 s2_1022;
		word32 s8_1028;
		word32 s3_1023;
		word32 a7_1021;
		word32 a1_1016;
		word32 s9_1029;
		word32 t4_1032;
		word32 s11_1031;
		word32 s10_1030;
		word32 s4_1024;
		word32 s7_1027;
		word32 s6_1026;
		word32 s5_1025;
		word32 a2_1017;
		word32 a5_1020;
		word32 a4_1019;
		word32 a3_1018;
		word32 a0_1015;
		word32 s1_1014;
		Eq_2 ra_181 = printf(ra_48, &g_t230C3978, a3_150, dwLocB8, dwLoc98, s3, dwLoc4C_907, a0_125, dwLoc04, out s1_1014, out a0_1015, out a1_1016, out a2_1017, out a3_1018, out a4_1019, out a5_1020, out a7_1021, out s2_1022, out s3_1023, out s4_1024, out s5_1025, out s6_1026, out s7_1027, out s8_1028, out s9_1029, out s10_1030, out s11_1031, out t4_1032);
		word32 s1_211;
		word32 s6_1033;
		word32 s8_1034;
		struct Eq_433255 * s2_212;
		word32 s4_214;
		Eq_2 s0_210 = lwip_setsockopt(s0_155, 0x06, 0x01, fp + -0x0094, mstatus, dwLocBC, dwLoc3C, a0_125, dwLoc08, s1, dwArg38, dwArg58, out s1_211, out s2_212, out s4_214, out s6_1033, out s8_1034);
		up32 s8_227 = s1_211 + 903;
		word32 a5_1035;
		Eq_2 s11_229 = xTaskGetTickCount(out a5_1035);
		int32 s10_230 = 0x00;
		do
		{
			while (true)
			{
				word32 a5_1074;
				up32 a5_236 = xTaskGetTickCount(out a5_1074) - s11_229;
				if (s8_227 < a5_236)
				{
					struct Eq_433255 * s10_246 = s2_212 + s10_230 / 52;
					real32 fa0_266;
					word32 s6_274;
					word32 s7_275;
					word32 a3_1068;
					word32 s9_1073;
					word32 a5_1069;
					word32 s2_1070;
					word32 s4_1071;
					word32 s5_1072;
					word32 a1_1067;
					word32 a0_1066;
					__floatundisf(ra_181, s10_246, s4_214 + (s10_230 >> 0x1F) + (word32) (s10_246 < s2_212), fflags, frm, out a0_1066, out a1_1067, out a3_1068, out a5_1069, out s2_1070, out s4_1071, out s5_1072, out s6_274, out s7_275, out s9_1073, out fa0_266, out fflags, out frm);
					Eq_8966 fs0_291 = (real32) s10_230 / fs5_80 / (real32) a5_236 * fs2_83 / fs2_83;
					Eq_8966 fs1_295 = fa0_266 / fs5_80 / (real32) (s7_275 - s6_274) * fs2_83 / fs2_83;
					if ((word32) (fs0_291 < fs3_293) != 0x00)
						fs3_293 = fs0_291;
					if ((word32) (fs4_298 < fs0_291) != 0x00)
						fs4_298 = fs0_291;
					word32 a1_1075;
					__extendsfdf2(ra_181, fs3_293, fflags, frm, out a1_1075);
					Eq_2 a1_327;
					Eq_2 a0_326 = __extendsfdf2(ra_181, fs0_291, fflags, frm, out a1_327);
					Eq_2 a1_335;
					dwLocBC = __extendsfdf2(ra_181, fs4_298, fflags, frm, out a1_335);
					Eq_2 a1_344;
					__extendsfdf2(ra_181, fs1_295, fflags, frm, out a1_344);
					word32 t4_1108;
					word32 a1_1078;
					Eq_2 a3_360;
					word32 s9_376;
					word32 s5_1086;
					word32 s3_1101;
					word32 s9_1107;
					word32 s8_1106;
					word32 s4_1102;
					word32 s5_1103;
					word32 s6_1104;
					word32 s7_1105;
					word32 s2_1100;
					word32 a7_1099;
					word32 a5_1098;
					word32 a4_1097;
					word32 a3_1096;
					word32 a2_1095;
					word32 a1_1094;
					word32 a0_1093;
					word32 s1_1092;
					word32 s11_1091;
					word32 s6_1087;
					word32 s7_1088;
					word32 s8_1089;
					word32 s10_1090;
					word32 s4_1085;
					word32 s3_1084;
					word32 s2_1083;
					word32 a2_1079;
					word32 a4_1080;
					word32 a5_1081;
					word32 a7_1082;
					word32 a0_1077;
					word32 s1_1076;
					printf(snprintf(ra_181, fp + -0x0080, 32, &g_t230C39D4, dwLocA8, dwLoc88, dwLoc5C, a1_344, a1_335, dwLoc18, s7, out s0_210, out s1_1076, out a0_1077, out a1_1078, out a2_1079, out a3_360, out a4_1080, out a5_1081, out a7_1082, out s2_1083, out s3_1084, out s4_1085, out s5_1086, out s6_1087, out s7_1088, out s8_1089, out s9_376, out s10_1090, out s11_1091), s9_376 + -0x0688, a3_360, a0_326, dwLoc98, s3, dwLoc4C_907, a0_125, dwLoc04, out s1_1092, out a0_1093, out a1_1094, out a2_1095, out a3_1096, out a4_1097, out a5_1098, out a7_1099, out s2_1100, out s3_1101, out s4_1102, out s5_1103, out s6_1104, out s7_1105, out s8_1106, out s9_1107, out s10_230, out s11_229, out t4_1108);
					dwLocB8 = a0_326;
					dwLoc38 = a1_327;
					dwLoc3C = a1_335;
				}
				int32 a0_421;
				Eq_2 a2_423;
				word32 s5_1065;
				word32 s3_1064;
				ra_181 = lwip_send(s0_210, 0x00, mstatus, dwLoc98, a0, dwLoc18, out s0_210, out a0_421, out a2_423, out s2_212, out s3_1064, out s4_214, out s5_1065, out s8_227, out mstatus);
				if (a0_421 <= 0x00)
					break;
				s10_230 += a0_421;
			}
		} while (a0_421 == 0x00);
		Eq_2 a2_449;
		Eq_2 a3_450;
		Eq_2 a4_451;
		Eq_2 a5_452;
		word32 s3_1109;
		lwip_close(ra_181, s0_210, a2_423, mstatus, s10, s1, dwLoc38, dwLoc08, s9, s1, dwArg48, dwArg68, dwArg88, out a2_449, out a3_450, out a4_451, out a5_452, out s3_1109);
		Eq_2 a3_474;
		word32 s4_1118;
		word32 s3_1117;
		word32 s2_1116;
		word32 a5_1115;
		word32 a4_1114;
		word32 a2_1113;
		word32 s1_1110;
		word32 a0_1111;
		word32 a1_1112;
		vTaskDelay(2000, a2_449, a3_450, a4_451, a5_452, mstatus, dwLoc9C, dwLoc98, dwArg78, s0, out s1_1110, out a0_1111, out a1_1112, out a2_1113, out a3_474, out a4_1114, out a5_1115, out s2_1116, out s3_1117, out s4_1118);
		word32 s10_1134;
		word32 s11_1135;
		word32 t4_1136;
		word32 s7_1131;
		word32 s8_1132;
		word32 s9_1133;
		word32 s4_1128;
		word32 s5_1129;
		word32 s6_1130;
		word32 a7_1125;
		word32 s2_1126;
		word32 s3_1127;
		word32 a5_1124;
		word32 a4_1123;
		word32 a2_1122;
		word32 a1_1121;
		word32 a0_1120;
		word32 s1_1119;
		ra_48 = printf(ra_181, &g_t230C39A0, a3_474, dwLocB8, dwLoc98, s3, dwLoc4C_907, a0_125, dwLoc04, out s1_1119, out a0_1120, out a1_1121, out a2_1122, out a3_493, out a4_1123, out a5_1124, out a7_1125, out s2_1126, out s3_1127, out s4_1128, out s5_1129, out s6_1130, out s7_1131, out s8_1132, out s9_1133, out s10_1134, out s11_1135, out t4_1136);
	}
	word32 a1_1000;
	word32 s5_1005;
	word32 s3_1003;
	word32 s1_998;
	word32 s11_1011;
	word32 s6_1006;
	word32 s4_1004;
	word32 s2_1002;
	word32 a7_1001;
	word32 a0_999;
	word32 t4_1012;
	word32 s7_1007;
	word32 s10_1010;
	word32 s9_1009;
	word32 s8_1008;
	ra_48 = printf(ra_48, &g_t230C39BC, a3_96, dwLocB8, dwLoc98, s3, dwLoc4C_907, dwLoc28, dwLoc04, out s1_998, out a0_999, out a1_1000, out a2_539, out a3_540, out a4_541, out a5_542, out a7_1001, out s2_1002, out s3_1003, out s4_1004, out s5_1005, out s6_1006, out s7_1007, out s8_1008, out s9_1009, out s10_1010, out s11_1011, out t4_1012);
l23077FAC:
	word32 s4_1063;
	word32 s3_1062;
	word32 s2_1061;
	word32 a5_1060;
	word32 a4_1059;
	word32 a2_1058;
	word32 a1_1057;
	word32 a0_1056;
	word32 s1_1055;
	vTaskDelay(1000, a2_539, a3_540, a4_541, a5_542, mstatus, dwLoc9C, dwLoc98, dwArg78, s0, out s1_1055, out a0_1056, out a1_1057, out a2_1058, out a3_493, out a4_1059, out a5_1060, out s2_1061, out s3_1062, out s4_1063);
	goto l23077F90;
}

// 2307811E: void ipus_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack word32 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ipus_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, word32 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a0_170;
		word32 a1_171;
		word32 a2_172;
		word32 a3_173;
		word32 a4_174;
		word32 a5_175;
		word32 a7_176;
		word32 s2_177;
		word32 s3_178;
		word32 s4_179;
		word32 s5_180;
		word32 s6_181;
		word32 s7_182;
		word32 s8_183;
		word32 s9_184;
		word32 s10_185;
		word32 s11_186;
		word32 t4_187;
		ra = printf(ra, &g_t230C3C28, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a7_176, out s2_177, out s3_178, out s4_179, out s5_180, out s6_181, out s7_182, out s8_183, out s9_184, out s10_185, out s11_186, out t4_187);
		a0.u0 = 0x230B2104;
	}
	else if (a2 != 0x02)
	{
		word32 s1_188;
		word32 a0_189;
		word32 a1_190;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 a7_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s9_203;
		word32 s10_204;
		word32 s11_205;
		word32 t4_206;
		printf(ra, &g_t230C3C68, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
		return;
	}
	iperf_server_udp_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 2307815A: void ipu_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack word32 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ipu_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, word32 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a0_170;
		word32 a1_171;
		word32 a2_172;
		word32 a3_173;
		word32 a4_174;
		word32 a5_175;
		word32 a7_176;
		word32 s2_177;
		word32 s3_178;
		word32 s4_179;
		word32 s5_180;
		word32 s6_181;
		word32 s7_182;
		word32 s8_183;
		word32 s9_184;
		word32 s10_185;
		word32 s11_186;
		word32 t4_187;
		ra = printf(ra, &g_t230C3BB0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a7_176, out s2_177, out s3_178, out s4_179, out s5_180, out s6_181, out s7_182, out s8_183, out s9_184, out s10_185, out s11_186, out t4_187);
		a0.u0 = 588004340;
	}
	else if (a2 != 0x02)
	{
		word32 s1_188;
		word32 a0_189;
		word32 a1_190;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 a7_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s9_203;
		word32 s10_204;
		word32 s11_205;
		word32 t4_206;
		printf(ra, &g_t230C3C04, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
		return;
	}
	iperf_client_udp_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 23078196: void ipc_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack word32 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ipc_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, word32 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a0_170;
		word32 a1_171;
		word32 a2_172;
		word32 a3_173;
		word32 a4_174;
		word32 a5_175;
		word32 a7_176;
		word32 s2_177;
		word32 s3_178;
		word32 s4_179;
		word32 s5_180;
		word32 s6_181;
		word32 s7_182;
		word32 s8_183;
		word32 s9_184;
		word32 s10_185;
		word32 s11_186;
		word32 t4_187;
		ra = printf(ra, &g_t230C38FC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a7_176, out s2_177, out s3_178, out s4_179, out s5_180, out s6_181, out s7_182, out s8_183, out s9_184, out s10_185, out s11_186, out t4_187);
		a0.u0 = 588004340;
	}
	else if (a2 != 0x02)
	{
		word32 s1_188;
		word32 a0_189;
		word32 a1_190;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 a7_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s9_203;
		word32 s10_204;
		word32 s11_205;
		word32 t4_206;
		printf(ra, &g_t230C3940, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
		return;
	}
	iperf_client_tcp_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 230781D2: void ips_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack word32 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ips_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, word32 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a4_155;
		word32 a2_154;
		word32 a1_153;
		word32 a0_152;
		word32 a5_156;
		word32 s4_157;
		word32 s8_158;
		s1 = puts(588004180, out a0_152, out a1_153, out a2_154, out a4_155, out a5_156, out s4_157, out s8_158);
		a0.u0 = 588004340;
	}
	else if (a2 != 0x02)
	{
		word32 s1_159;
		word32 a0_160;
		word32 a1_161;
		word32 a2_162;
		word32 a3_163;
		word32 a4_164;
		word32 a5_165;
		word32 a7_166;
		word32 s2_167;
		word32 s3_168;
		word32 s4_169;
		word32 s5_170;
		word32 s6_171;
		word32 s7_172;
		word32 s8_173;
		word32 s9_174;
		word32 s10_175;
		word32 s11_176;
		word32 t4_177;
		printf(ra, &g_t230C3B8C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out a7_166, out s2_167, out s3_168, out s4_169, out s5_170, out s6_171, out s7_172, out s8_173, out s9_174, out s10_175, out s11_176, out t4_177);
		return;
	}
	iperf_server_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 2307820E: void network_netutils_iperf_cli_register()
// Called from:
//      aos_loop_proc
void network_netutils_iperf_cli_register()
{
}

// 23078212: Register Eq_2 dirent_type(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      file_info
//      romfs_readdir
//      romfs_stat
Eq_2 dirent_type(Eq_2 a0, union Eq_2 & a5Out)
{
	Eq_2 a0_11;
	ui32 a5_5 = (word32) *((word32) a0 + 3);
	if ((a5_5 & 0x07) != 0x00)
	{
		a0_11.u0 = 0x02;
		if ((a5_5 & 0x07) != 0x02)
		{
			a0_11.u0 = 0x03;
			if ((a5_5 & 0x07) == 0x01)
			{
				a5Out.u0 = <invalid>;
				return 0x01;
			}
		}
	}
	else
		a0_11.u0 = 0x00;
	a5Out.u0 = <invalid>;
	return a0_11;
}

// 23078232: Register ui32 dirent_hardfh(Register Eq_2 a5, Register out (ptr32 Eq_436252) a5Out)
// Called from:
//      file_info
//      romfs_readdir
ui32 dirent_hardfh(Eq_2 a5, struct Eq_436252 & a5Out)
{
	struct Eq_436252 * a5_16 = a5 >> 8 & 0x0FFFFF00;
	a5Out = a5_16;
	return (a5 << 0x18 | a5 >> 0x18 | a5 << 0x08 & 0x00FF0000 | a5_16) & ~0x0F;
}

// 2307825A: Register ui32 dirent_childaddr(Register Eq_2 a5, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      dirent_file
//      romfs_opendir
ui32 dirent_childaddr(Eq_2 a5, union Eq_2 & a5Out)
{
	union Eq_2 * a5_16 = a5 >> 8 & 0x0FFFFF00;
	a5Out = a5_16;
	return (a5 << 0x18 | a5 >> 0x18 | a5 << 0x08 & 0x00FF0000 | a5_16) & ~0x0F;
}

// 23078282: Register ui32 dirent_size(Register uint32 a5, Register out ptr32 a3Out)
// Called from:
//      romfs_ioctl
//      romfs_read
//      romfs_lseek
//      romfs_stat
ui32 dirent_size(uint32 a5, ptr32 & a3Out)
{
	a3Out = 0x00FF0000;
	return a5 << 0x18 | a5 >> 0x18 | a5 << 0x08 & 0x00FF0000 | a5 >> 8 & 0x0FFFFF00;
}

