pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 230782A8: void romfs_close(Register (ptr32 Eq_436311) a0)
void romfs_close(struct Eq_436311 * a0)
{
	a0->dw0004 = 0x00;
	a0->dw0008 = 0x00;
}

// 230782B4: void romfs_ioctl(Register (ptr32 Eq_436320) a0, Register word32 a1, Register word32 a2, Stack word32 dwArg38)
void romfs_ioctl(struct Eq_436320 * a0, word32 a1, word32 a2, word32 dwArg38)
{
	if (a0 == null || (a2 == 0x00 || a1 != 0x01))
		return;
	int32 s2_20 = a0->dw0004;
	uint32 a5_27;
	word32 a4_80;
	word32 a3_79;
	word32 a2_78;
	word32 a1_77;
	((word32) strlen(s2_20 + 16, out a1_77, out a2_78, out a3_79, out a4_80, out a5_27) + 16 & ~0x0F)->a0010[s2_20 / 4] = a2;
	word32 a3_81;
	dirent_size(a5_27, out a3_81)->dw0004 = a2;
	0x00 = dwArg38;
}

// 23078302: void romfs_read(Register (ptr32 Eq_436365) a0, Register Eq_2 a1, Register Eq_2 a2)
void romfs_read(struct Eq_436365 * a0, Eq_2 a1, Eq_2 a2)
{
	int32 s3_19 = a0->dw0004;
	uint32 a5_29;
	word32 a4_136;
	word32 a3_135;
	word32 a2_134;
	word32 a1_133;
	Eq_2 a0_26 = strlen(s3_19 + 16, out a1_133, out a2_134, out a3_135, out a4_136, out a5_29);
	word32 a3_137;
	struct Eq_436360 * a0_34 = dirent_size(a5_29, out a3_137);
	struct Eq_436360 * a2_38 = a0->ptr0008;
	if (a2_38 < a0_34)
	{
		Eq_2 a1_46 = a2_38 + (((word32) a0_26 + 16 & ~0x0F) + 0x10) / 20 + s3_19 / 20;
		if (a2_38 + a2 <u a0_34)
		{
			word32 a1_145;
			word32 a2_146;
			word32 a3_147;
			word32 a4_148;
			word32 a5_149;
			word32 a6_150;
			word32 a7_151;
			memcpy(a1, a1_46, a2, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out a6_150, out a7_151);
			Mem81[a0 + 8:word32] = Mem17[a0 + 8:int32] + a2;
		}
		else
		{
			word32 a1_138;
			word32 a2_139;
			word32 a3_140;
			word32 a4_141;
			word32 a5_142;
			word32 a6_143;
			word32 a7_144;
			memcpy(a1, a1_46, a0_34 - a2_38, out a1_138, out a2_139, out a3_140, out a4_141, out a5_142, out a6_143, out a7_144);
			a0->ptr0008 = a0_34;
		}
	}
}

// 23078388: Register Eq_2 file_info(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register (ptr32 Eq_2) a2, Register Eq_2 s4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg7C, Stack word32 dwArgCC, Stack ptr32 dwArg0198, Register out (ptr32 byte) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out (ptr32 Eq_2) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_436472) s3Out, Register out (ptr32 Eq_2) s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out)
// Called from:
//      dirent_file
Eq_2 file_info(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, union Eq_2 * a1, union Eq_2 * a2, Eq_2 s4, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg7C, word32 dwArgCC, ptr32 dwArg0198, byte & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_436472 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out)
{
	ptr32 a0_302;
	Eq_2 s2_172 = a0;
	union Eq_2 * s5_175 = a1;
	union Eq_2 * a5_160 = (union Eq_2 *) 64;
	word32 a5_663;
	word32 a2_660;
	word32 a4_662;
	word32 a1_659;
	word32 a3_661;
	if (strlen(a0, out a1_659, out a2_660, out a3_661, out a4_662, out a5_663) <= 64)
	{
		s3 = (struct Eq_436472 *) &g_t4200F6A0;
		if (g_t4200F6A0 == s0)
		{
			word32 a3_666;
			word32 a4_667;
			word32 a1_664;
			word32 a2_665;
			word32 a5_668;
			s0 = (word32) s0 + (((word32) strlen((word32) s0 + 16, out a1_664, out a2_665, out a3_666, out a4_667, out a5_668) + 16 & ~0x0F) + 80);
		}
		s7 = 0x01;
		do
		{
			struct Eq_436565 * a0_211;
			Eq_2 s1_210;
			Eq_2 a5_194;
			up32 a0_57 = dirent_type(s0, out a5_194);
			if (a0_57 == 0x01)
			{
				word32 a3_671;
				word32 a2_670;
				word32 a1_669;
				word32 a4_672;
				word32 a5_673;
				word32 a4_677;
				word32 a3_676;
				word32 a1_674;
				word32 a2_675;
				if (memcmp(a0, (word32) s0 + 16, strlen(a0, out a1_669, out a2_670, out a3_671, out a4_672, out a5_673), out a1_674, out a2_675, out a3_676, out a4_677, out a5_194) != 0x00)
					goto l230784F2;
				word32 a4_682;
				word32 a1_679;
				word32 a3_681;
				word32 a2_680;
				word32 a5_683;
				a5_194 = CONVERT(Mem23[strlen(a0, out a1_679, out a2_680, out a3_681, out a4_682, out a5_683) + s0 + 16:byte], byte, word32);
				if (a5_194 != 0x00)
					goto l230784F2;
				a0_211 = dirent_hardfh(a5_194, out a5_160);
				if (a0_211 == null)
					goto l23078418;
				s1_210 = g_t4200F6A0;
				goto l23078416;
			}
			if (a0_57 == 0x02)
			{
				word32 a4_687;
				word32 a1_684;
				word32 a3_686;
				word32 a3_691;
				word32 a4_692;
				word32 a2_690;
				word32 a5_688;
				word32 a1_689;
				word32 a2_685;
				if (memcmp(a0, (word32) s0 + 16, strlen(a0, out a1_684, out a2_685, out a3_686, out a4_687, out a5_688), out a1_689, out a2_690, out a3_691, out a4_692, out a5_194) != 0x00)
					goto l230784F2;
				word32 a1_693;
				word32 a2_694;
				word32 a3_695;
				word32 a5_697;
				word32 a4_696;
				a5_194 = CONVERT(Mem23[strlen(a0, out a1_693, out a2_694, out a3_695, out a4_696, out a5_697) + s0 + 16:byte], byte, word32);
				if (a5_194 != 0x00)
					goto l230784F2;
				s1_210 = g_t4200F6A0;
				a0_211 = dirent_hardfh(a5_194, out a5_160);
l23078416:
				s1 = s1_210 + a0_211;
l23078418:
				*a1 = (union Eq_2 *) s0;
				*a2 = (union Eq_2 *) s1;
				a0_302 = 0x00;
				goto l23078422;
			}
			if (a0_57 != 0x00)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_699;
					xTaskGetTickCountFromISR(out a5_699);
				}
				else
				{
					word32 a5_698;
					xTaskGetTickCount(out a5_698);
				}
				word32 a5_712;
				dirent_type(s0, out a5_712);
				Eq_2 s5_106;
				Eq_2 s6_107;
				word32 s1_128;
				struct Eq_436720 * s3_132;
				word32 s9_738;
				word32 s0_728;
				word32 a5_731;
				word32 s4_733;
				word32 s5_734;
				word32 s6_735;
				word32 s8_737;
				word32 s7_736;
				word32 s2_732;
				word32 a3_729;
				word32 a4_730;
				word32 a4_718;
				word32 s3_721;
				word32 s7_723;
				word32 s8_724;
				word32 s9_725;
				word32 s11_727;
				word32 s10_726;
				word32 s4_722;
				word32 a5_719;
				word32 s2_720;
				word32 s1_713;
				word32 a0_714;
				word32 a1_715;
				word32 a3_717;
				word32 a2_716;
				Eq_2 ra_126 = log_buf_out(bl_printk(ra, &g_t230C3DB4, 588004776, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_713, out a0_714, out a1_715, out a2_716, out a3_717, out a4_718, out a5_719, out s2_720, out s3_721, out s4_722, out s5_106, out s6_107, out s7_723, out s8_724, out s9_725, out s10_726, out s11_727), s0, (union Eq_485217 *) 0x08, 0x00, s5_106, s6_107, s4, dwLoc20, dwLoc1C, dwLoc10, dwArg18, dwArg2C, dwArg3C, dwArgCC, out s0_728, out s1_128, out a3_729, out a4_730, out a5_731, out s2_732, out s3_132, out s4_733, out s5_734, out s6_735, out s7_736, out s8_737, out s9_738);
				if (s3_132->dw0560 != 0x00)
				{
					word32 a5_701;
					xTaskGetTickCountFromISR(out a5_701);
				}
				else
				{
					word32 a5_700;
					xTaskGetTickCount(out a5_700);
				}
				word32 s8_708;
				word32 s11_711;
				word32 s9_709;
				word32 s10_710;
				word32 a1_703;
				word32 a2_704;
				word32 a3_705;
				word32 s4_707;
				word32 a4_706;
				word32 a0_702;
				ra = bl_printk(ra_126, &g_t230C3DF8, s1_128 + -600, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1, out a0_702, out a1_703, out a2_704, out a3_705, out a4_706, out a5_160, out s2_172, out s3, out s4_707, out s5_175, out s6, out s7, out s8_708, out s9_709, out s10_710, out s11_711);
				goto l230784E2;
			}
l230784F2:
			s6 = g_t4200F6A0;
			word32 a5_678;
			s0 = s6 + dirent_hardfh(a5_194, out a5_678);
		} while (s0 < s1);
		if (g_t4200F560 != 0x00)
		{
			word32 a5_740;
			xTaskGetTickCountFromISR(out a5_740);
		}
		else
		{
			word32 a5_739;
			xTaskGetTickCount(out a5_739);
		}
		word32 a4_745;
		word32 a3_744;
		word32 s8_747;
		word32 s4_746;
		word32 s10_749;
		word32 s9_748;
		word32 s11_750;
		word32 a1_742;
		word32 a2_743;
		word32 a0_741;
		ra = bl_printk(ra, &g_t230C3E28, 588004776, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1, out a0_741, out a1_742, out a2_743, out a3_744, out a4_745, out a5_160, out s2_172, out s3, out s4_746, out s5_175, out s6, out s7, out s8_747, out s9_748, out s10_749, out s11_750);
	}
l230784E2:
	a0_302 = ~0x00;
l23078422:
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1;
	a0Out = a0_302;
	a2Out = dwArg0138;
	a5Out = a5_160;
	s2Out = s2_172;
	s3Out = s3;
	s5Out = s5_175;
	s6Out = s6;
	s7Out = s7;
	return ra;
}

