pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23078A94: void romfs_open(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 s4, Register Eq_2 s6, Stack word32 dwArg1C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack ptr32 dwArgE8, Stack word32 dwArg0128)
void romfs_open(Eq_2 ra, Eq_2 a1, Eq_2 s4, Eq_2 s6, word32 dwArg1C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, ptr32 dwArgE8, word32 dwArg0128)
{
	struct Eq_274 * a0_219;
	if (g_t4200F6A0 == 0x00)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_630;
			xTaskGetTickCountFromISR(out a5_630);
		}
		else
		{
			word32 a5_629;
			xTaskGetTickCount(out a5_629);
		}
		a0_219 = (struct Eq_274 *) &g_t230C3F38;
	}
	else
	{
		struct Eq_274 * a0_116;
		word32 a3_618;
		word32 a2_617;
		word32 a4_619;
		word32 a5_620;
		word32 a1_616;
		Eq_2 a0_27 = strlen(a1, out a1_616, out a2_617, out a3_618, out a4_619, out a5_620);
		word32 a2_622;
		word32 a1_621;
		word32 a4_624;
		word32 a5_625;
		word32 a3_626;
		word32 a4_627;
		word32 a3_623;
		word32 a5_628;
		if (strncmp(a1, 587987784, strlen(587987784, out a1_621, out a2_622, out a3_623, out a4_624, out a5_625), out a3_626, out a4_627, out a5_628) == 0x00)
		{
			Eq_2 s0_161 = 0x00;
			while (a0_27 != s0_161)
			{
				word32 a4_81 = CONVERT(Mem20[a1 + s0_161:byte], byte, word32);
				if ((a4_81 + -97 & 0x00FF) > 0x19)
				{
					if ((a4_81 + -65 & 0x00FF) > 0x19 && (a4_81 + -48 & 0x00FF) > 0x09)
					{
						if (a4_81 == 47)
							goto l23078C2E;
						if (a4_81 != 95 && (a4_81 + -45 & 0x00FF) > 0x01)
						{
							if (g_t4200F560 == 0x00)
							{
								word32 a5_657;
								xTaskGetTickCount(out a5_657);
							}
							else
							{
								word32 a5_656;
								xTaskGetTickCountFromISR(out a5_656);
							}
							word32 s7_670;
							word32 s8_671;
							word32 s10_673;
							word32 s11_674;
							word32 s9_672;
							word32 s3_666;
							word32 s4_667;
							word32 s6_669;
							word32 s5_668;
							word32 s1_658;
							word32 a1_660;
							word32 a2_661;
							word32 s2_665;
							word32 a3_662;
							word32 a5_664;
							word32 a4_663;
							word32 a0_659;
							ra = bl_printk(ra, &g_t230C3EC0, 588004776, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_658, out a0_659, out a1_660, out a2_661, out a3_662, out a4_663, out a5_664, out s2_665, out s3_666, out s4_667, out s5_668, out s6_669, out s7_670, out s8_671, out s9_672, out s10_673, out s11_674);
							goto l23078C00;
						}
					}
					else if (a4_81 == 47)
					{
l23078C2E:
						if (s0_161 != 0x00)
						{
							if (s0_161 == s4)
							{
								if (g_t4200F560 != 0x00)
								{
									word32 a5_676;
									xTaskGetTickCountFromISR(out a5_676);
								}
								else
								{
									word32 a5_675;
									xTaskGetTickCount(out a5_675);
								}
								a0_116 = (struct Eq_274 *) &g_t230C3EE8;
								goto l23078B74;
							}
							s4 = s0_161;
						}
						else
							s4.u0 = 0x00;
					}
				}
				s0_161 = (word32) s0_161 + 1;
			}
			word32 a0_228;
			word32 a5_233;
			struct Eq_438030 * s3_239;
			word32 s0_631;
			word32 a2_633;
			word32 s2_634;
			word32 s1_632;
			dirent_file(ra, s0_161, a1, fp + -40, fp + -36, s4, s6, dwLoc18, dwArg1C, dwArgE8, out s0_631, out s1_632, out a0_228, out a2_633, out a5_233, out s2_634, out s3_239);
			if (a0_228 == 0x00)
			{
				s3_239->dw0008 = 0x00;
				s3_239->dw0004 = a5_233;
			}
l23078AE0:
			0x00 = dwArg0128;
			return;
		}
		if (g_t4200F560 != 0x00)
		{
			word32 a5_636;
			xTaskGetTickCountFromISR(out a5_636);
		}
		else
		{
			word32 a5_635;
			xTaskGetTickCount(out a5_635);
		}
		a0_116 = (struct Eq_274 *) &g_t230C3E98;
l23078B74:
		word32 a5_683;
		word32 s10_692;
		word32 s11_693;
		word32 s2_684;
		word32 s4_686;
		word32 s5_687;
		word32 s9_691;
		word32 s6_688;
		word32 s8_690;
		word32 s7_689;
		word32 s3_685;
		word32 a1_679;
		word32 a2_680;
		word32 a4_682;
		word32 a3_681;
		word32 a0_678;
		word32 s1_677;
		ra = bl_printk(ra, a0_116, 588004776, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_677, out a0_678, out a1_679, out a2_680, out a3_681, out a4_682, out a5_683, out s2_684, out s3_685, out s4_686, out s5_687, out s6_688, out s7_689, out s8_690, out s9_691, out s10_692, out s11_693);
l23078C00:
		if (g_t4200F560 != 0x00)
		{
			word32 a5_638;
			xTaskGetTickCountFromISR(out a5_638);
		}
		else
		{
			word32 a5_637;
			xTaskGetTickCount(out a5_637);
		}
		a0_219 = (struct Eq_274 *) &g_t230C3F0C;
	}
	word32 s10_654;
	word32 s9_653;
	word32 s8_652;
	word32 a2_642;
	word32 a1_641;
	word32 s7_651;
	word32 s11_655;
	word32 s1_639;
	word32 s3_647;
	word32 s4_648;
	word32 s5_649;
	word32 a3_643;
	word32 a5_645;
	word32 a0_640;
	word32 a4_644;
	word32 s6_650;
	word32 s2_646;
	bl_printk(ra, a0_219, 588004776, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_639, out a0_640, out a1_641, out a2_642, out a3_643, out a4_644, out a5_645, out s2_646, out s3_647, out s4_648, out s5_649, out s6_650, out s7_651, out s8_652, out s9_653, out s10_654, out s11_655);
	goto l23078AE0;
}

// 23078C82: Register Eq_2 romfs_register(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack word32 dwArgDC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s2Out)
// Called from:
//      aos_loop_proc
Eq_2 romfs_register(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, word32 dwArgDC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s2Out)
{
	Eq_2 ra_150;
	ptr32 s2_136;
	word32 a0_23;
	union Eq_2 * s2_32;
	Eq_2 s5_42;
	Eq_2 s6_43;
	word32 a3_422;
	word32 s0_421;
	Eq_2 ra_39 = bl_mtd_open(ra, 588005300, a3, a4, a5, s3, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, dwArg5C, dwArg84, dwArg98, dwArgD8, dwArgF8, dwArg0118, out s0_421, out a0_23, out a3_422, out s2_32, out s5_42, out s6_43);
	if (a0_23 != 0x00)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_431;
			xTaskGetTickCountFromISR(out a5_431);
		}
		else
		{
			word32 a5_430;
			xTaskGetTickCount(out a5_430);
		}
		word32 s1_471;
		word32 a0_472;
		word32 a1_473;
		word32 a2_474;
		word32 a3_475;
		word32 a4_476;
		word32 a5_477;
		word32 s3_478;
		word32 s4_479;
		word32 s5_480;
		word32 s6_481;
		word32 s7_482;
		word32 s8_483;
		word32 s9_484;
		word32 s10_485;
		word32 s11_486;
		ra_150 = bl_printk(ra_39, &g_t230C3FBC, 588004776, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_471, out a0_472, out a1_473, out a2_474, out a3_475, out a4_476, out a5_477, out s2_136, out s3_478, out s4_479, out s5_480, out s6_481, out s7_482, out s8_483, out s9_484, out s10_485, out s11_486);
	}
	else
	{
		struct Eq_274 * a0_165;
		word32 a1_425;
		word32 a3_427;
		word32 a5_429;
		word32 a4_428;
		word32 a2_426;
		word32 a0_424;
		word32 t1_423;
		Eq_2 ra_60 = memset(ra_39, fp + -44, 0x00, 0x1C, out t1_423, out a0_424, out a1_425, out a2_426, out a3_427, out a4_428, out a5_429);
		Eq_2 s1_70 = bl_mtd_info(*s2_32, fp + -44);
		if (s1_70 == 0x00)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_442;
				xTaskGetTickCountFromISR(out a5_442);
			}
			else
			{
				word32 a5_441;
				xTaskGetTickCount(out a5_441);
			}
			a0_165 = (struct Eq_274 *) &g_t230C4008;
		}
		else
		{
			Eq_2 a2_89;
			word32 a1_437;
			word32 a3_438;
			word32 a4_439;
			word32 a5_440;
			word32 a5_436;
			word32 a2_433;
			word32 a4_435;
			word32 a3_434;
			word32 a1_432;
			if (memcmp(s1_70, 0x230C4034, strlen(0x230C4034, out a1_432, out a2_433, out a3_434, out a4_435, out a5_436), out a1_437, out a2_89, out a3_438, out a4_439, out a5_440) == 0x00)
			{
				g_t4200F6A0 = a2_89;
				Eq_2 a3_100;
				Eq_2 a4_101;
				Eq_2 a5_102;
				word32 s1_444;
				word32 s0_443;
				word32 s2_445;
				word32 s3_446;
				word32 s4_447;
				word32 s5_448;
				word32 s6_449;
				word32 s7_450;
				word32 s8_451;
				word32 s9_452;
				ra_150 = aos_register_fs(log_buf_out(ra_60, a2_89, (union Eq_485217 *) 64, 0x00, s5_42, s6_43, s0, dwLoc10, dwLoc0C, dwArg00, dwArg28, dwArg3C, dwArg4C, dwArgDC, out s0_443, out s1_444, out a3_100, out a4_101, out a5_102, out s2_445, out s3_446, out s4_447, out s5_448, out s6_449, out s7_450, out s8_451, out s9_452), 0x00, a3_100, a4_101, a5_102, mstatus, dwArg44, dwArg84, dwArgB8, dwArgF8, dwArg0138, out s2_136);
l23078CDE:
				0x00 = (int8) dwArg0128;
				s2Out = s2_136;
				return ra_150;
			}
			if (g_t4200F560 != 0x00)
			{
				word32 a5_454;
				xTaskGetTickCountFromISR(out a5_454);
			}
			else
			{
				word32 a5_453;
				xTaskGetTickCount(out a5_453);
			}
			a0_165 = (struct Eq_274 *) &g_t230C4040;
		}
		word32 s1_455;
		word32 a0_456;
		word32 a1_457;
		word32 a2_458;
		word32 a3_459;
		word32 a4_460;
		word32 a5_461;
		word32 s3_462;
		word32 s4_463;
		word32 s5_464;
		word32 s6_465;
		word32 s7_466;
		word32 s8_467;
		word32 s9_468;
		word32 s10_469;
		word32 s11_470;
		ra_150 = bl_printk(ra_60, a0_165, 588004776, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_455, out a0_456, out a1_457, out a2_458, out a3_459, out a4_460, out a5_461, out s2_136, out s3_462, out s4_463, out s5_464, out s6_465, out s7_466, out s8_467, out s9_468, out s10_469, out s11_470);
	}
	goto l23078CDE;
}

// 23078DBA: void _startup_sntp(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack (ptr32 Eq_2) dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void _startup_sntp(Eq_2 ra, Eq_2 a3, ptr32 mstatus, union Eq_2 * dwArg00, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	Eq_2 a4_13;
	word32 a0_75;
	word32 a1_76;
	word32 a2_77;
	word32 a5_78;
	word32 s4_79;
	word32 s8_80;
	Eq_2 s1_14 = puts(0x230C40C4, out a0_75, out a1_76, out a2_77, out a4_13, out a5_78, out s4_79, out s8_80);
	sntp_setoperatingmode(0x00);
	sntp_init(ra, s1_14, a3, a4_13, sntp_setservername(0x00, 588005628), mstatus, dwArg00, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C);
	word32 a0_81;
	word32 a1_82;
	word32 a2_83;
	word32 a4_84;
	word32 a5_85;
	word32 s4_86;
	word32 s8_87;
	puts(588005648, out a0_81, out a1_82, out a2_83, out a4_84, out a5_85, out s4_86, out s8_87);
}

// 23078DEC: void cmd_sntp_date(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C)
void cmd_sntp_date(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C)
{
	word32 a0_166;
	word32 a1_167;
	word32 a2_168;
	word32 a4_169;
	word32 a5_170;
	word32 s4_171;
	word32 s8_172;
	puts(588005708, out a0_166, out a1_167, out a2_168, out a4_169, out a5_170, out s4_171, out s8_172);
	word32 a0_173;
	word32 a1_174;
	word32 a2_175;
	word32 a4_176;
	word32 a5_177;
	word32 s4_178;
	word32 s8_179;
	puts(588005744, out a0_173, out a1_174, out a2_175, out a4_176, out a5_177, out s4_178, out s8_179);
	utils_time_date_from_epoch(1581863713, fp + -36);
	Eq_2 a3_59;
	word32 s1_180;
	word32 a0_181;
	word32 a1_182;
	word32 a2_183;
	word32 a4_184;
	word32 a5_185;
	word32 a7_186;
	word32 s2_187;
	word32 s3_188;
	word32 s4_189;
	word32 s5_190;
	word32 s6_191;
	word32 s7_192;
	word32 s8_193;
	word32 s9_194;
	word32 s10_195;
	word32 s11_196;
	word32 t4_197;
	Eq_2 ra_62 = printf(ra, &g_t230C41A4, (word32) bLoc20, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_180, out a0_181, out a1_182, out a2_183, out a3_59, out a4_184, out a5_185, out a7_186, out s2_187, out s3_188, out s4_189, out s5_190, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
	word32 a2_79;
	Eq_2 a4_83;
	word32 a0_198;
	word32 a1_199;
	word32 a5_200;
	word32 s4_201;
	word32 s8_202;
	puts(588005876, out a0_198, out a1_199, out a2_79, out a4_83, out a5_200, out s4_201, out s8_202);
	word32 a3_203;
	utils_time_date_from_epoch(sntp_get_time(fp + -44, fp + -40, a2_79, a3_59, a4_83, mstatus, dwLoc08, out a3_203), fp + -36);
	word32 s1_204;
	word32 a0_205;
	word32 a1_206;
	word32 a2_207;
	word32 a3_208;
	word32 a4_209;
	word32 a5_210;
	word32 a7_211;
	word32 s2_212;
	word32 s3_213;
	word32 s4_214;
	word32 s5_215;
	word32 s6_216;
	word32 s7_217;
	word32 s8_218;
	word32 s9_219;
	word32 s10_220;
	word32 s11_221;
	word32 t4_222;
	printf(ra_62, &g_t230C41A4, (word32) bLoc20, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_204, out a0_205, out a1_206, out a2_207, out a3_208, out a4_209, out a5_210, out a7_211, out s2_212, out s3_213, out s4_214, out s5_215, out s6_216, out s7_217, out s8_218, out s9_219, out s10_220, out s11_221, out t4_222);
}

// 23078E8E: void cmd_sntp_time(Register Eq_2 ra, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cmd_sntp_time(Eq_2 ra, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	Eq_2 a3_16;
	sntp_get_time(fp + ~0x17, fp + ~0x13, a2, a3, a4, mstatus, dwArg18, out a3_16);
	word32 s1_62;
	word32 a0_63;
	word32 a1_64;
	word32 a2_65;
	word32 a3_66;
	word32 a4_67;
	word32 a5_68;
	word32 a7_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s5_73;
	word32 s6_74;
	word32 s7_75;
	word32 s8_76;
	word32 s9_77;
	word32 s10_78;
	word32 s11_79;
	word32 t4_80;
	printf(ra, &g_t230C4208, a3_16, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_62, out a0_63, out a1_64, out a2_65, out a3_66, out a4_67, out a5_68, out a7_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out s8_76, out s9_77, out s10_78, out s11_79, out t4_80);
}

