pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23078EB2: void cmd_sntp_start(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cmd_sntp_start(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	word32 s1_36;
	word32 a0_37;
	word32 a3_38;
	word32 a4_39;
	word32 s2_40;
	word32 s4_41;
	word32 s6_42;
	tcpip_callback(587697594, 0x00, a3, a4, mstatus, dwArgD8, dwArg0118, dwArg0158, out s1_36, out a0_37, out a3_38, out a4_39, out s2_40, out s4_41, out s6_42);
}

// 23078EC0: void sntp_cli_init()
// Called from:
//      aos_loop_proc
void sntp_cli_init()
{
}

// 23078EC4: void sntp_retry(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34)
// Called from:
//      sntp_recv
//      sntp_dns_found
void sntp_retry(Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34)
{
	word32 * a3_20;
	word32 s8_57;
	word32 a4_56;
	word32 a2_55;
	word32 a0_54;
	word32 s1_53;
	sys_timeout(s1, &g_t23079134, a3, a4, mstatus, dwArg34, out s1_53, out a0_54, out a2_55, out a3_20, out a4_56, out s8_57);
	word32 s0_28 = *a3_20;
	if (a3_20 << 0x01 <= 150000 && a3_20 < a3_20 << 0x01)
		null[a3_20].dw0000 = s0_28;
}

// 23078F02: void sntp_recv(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void sntp_recv(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, word32 dwArg0128)
{
	word32 s8_436;
	word32 s7_435;
	word32 s6_434;
	word32 s5_433;
	word32 s3_432;
	word32 s2_431;
	word32 a5_429;
	word32 a7_430;
	word32 a0_425;
	word32 a1_426;
	word32 a2_427;
	word32 a4_428;
	word32 s9_437;
	word32 s10_438;
	word32 s11_439;
	word32 t4_440;
	Eq_2 s1_108;
	Eq_2 a3_104;
	Eq_2 s4_113;
	Eq_2 ra_107 = printf(ra, &g_t230C4284, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_108, out a0_425, out a1_426, out a2_427, out a3_104, out a4_428, out a5_429, out a7_430, out s2_431, out s3_432, out s4_113, out s5_433, out s6_434, out s7_435, out s8_436, out s9_437, out s10_438, out s11_439, out t4_440);
	Eq_2 a4_105 = (word32) *((word32) s1_108 + 8);
	if (a4_105 == 48)
	{
		Eq_2 a0_46 = pbuf_get_at(s1_108, 0x00, out a3_104, out a4_105);
		word32 a5_53 = (word32) g_b4200F6AC;
		if (a5_53 == 0x00)
		{
			if ((a0_46 & 0x07) != 0x04)
				goto l23078F70;
		}
		else
		{
			a4_105.u0 = 0x01;
			if (a5_53 != 0x01 || (a0_46 & 0x07) != 0x05)
				goto l23078F70;
		}
		Eq_2 a3_65;
		word32 a4_469;
		if (pbuf_get_at(s1_108, 0x01, out a3_65, out a4_469) == 0x00)
		{
			word32 a0_477;
			word32 a1_478;
			word32 a2_479;
			word32 a5_480;
			word32 a7_481;
			word32 s2_482;
			word32 s3_483;
			word32 s5_484;
			word32 s6_485;
			word32 s7_486;
			word32 s8_487;
			word32 s9_488;
			word32 s10_489;
			word32 s11_490;
			word32 t4_491;
			ra_107 = printf(ra_107, &g_t230C4294, a3_65, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_108, out a0_477, out a1_478, out a2_479, out a3_104, out a4_105, out a5_480, out a7_481, out s2_482, out s3_483, out s4_113, out s5_484, out s6_485, out s7_486, out s8_487, out s9_488, out s10_489, out s11_490, out t4_491);
		}
		else
		{
			word32 a0_470;
			word32 a1_471;
			word32 a2_472;
			word32 a5_473;
			word32 s2_474;
			word32 s3_475;
			word32 s8_476;
			pbuf_copy_partial(s1_108, fp + -40, 0x08, 40, out s1_108, out a0_470, out a1_471, out a2_472, out a3_104, out a4_105, out a5_473, out s2_474, out s3_475, out s4_113, out s8_476);
		}
	}
l23078F70:
	word32 s0_135;
	Eq_2 a3_139;
	ptr32 mstatus_156;
	Eq_2 a0_160;
	Eq_2 a3_165;
	Eq_2 a4_166;
	Eq_2 s1_169;
	word32 s1_441;
	word32 a0_442;
	word32 a1_443;
	word32 a2_444;
	word32 a4_445;
	word32 a5_446;
	word32 a7_447;
	word32 s2_448;
	word32 s3_449;
	word32 s4_450;
	word32 s5_451;
	word32 s6_452;
	word32 s8_453;
	word32 a1_454;
	word32 a2_455;
	word32 a5_456;
	word32 a7_457;
	word32 s2_458;
	word32 s3_459;
	word32 s4_460;
	word32 s5_461;
	word32 s6_462;
	word32 s7_463;
	word32 s8_464;
	word32 s9_465;
	word32 s10_466;
	word32 s11_467;
	word32 t4_468;
	Eq_2 ra_168 = printf(pbuf_free(ra_107, s1_108, a3_104, a4_105, s4_113, mstatus, dwArgF8, out s0_135, out s1_441, out a0_442, out a1_443, out a2_444, out a3_139, out a4_445, out a5_446, out a7_447, out s2_448, out s3_449, out s4_450, out s5_451, out s6_452, out s8_453, out mstatus_156), &g_t230C42B8, a3_139, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_169, out a0_160, out a1_454, out a2_455, out a3_165, out a4_166, out a5_456, out a7_457, out s2_458, out s3_459, out s4_460, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
	if (s0_135 == 0x00)
	{
		word32 a3_492;
		word32 a4_493;
		word32 a5_494;
		Eq_2 a0_199 = lwip_htonl(a0_160, out a3_492, out a4_493, out a5_494);
		Eq_2 a3_208;
		word32 a4_495;
		word32 a5_496;
		lwip_htonl(a0_199, out a3_208, out a4_495, out a5_496);
		Eq_2 a3_219;
		Eq_2 a4_220;
		uint32 s1_223;
		uint32 * s2_226;
		union Eq_439161 * s3_227;
		word32 a0_497;
		word32 a1_498;
		word32 a2_499;
		word32 a5_500;
		word32 a7_501;
		word32 s4_502;
		word32 s5_503;
		word32 s6_504;
		word32 s7_505;
		word32 s8_506;
		word32 s9_507;
		word32 s10_508;
		word32 s11_509;
		word32 t4_510;
		Eq_2 ra_222 = printf(ra_168, &g_t230C42C8, a3_208, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_223, out a0_497, out a1_498, out a2_499, out a3_219, out a4_220, out a5_500, out a7_501, out s2_226, out s3_227, out s4_502, out s5_503, out s6_504, out s7_505, out s8_506, out s9_507, out s10_508, out s11_509, out t4_510);
		word32 a5_511;
		vTaskEnterCritical(a4_220, mstatus_156, out a5_511);
		*s3_227 = (word32) a0_199 + 0x7C558180;
		*s2_226 = s1_223;
		word32 a5_512;
		g_t4200F6B8 = xTaskGetTickCount(out a5_512);
		Eq_439161 a1_249 = *s3_227;
		uint32 a0_253 = (*s2_226 >> 1000) + ((word32) a1_249.u1 + 1000);
		bl_sys_time_update(a0_253, (bool) ((a1_249 > 1000) + (a0_253 < (word32) a1_249.u1 + 1000)));
		word32 a4_513;
		word32 a5_514;
		word32 s1_515;
		word32 a0_516;
		word32 a1_517;
		word32 a2_518;
		word32 a3_519;
		word32 a4_520;
		word32 a5_521;
		word32 a7_522;
		word32 s2_523;
		word32 s3_524;
		word32 s4_525;
		word32 s5_526;
		word32 s6_527;
		word32 s7_528;
		word32 s8_529;
		word32 s9_530;
		word32 s10_531;
		word32 s11_532;
		word32 t4_533;
		printf(ra_222, g_a230C42D8, vTaskExitCritical(a3_219, mstatus_156, out a4_513, out a5_514), dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_515, out a0_516, out a1_517, out a2_518, out a3_519, out a4_520, out a5_521, out a7_522, out s2_523, out s3_524, out s4_525, out s5_526, out s6_527, out s7_528, out s8_529, out s9_530, out s10_531, out s11_532, out t4_533);
		g_b4201B288 = (byte) ((word32) g_b4201B288 | 1);
		if ((word32) g_b4200F6AC == 0x00)
		{
			word32 a3_534;
			sys_untimeout(587697860, 0x00, mstatus_156, out a3_534);
			Eq_2 a3_317;
			Eq_2 s1_321 = sys_untimeout(587698484, 0x00, mstatus_156, out a3_317);
			g_dw4200F6B4 = 0x03FFFA98;
			word32 s1_535;
			word32 a0_536;
			word32 a2_537;
			word32 a3_538;
			word32 a4_539;
			word32 s8_540;
			sys_timeout(s1_321, &g_t23079134, a3_317, 0x4200F000, mstatus_156, dwArg14, out s1_535, out a0_536, out a2_537, out a3_538, out a4_539, out s8_540);
		}
	}
	else if (s0_135 == 0x01 && (word32) g_b4200F6AC == 0x00)
		sntp_retry(s1_169, a3_165, a4_166, mstatus_156, dwArg04);
	0x00 = dwArg0128;
}

// 230790A8: void sntp_send_request(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
// Called from:
//      sntp_request
//      sntp_dns_found
void sntp_send_request(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	struct Eq_421193 * a1_129;
	word32 a0_20;
	Eq_2 s2_31;
	Eq_2 s4_33;
	word32 s0_197;
	word32 a1_198;
	word32 a2_199;
	word32 a5_200;
	word32 a7_201;
	word32 s3_202;
	word32 s5_203;
	word32 s6_204;
	word32 s8_205;
	Eq_2 s1_106;
	ptr32 mstatus_120;
	Eq_2 a4_127;
	Eq_2 a3_103;
	Eq_2 ra_37 = pbuf_alloc(ra, s0, s1, 0x00B6, 48, 640, a3, a4, mstatus, s0, dwArg34, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0148, out s0_197, out s1_106, out a0_20, out a1_198, out a2_199, out a3_103, out a4_127, out a5_200, out a7_201, out s2_31, out s3_202, out s4_33, out s5_203, out s6_204, out s8_205, out mstatus_120);
	if (a0_20 != 0x00)
	{
		Eq_2 a0_48 = *((word32) s1_106 + 4);
		word32 t1_206;
		word32 a0_207;
		word32 a1_208;
		word32 a2_209;
		word32 a3_210;
		word32 a4_211;
		word32 a5_212;
		Eq_2 ra_59 = memset(ra_37, s1_106, 0x00, 48, out t1_206, out a0_207, out a1_208, out a2_209, out a3_210, out a4_211, out a5_212);
		*s1_106 = 0x23;
		Eq_2 a3_72;
		Eq_2 a4_73;
		ptr32 mstatus_77;
		Eq_2 s0_79;
		Eq_2 s4_83;
		word32 s1_213;
		word32 a0_214;
		word32 a2_215;
		word32 s3_216;
		word32 s5_217;
		word32 s9_218;
		word32 s0_219;
		word32 a0_220;
		word32 a1_221;
		word32 a2_222;
		word32 a4_223;
		word32 a5_224;
		word32 a7_225;
		word32 s2_226;
		word32 s3_227;
		word32 s4_228;
		word32 s5_229;
		word32 s6_230;
		word32 s8_231;
		pbuf_free(udp_sendto(ra_59, g_t4200F6B0, a0_48, s2_31, 0x007B, s4_33, mstatus_120, dwArg04, dwArg18, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_79, out s1_213, out a0_214, out a2_215, out a3_72, out a4_73, out s3_216, out s4_83, out s5_217, out s9_218, out mstatus_77), s0_79, a3_72, a4_73, s4_83, mstatus_77, dwArg0118, out s0_219, out s1_106, out a0_220, out a1_221, out a2_222, out a3_103, out a4_223, out a5_224, out a7_225, out s2_226, out s3_227, out s4_228, out s5_229, out s6_230, out s8_231, out mstatus_120);
		ui32 a4_124 = (word32) g_b4201B288;
		g_b4201B288 = (byte) (a4_124 << 1);
		a4_127 = a4_124 << 1;
		a1_129 = &g_t23078EC4;
	}
	else
		a1_129 = &g_t23079134;
	0x00 = (int8) dwArg38;
	word32 s1_232;
	word32 a0_233;
	word32 a2_234;
	word32 a3_235;
	word32 a4_236;
	word32 s8_237;
	sys_timeout(s1_106, a1_129, a3_103, a4_127, mstatus_120, dwArg44, out s1_232, out a0_233, out a2_234, out a3_235, out a4_236, out s8_237);
}

// 23079134: void sntp_request(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_439481) a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void sntp_request(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, struct Eq_439481 * a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 s0_12;
	struct Eq_439506 * s0_8 = *a0;
	if (a0 != 0x00)
	{
		s0_8->dw0004 = 0x00;
		word32 a0_24;
		word32 s2_229;
		word32 s3_230;
		word32 s4_231;
		ra = dns_gethostbyname(ra, a0, fp + ~0x13, 0x00, s2, s5, s6, s8, mstatus, dwLoc18, dwLoc04, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgC8, dwArg0108, dwArg0148, out s0_12, out s1, out a0_24, out a3, out a4, out s2_229, out s3_230, out s4_231, out mstatus);
		if (a0_24 == ~0x04)
			return;
		if (a0_24 == 0x00)
		{
			*(union Eq_2 *) ~0x00 = s0_12;
l23079166:
			sntp_send_request(ra, s0_12, s1, a3, a4, mstatus, dwLoc1C, dwLoc08, dwArg14, dwArg18, dwArg24, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128);
			return;
		}
	}
	else
	{
		s0_12 = a5->t0004;
		if (a5 != null)
			goto l23079166;
	}
	word32 s1_232;
	word32 a0_233;
	word32 a2_234;
	word32 a3_235;
	word32 a4_236;
	word32 s8_237;
	sys_timeout(s1, &g_t23078EC4, a3, a4, mstatus, dwArg24, out s1_232, out a0_233, out a2_234, out a3_235, out a4_236, out s8_237);
}

// 23079190: void sntp_dns_found(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
void sntp_dns_found(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	if (a1 == 0x00)
		sntp_retry(s1, a3, a4, mstatus, dwArg34);
	else
	{
		g_t4201B284 = a4;
		sntp_send_request(ra, s0, s1, a3, a4, mstatus, dwArg04, dwArg18, dwArg34, dwArg38, dwArg44, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0148);
	}
}

// 230791A8: void sntp_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 word32) a5, Register ptr32 mstatus, Stack (ptr32 Eq_2) dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      _startup_sntp
void sntp_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, word32 * a5, ptr32 mstatus, union Eq_2 * dwArg10, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s0_8 = *a5;
	if (a5 != null)
		return;
	Eq_2 a3_18;
	word32 s1_196;
	word32 a4_197;
	word32 a5_198;
	Eq_2 ra_21 = udp_new_ip_type(ra, s1, a3, a4, mstatus, out s1_196, out a3_18, out a4_197, out a5_198);
	*(word32 *) 46 = s0_8;
	Eq_2 a0_30;
	word32 s1_199;
	word32 a1_200;
	word32 a2_201;
	word32 a3_202;
	word32 a4_203;
	word32 a5_204;
	word32 a7_205;
	word32 s2_206;
	word32 s3_207;
	word32 s4_208;
	word32 s5_209;
	word32 s6_210;
	word32 s7_211;
	word32 s8_212;
	word32 s9_213;
	word32 s10_214;
	word32 s11_215;
	word32 t4_216;
	printf(ra_21, &g_t230C4268, a3_18, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_199, out a0_30, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
	if (a0_30 == 0x00)
		return;
	udp_recv(a0_30, &g_t23078F02, 0x00);
	word32 a5_57 = (word32) g_b4200F6AC;
	if (a5_57 != 0x00)
	{
		if (a5_57 != 0x01)
			return;
		*((word32) a0_30 + 9) = (byte) ((word32) *((word32) a0_30 + 9) | 32);
		word32 a3_229;
		word32 a4_230;
		word32 a5_231;
		udp_bind(a0_30, 588036828, dwArg10, out a3_229, out a4_230, out a5_231);
	}
	else
	{
		g_dw4200F6B4 = 0x03FFFA98;
		Eq_2 a3_86;
		Eq_2 a4_87;
		word32 a0_217;
		word32 a1_218;
		word32 a2_219;
		word32 a5_220;
		word32 s4_221;
		word32 s8_222;
		Eq_2 s1_89 = bl_rand(a0_30, null, out a0_217, out a1_218, out a2_219, out a3_86, out a4_87, out a5_220, out s4_221, out s8_222);
		word32 s1_223;
		word32 a0_224;
		word32 a2_225;
		word32 a3_226;
		word32 a4_227;
		word32 s8_228;
		sys_timeout(s1_89, &g_t23079134, a3_86, a4_87, mstatus, dwArg44, out s1_223, out a0_224, out a2_225, out a3_226, out a4_227, out s8_228);
	}
}

// 23079250: void sntp_setoperatingmode(Register word32 a0)
// Called from:
//      _startup_sntp
void sntp_setoperatingmode(word32 a0)
{
	g_b4200F6AC = (byte) a0;
}

// 2307925A: Register (ptr32 Eq_2) sntp_get_time(Register (ptr32 Eq_2) a0, Register Eq_438686 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38, Register out Eq_2 a3Out)
// Called from:
//      cmd_sntp_date
//      cmd_sntp_time
union Eq_2 * sntp_get_time(union Eq_2 * a0, Eq_438686 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg38, union Eq_2 & a3Out)
{
	word32 a5_20;
	vTaskEnterCritical(a4, mstatus, out a5_20);
	if (a5_20 == 0x00)
	{
		*a0 = (union Eq_2 *) 0x00;
		(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&a1.a0000[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0] = (Eq_438686) 0x00;
	}
	else
	{
		word32 a5_69;
		ui32 a0_30 = xTaskGetTickCount(out a5_69) - g_t4200F6B8;
		Eq_439749 a5_32 = g_t4200F6A4;
		a3 = (a0_30 ^ 1000) + a2;
		*a0 = (union Eq_2 *) a3;
		Mem39[(a0_30 | 1000) + (a5_32 >>u 1000):word32] = a1;
	}
	word32 a5_71;
	word32 a4_70;
	Eq_2 a3_46 = vTaskExitCritical(a3, mstatus, out a4_70, out a5_71);
	0x00 = dwArg38;
	a3Out = a3_46;
	return null;
}

// 230792C6: Register word32 sntp_setservername(Register word32 a0, Register word32 a1)
// Called from:
//      _startup_sntp
word32 sntp_setservername(word32 a0, word32 a1)
{
	if (a0 == 0x00)
	{
		g_dw4201B280 = a1;
		a5 = 0x4201B000;
	}
	return a5;
}

// 230792D2: void utils_sha256_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      ota_tcp_cmd
void utils_sha256_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	memset(ra, a0, 0x00, 0x006C, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 230792DC: void utils_sha256_free(Register Eq_2 a0)
// Called from:
//      ota_tcp_cmd
void utils_sha256_free(Eq_2 a0)
{
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_5;
			if (a0_5 == (word32) a0 + 0x006C)
				break;
			*a0_5 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
}

