pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307A07C: void utils_sha256_finish(Register uint32 t1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_333024 a7, Stack Eq_2 dwArg28, Stack Eq_2 dwArg88)
// Called from:
//      ota_tcp_cmd
void utils_sha256_finish(uint32 t1, Eq_2 a2, Eq_2 a5, Eq_333024 a7, Eq_2 dwArg28, Eq_2 dwArg88)
{
	Eq_2 a5_43;
	ui32 a5_17 = a5 << 3 | a2 >> 0x1D;
	if ((a2 & 63) <= 55)
		a5_43.u0 = 56;
	else
		a5_43.u0 = 0x0078;
	Eq_2 a3_62;
	Eq_2 a5_64;
	Eq_333024 a7_66;
	struct Eq_441359 * s0_94;
	struct Eq_441332 * s1_95;
	word32 a7_234;
	word32 a5_233;
	word32 a3_232;
	utils_sha256_update.part.0(utils_sha256_update(t1, 588006388, a5_43 - (a2 & 63), a5_17 << 0x08, a5_43, a7, dwArg28, dwArg88, out a3_62, out a5_64, out a7_66), fp + ~0x17, 0x08, a3_62, a5_64, a7_66, dwArg28, dwArg88, out s0_94, out s1_95, out a3_232, out a5_233, out a7_234);
	s1_95->b0000 = (byte) (word32) s0_94->b000B;
	uint32 a5_112 = (word32) s0_94->w000A;
	s1_95->b0001 = (byte) a5_112;
	s1_95->b0002 = (byte) (a5_112 >> 8);
	struct Eq_441407 * s0_117 = (a5_112 >> 8)->ptr0008;
	s1_95->b0003 = (byte) (a5_112 >> 8);
	s1_95->b0004 = (byte) (word32) s0_117->b000F;
	uint32 a5_121 = (word32) s0_117->w000E;
	s1_95->b0005 = (byte) a5_121;
	s1_95->b0006 = (byte) (a5_121 >> 8);
	struct Eq_441440 * s0_126 = (a5_121 >> 8)->ptr000C;
	s1_95->b0007 = (byte) (a5_121 >> 8);
	s1_95->b0008 = (byte) (word32) s0_126->b0013;
	uint32 a5_130 = (word32) s0_126->w0012;
	s1_95->b0009 = (byte) a5_130;
	s1_95->b000A = (byte) (a5_130 >> 8);
	struct Eq_441473 * s0_135 = (a5_130 >> 8)->ptr0010;
	s1_95->b000B = (byte) (a5_130 >> 8);
	s1_95->b000C = (byte) (word32) s0_135->b0017;
	uint32 a5_139 = (word32) s0_135->w0016;
	s1_95->b000D = (byte) a5_139;
	s1_95->b000E = (byte) (a5_139 >> 8);
	struct Eq_441506 * s0_144 = (a5_139 >> 8)->ptr0014;
	s1_95->b000F = (byte) (a5_139 >> 8);
	s1_95->b0010 = (byte) (word32) s0_144->b001B;
	uint32 a5_148 = (word32) s0_144->w001A;
	s1_95->b0011 = (byte) a5_148;
	s1_95->b0012 = (byte) (a5_148 >> 8);
	struct Eq_441539 * s0_153 = (a5_148 >> 8)->ptr0018;
	s1_95->b0013 = (byte) (a5_148 >> 8);
	s1_95->b0014 = (byte) (word32) s0_153->b001F;
	uint32 a5_157 = (word32) s0_153->w001E;
	s1_95->b0015 = (byte) a5_157;
	s1_95->b0016 = (byte) (a5_157 >> 8);
	struct Eq_441572 * s0_162 = (a5_157 >> 8)->ptr001C;
	s1_95->b0017 = (byte) (a5_157 >> 8);
	s1_95->b0018 = (byte) (word32) s0_162->b0023;
	uint32 a5_166 = (word32) s0_162->w0022;
	s1_95->b0019 = (byte) a5_166;
	s1_95->b001A = (byte) (a5_166 >> 8);
	s1_95->b001B = (byte) (a5_166 >> 8);
	struct Eq_441326 * s0_173 = (a5_166 >> 8)->ptr0068;
	if (a5_166 >> 8 == 0x00)
	{
		s1_95->b001C = (byte) (word32) s0_173->b0027;
		uint32 a5_176 = (word32) s0_173->w0026;
		s1_95->b001D = (byte) a5_176;
		s1_95->b001E = (byte) (a5_176 >> 8);
		s1_95->b001F = (byte) (a5_176 >> 8);
	}
}

// 2307A208: Register Eq_2 bl_printk(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out (ptr32 Eq_2297) s1Out, Register out (ptr32 Eq_274) a0Out, Register out (ptr32 Eq_2299) a1Out, Register out Eq_2300 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_2302) a4Out, Register out (ptr32 Eq_2303) a5Out, Register out Eq_2304 s2Out, Register out Eq_2305 s3Out, Register out (ptr32 Eq_2306) s4Out, Register out Eq_2307 s5Out, Register out (ptr32 Eq_2308) s6Out, Register out Eq_2309 s7Out, Register out (ptr32 Eq_2310) s8Out, Register out (ptr32 Eq_2311) s9Out, Register out (ptr32 Eq_2312) s10Out, Register out (ptr32 Eq_2313) s11Out)
// Called from:
//      get_dts_addr.part.2
//      bl_main_cfg_task_req
//      tc_blfdtdump
//      tc_fdt_wifi_module
//      cmd_blog_info_dump
//      cmd_blog_set_level
//      blog_port_output
//      blog_init
//      __bl_ble_sync_task
//      __recv_event
//      write_data
//      __ble_bytes_send
//      read_data
//      bl_ble_sync_start
//      __malloc
//      __free
//      pro_trans_read
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_test_cmd
//      bl_dma_IRQHandler
//      bl_dma_irq_register
//      bl_dma_init
//      _irq_num_check.part.0
//      bl_irq_register
//      bl_irq_unregister
//      wait_trng4feed
//      sec_trng_IRQHandler
//      bl_sec_test
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      cmd_wdt_init
//      dev_uart_init
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      _dump_partition
//      hal_boot2_init
//      hal_board_cfg
//      bl_tsen_adc_get
//      bl_flash_config_update
//      _cb_led_trigger
//      _led_bloop_msg
//      _led_bloop_evt
//      loopset_led_trigger
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_stat
//      romfs_open
//      romfs_register
//      log_buf_out
//      bl_mtd_write
//      bloop_run
//      bl_sha_mutex_take
//      bl_sha_mutex_give
//      hal_hbn_init
Eq_2 bl_printk(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, struct Eq_2297 & s1Out, struct Eq_274 & a0Out, struct Eq_2299 & a1Out, union Eq_2300 & a2Out, union Eq_2 & a3Out, struct Eq_2302 & a4Out, struct Eq_2303 & a5Out, union Eq_2304 & s2Out, union Eq_2305 & s3Out, struct Eq_2306 & s4Out, union Eq_2307 & s5Out, struct Eq_2308 & s6Out, union Eq_2309 & s7Out, struct Eq_2310 & s8Out, struct Eq_2311 & s9Out, struct Eq_2312 & s10Out, struct Eq_2313 & s11Out)
{
	ui32 a5_7 = (word32) g_b4200ECB8;
	struct Eq_2303 * a5_22 = a5_7 & 0x00FF;
	if ((a5_7 & 0x00FF) != 0x00)
	{
		word32 a7_120;
		word32 t4_121;
		ra = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1, out a0, out a1, out a2, out a3, out a4, out a5_22, out a7_120, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_121);
	}
	s1Out = s1;
	a0Out = a0;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_22;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

