pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307A236: Register Eq_2 log_buf_out(Register Eq_2 ra, Register Eq_2 a2, Register (ptr32 Eq_485217) a3, Register Eq_328497 a4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack word32 dwArg010C, Register out (ptr32 Eq_328508) s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_485217) a3Out, Register out Eq_328497 a4Out, Register out Eq_328512 a5Out, Register out (ptr32 Eq_485217) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out (ptr32 Eq_328518) s7Out, Register out ptr32 s8Out, Register out Eq_328520 s9Out)
// Called from:
//      tc_fdt_wifi_module
//      hal_board_cfg
//      file_info
//      romfs_register
//      bl_hbn_enter
Eq_2 log_buf_out(Eq_2 ra, Eq_2 a2, union Eq_485217 * a3, Eq_328497 a4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, word32 dwArg010C, struct Eq_328508 & s0Out, ptr32 & s1Out, union Eq_485217 & a3Out, union Eq_328497 & a4Out, union Eq_328512 & a5Out, union Eq_485217 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, struct Eq_328518 & s7Out, ptr32 & s8Out, union Eq_328520 & s9Out)
{
	if (a3 <= null)
	{
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		return ra;
	}
	else
	{
		union Eq_485217 * s2_200;
		Eq_2 s6_204;
		Eq_328520 s9_118;
		ptr32 s3_110;
		struct Eq_328518 * s7_205;
		Eq_328512 a5_210 = 50;
		Eq_328497 s1_10 = a4;
		Eq_328497 a4_11 = a3 | 50;
		Eq_2 s0_221 = a2;
		Eq_2 s5_203 = a1;
		Eq_2 s8_206 = a3 ^ 50;
		if ((a3 | 50) == 0x00)
		{
			s3_110 = 0x4201B000;
			s7_205 = &g_t230C4000;
			s9_118.u0 = 0x230C4000;
			Eq_2 s8_219 = (word32) a2 + ((a3 ^ 50) + 50);
			s6_204 = s6;
			s2_200 = s2;
			while (s8_219 != s0_221)
			{
				word32 s6_240 = 0x00;
				Eq_328497 s10_242 = 0x01;
				Eq_328497 s11_243 = 0x02;
				do
				{
					struct Eq_274 * a1_258;
					Eq_2 a0_250 = s6_240 + 1107407500;
					if (s1_10 != s10_242)
					{
						a1_258 = (word32) s9_118.u0 + 0x043C;
						if (s1_10 != s11_243)
							a1_258 = (struct Eq_274 *) &g_t230C4444;
					}
					else
						a1_258 = (struct Eq_274 *) (s7_205 + 0x0434);
					word32 a0_271;
					word32 s0_279;
					word32 s2_283;
					Eq_2 s4_285;
					word32 s6_287;
					word32 a5_772;
					word32 a4_771;
					word32 s3_773;
					word32 s5_774;
					word32 s8_775;
					word32 a1_769;
					word32 a2_770;
					ra = sprintf(ra, a0_250, a1_258, s6, dwLoc18, dwArg14, dwArg30, a3 | 50, dwArg58, dwArg7C, out s0_279, out s1_10, out a0_271, out a1_769, out a2_770, out a4_771, out a5_772, out s2_283, out s3_773, out s4_285, out s5_774, out s6_287, out s7_205, out s8_775, out s9_118, out s10_242, out s11_243);
					s6_240 = s6_287 + a0_271;
				} while (s2_283 != ~0x30);
				if (g_t4200F560 != 0x00)
				{
					word32 a5_777;
					xTaskGetTickCountFromISR(out a5_777);
				}
				else
				{
					word32 a5_776;
					xTaskGetTickCount(out a5_776);
				}
				word32 s4_782;
				word32 a3_781;
				word32 s10_783;
				word32 s11_784;
				word32 a0_778;
				word32 a1_779;
				word32 a2_780;
				ra = bl_printk(ra, &g_t230C445C, s4_285, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_10, out a0_778, out a1_779, out a2_780, out a3_781, out a4_11, out a5_210, out s2_200, out s3_110, out s4_782, out s5_203, out s6_204, out s7_205, out s8_219, out s9_118, out s10_783, out s11_784);
				s0_221 = s0_279 + 50;
			}
		}
		else
		{
			Eq_2 s6_214 = 0x00;
			s3_110 = 1107407500;
			s9_118.u0 = 0x230C4000;
			word32 s10_123 = 0x230C4000;
			word32 s11_121 = 0x230C4000;
			while (true)
			{
				Eq_2 s4_146;
				word32 s2_105 = 0x00;
				if (s8_206 == s6_214)
				{
					do
					{
						struct Eq_274 * a1_119;
						Eq_2 a0_112 = s3_110 + s2_105;
						if (s1_10 != 0x01)
						{
							a1_119 = s11_121 + 0x043C;
							if (s1_10 != 0x02)
								a1_119 = s10_123 + 0x0444;
						}
						else
							a1_119 = (word32) s9_118.u0 + 0x0434;
						word32 a0_132;
						word32 a5_137;
						word32 s2_144;
						word32 s7_149;
						word32 s8_791;
						word32 a2_787;
						word32 a1_786;
						word32 a4_788;
						word32 s5_789;
						word32 s6_790;
						word32 s0_785;
						ra = sprintf(ra, a0_112, a1_119, s6, dwLoc18, dwArg14, dwArg30, a3 | 50, dwArg58, dwArg7C, out s0_785, out s1_10, out a0_132, out a1_786, out a2_787, out a4_788, out a5_137, out s2_144, out s3_110, out s4_146, out s5_789, out s6_790, out s7_149, out s8_791, out s9_118, out s10_123, out s11_121);
						s2_105 = s2_144 + a0_132;
					} while (a5_137 != s7_149 + 0x01);
				}
				else
				{
					do
					{
						struct Eq_274 * a1_67;
						Eq_2 a0_60 = s3_110 + s2_105;
						if (s1_10 != 0x01)
						{
							a1_67 = s11_121 + 0x043C;
							if (s1_10 != 0x02)
								a1_67 = s10_123 + 0x0444;
						}
						else
							a1_67 = (word32) s9_118.u0 + 0x0434;
						word32 a0_80;
						word32 s2_92;
						word32 s7_97;
						word32 s5_797;
						word32 a5_796;
						word32 a4_795;
						word32 a2_794;
						word32 a1_793;
						word32 s0_792;
						word32 s8_799;
						word32 s6_798;
						ra = sprintf(ra, a0_60, a1_67, s6, dwLoc18, dwArg14, dwArg30, a3 | 50, dwArg58, dwArg7C, out s0_792, out s1_10, out a0_80, out a1_793, out a2_794, out a4_795, out a5_796, out s2_92, out s3_110, out s4_146, out s5_797, out s6_798, out s7_97, out s8_799, out s9_118, out s10_123, out s11_121);
						s2_105 = s2_92 + a0_80;
					} while (s7_97 != ~0x30);
				}
				if (g_t4200F560 != 0x00)
				{
					word32 a5_801;
					xTaskGetTickCountFromISR(out a5_801);
				}
				else
				{
					word32 a5_800;
					xTaskGetTickCount(out a5_800);
				}
				word32 a1_803;
				word32 a5_806;
				word32 s4_807;
				word32 a3_805;
				word32 a2_804;
				word32 a0_802;
				ra = bl_printk(ra, &g_t230C445C, s4_146, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_10, out a0_802, out a1_803, out a2_804, out a3_805, out a4_11, out a5_806, out s2_200, out s3_110, out s4_807, out s5_203, out s6_204, out s7_205, out s8_206, out s9_118, out s10_123, out s11_121);
				a5_210 = (word32) s6_204 + 1;
				if (s6_204 >= s8_206)
					break;
				s6_214 = (word32) s6_204 + 1;
			}
		}
		0x00 = dwArg010C;
		s0Out = dwArgCC;
		s1Out = dwLoc4C;
		a3Out = s2;
		a4Out = a4_11;
		a5Out = a5_210;
		s2Out = s2_200;
		s3Out = s3_110;
		s4Out = dwArg0168;
		s5Out = s5_203;
		s6Out = s6_204;
		s7Out = s7_205;
		s8Out = dwArg0148;
		s9Out = s9_118;
		return dwLoc08;
	}
}

// 2307A3FE: Register Eq_2 utils_dns_domain_get(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 int32) a2, Register out ptr32 a4Out, Register out (ptr32 Eq_347950) a5Out)
// Called from:
//      get_dns_request
Eq_2 utils_dns_domain_get(Eq_2 a0, Eq_2 a1, int32 * a2, ptr32 & a4Out, struct Eq_347950 & a5Out)
{
	int32 a7_12 = *a2;
	ptr32 a4_11 = (word32) *a0;
	struct Eq_347950 * a5_19 = null;
	int32 t1_14 = 0x01;
	while (a4_11 != 0x00 && a7_12 > 0x00)
	{
		Mem22[a1 + a5_19:byte] = SLICE(CONVERT(Mem16[a0 + t1_14:byte], byte, word32), byte, 0);
		a4_11 += ~0x00;
		int32 a3_23 = t1_14 + 1;
		struct Eq_347950 * a6_24 = (char *) &a5_19->t0000 + 1;
		a7_12 += ~0x00;
		if (a4_11 == 0x00 && a7_12 != 0x00)
		{
			Mem28[a6_24 + a1:byte] = 0x2E;
			a4_11 = (word32) *((word32) a0 + a3_23);
			a6_24 = a5_19 + 1;
			a3_23 = t1_14 + 2;
		}
		a5_19 = a6_24;
		t1_14 = a3_23;
	}
	a5_19->t0000 = a2;
	a4Out = a4_11;
	a5Out = a5_19;
	return 0x00;
}

// 2307A456: void utils_list_init(Register (ptr32 Eq_96932) a0)
// Called from:
//      ipc_host_init
//      bl_dma_init
//      bloop_init
//      utils_notifier_chain_init
void utils_list_init(struct Eq_96932 * a0)
{
	a0->t0000.u0 = 0x00;
	a0->dw0004 = 0x00;
}

// 2307A460: void utils_list_push_back(Register Eq_2 a1, Register (ptr32 Eq_106483) a5)
// Called from:
//      bl_output
//      utils_notifier_chain_register
void utils_list_push_back(Eq_2 a1, struct Eq_106483 * a5)
{
	struct Eq_106483 * a0_10 = a5->ptr0000;
	if (a5 == null)
		*a1 = a0_10;
	else
	{
		a0_10 = a5->ptr0004;
		*a1 = a5;
	}
	*((word32) a1 + 4) = a0_10;
	*a1 = null;
}

