pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307A474: Register (ptr32 Eq_105929) utils_list_pop_front(Register Eq_2 a4, Register (ptr32 Eq_105929) a5, Register out (ptr32 Eq_105929) a5Out)
// Called from:
//      bl_tx_try_flush
//      bl_dma_IRQHandler
//      bloop_run
struct Eq_105929 * utils_list_pop_front(Eq_2 a4, struct Eq_105929 * a5, struct Eq_105929 & a5Out)
{
	struct Eq_105929 * a0_5 = a5->ptr0000;
	if (a5 != null)
	{
		a5 = (struct Eq_105929 *) *a4;
		*a4 = a0_5;
	}
	a5Out = a5;
	return a5;
}

// 2307A480: Register Eq_2 utils_hexdump(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s10, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out)
// Called from:
//      cmd_wifi_mib
//      hexdump_cmd
Eq_2 utils_hexdump(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s10, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, word32 dwArg0198, ptr32 & s0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out)
{
	Eq_2 s2_103 = a1;
	word32 s1_35 = 0x00;
	if ((a1 & 0x0F) != 0x00)
		s1_35 = 0x10 - (a1 & 0x0F);
	Eq_2 s1_100 = (word32) a1 + s1_35;
	Eq_2 s0_199 = 0x00;
	word32 s6_107 = 0x230C4000;
	word32 s7_108 = 0x230BF000;
	word32 s8_109 = 0x230C4000;
	while (s1_100 != s0_199)
	{
		if ((s0_199 & 0x0F) == 0x00)
		{
			word32 s9_516;
			word32 a5_510;
			word32 s1_505;
			word32 a0_506;
			word32 a1_507;
			word32 a2_508;
			word32 a7_511;
			word32 a4_509;
			word32 s4_513;
			word32 s3_512;
			word32 s5_514;
			word32 s6_515;
			word32 t4_519;
			word32 s10_517;
			word32 s11_518;
			ra = printf(ra, s6_107 + 1144, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_505, out a0_506, out a1_507, out a2_508, out a3, out a4_509, out a5_510, out a7_511, out s2_103, out s3_512, out s4_513, out s5_514, out s6_515, out s7_108, out s8_109, out s9_516, out s10_517, out s11_518, out t4_519);
		}
		int32 s3_104;
		byte (* s4_105)[];
		word32 s10_101;
		word32 s9_110;
		word32 s11_102;
		if (s0_199 < s2_103)
		{
			word32 a5_530;
			word32 a7_531;
			word32 s5_532;
			word32 t4_533;
			word32 a2_529;
			word32 a0_527;
			word32 a1_528;
			ra = printf(ra, s8_109 + 0x0444, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_100, out a0_527, out a1_528, out a2_529, out a3, out a4, out a5_530, out a7_531, out s2_103, out s3_104, out s4_105, out s5_532, out s6_107, out s7_108, out s8_109, out s9_110, out s10_101, out s11_102, out t4_533);
		}
		else
		{
			word32 a5_523;
			word32 a1_521;
			word32 a0_520;
			word32 a2_522;
			word32 a7_524;
			word32 t4_526;
			word32 s5_525;
			ra = printf(ra, s7_108 + -672, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_100, out a0_520, out a1_521, out a2_522, out a3, out a4, out a5_523, out a7_524, out s2_103, out s3_104, out s4_105, out s5_525, out s6_107, out s7_108, out s8_109, out s9_110, out s10_101, out s11_102, out t4_526);
		}
		Eq_2 s5_143 = (word32) s0_199 + 1;
		if (s11_102 == s9_110)
		{
			Eq_2 s11_146 = (word32) s0_199 - 0x0F;
			word32 a5_147 = 0x11;
			if (s5_143 < s11_146)
				a5_147 = 0x01;
			Eq_2 s0_152 = (word32) s0_199 - 16 + a5_147;
			while (s11_146 != s0_152)
			{
				Eq_442201 a0_155 = 32;
				if (s11_146 < s2_103)
				{
					a0_155 = CONVERT(Mem29[s4_105 + s11_146:byte], byte, word32);
					if (((word32) *((word32) a0_155 + s3_104) & 151) == 0x00)
						a0_155.u0 = 46;
				}
				s0_152 = bl_putchar(s1_100, a0_155, out s4_105);
				s11_146 = (word32) s11_146 + 1;
			}
			word32 s4_538;
			word32 a5_537;
			word32 a1_535;
			word32 a2_536;
			word32 a0_534;
			s1_100 = puts(s10_101 + -0x0700, out a0_534, out a1_535, out a2_536, out a4, out a5_537, out s4_538, out s8_109);
		}
		s0_199 = s5_143;
	}
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	a2Out = dwArg2C;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_103;
	return ra;
}

// 2307A570: void utils_time_date_from_epoch(Register Eq_2 a0, Register (ptr32 Eq_337156) a1)
// Called from:
//      cmd_sys_time_now
//      cmd_sntp_date
void utils_time_date_from_epoch(Eq_2 a0, struct Eq_337156 * a1)
{
	a1->t0006.u1 = 0x00;
	a1->b0002 = (byte) (a0 & 60);
	a1->b0001 = (byte) (a0 >> 60 & 60);
	a1->b0000 = (byte) (a0 >> 0x00FFFE10 & 0x18);
	(a0 >> 0x15000180)->ptr000C = a1;
	a1->b0003 = (byte) (word32) ((a0 >> 0x15000180 & 0x07) + fp)->bFFFFFFEC;
	struct Eq_442285 * a0_51 = (a0 >> 31536000) + 0x07B2;
	a0_51->ptr0008 = a1;
	struct Eq_442285 * a4_50 = (struct Eq_442285 *) 0x07B4;
	while (a4_50 < a0_51)
	{
		if ((a4_50 | 100) != 0x00 || (a4_50 | 400) == 0x00)
			a1->t0006 = (byte) ((word32) a1->t0006 + 0x01);
		a4_50 = (struct Eq_442285 *) ((char *) a4_50 + 4);
	}
	uint32 a5_74 = (a0 >> 0x15000180) - (word32) a1->t0006;
	struct Eq_442306 * a4_77 = (a5_74 >> 365) + 0x07B2;
	a4_77->ptr0008 = a1;
	struct Eq_442314 * a5_80 = (a5_74 & 365) + 0x01;
	a5_80->ptr0010 = a1;
	if ((a4_77 & 3) == 0x00 && (a4_77 & 100) != 0x00 || (a4_77 & 400) == 0x00)
		a1->b0007 = 0x01;
	a1->b0005 = 0x00;
	struct Eq_442314 * a4_100 = null;
	while (true)
	{
		Eq_442378 a3_104 = (word32) a1->b0005;
		struct Eq_442361 * a2_107 = (word32) a3_104 + fp;
		if (a3_104 > 11 || a4_100 >= a5_80)
			break;
		word32 a2_111 = (word32) a2_107->bFFFFFFF4;
		a1->b0005 = (byte) ((word32) a3_104 + 1);
		a4_100 = (word32) (word16) (a4_100 + a2_111 / 20);
	}
	a1->b0004 = (byte) (a5_80 - (a4_100 - (word32) a2_107->bFFFFFFF3));
}

// 2307A6B0: void utils_getopt_init(Register Eq_2 a0, Register (ptr32 Eq_118158) a1)
// Called from:
//      cmd_wifi_cfg
void utils_getopt_init(Eq_2 a0, struct Eq_118158 * a1)
{
	if (a0 == 0x00)
		return;
	*a0 = 0x00;
	*(union Eq_2 *) 0x05 = a0;
	a1->t0008 = a0;
	*((word32) a0 + 0x0C) = 0x00;
	*((word32) a0 + 16) = 0x00;
}

// 2307A6CC: Register Eq_2 utils_getopt(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_118136) a1, Register (arr (ptr32 Eq_442586)) a2, Register (ptr32 byte) a3, Register (ptr32 Eq_118136) a4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_118440) a0Out, Register out (ptr32 Eq_118136) a1Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_118444 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      cmd_wifi_cfg
Eq_2 utils_getopt(Eq_2 ra, ptr32 a0, struct Eq_118136 * a1, struct Eq_442586 * a2[], byte * a3, struct Eq_118136 * a4, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, struct Eq_118440 & a0Out, struct Eq_118136 & a1Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_118444 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	if (a0 == 0x00)
	{
l2307A720:
		a0Out = (struct Eq_118440 *) ~0x00;
		a1Out = a1;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	Eq_2 a0_6 = a4->t0004;
	if (a4 >= a1)
	{
l2307A822:
		a0Out = (struct Eq_118440 *) ~0x00;
		a1Out = a1;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	struct Eq_442436 ** a2_13 = a2 + (a4 << 0x02) / 4;
	struct Eq_442436 * a6_14 = *a2_13;
	if (a6_14 == null)
		goto l2307A822;
	int32 t1_15 = (word32) a6_14->a0000[0].t0000;
	if (t1_15 != 45)
	{
		if ((word32) *a3 == 45)
		{
			a4->t0005 = a0_6;
			a4->t0001 = a0_6;
			a0Out = (struct Eq_118440 *) 0x01;
			a1Out = a1;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			return ra;
		}
		goto l2307A822;
	}
	int32 t3_17 = (word32) a6_14->b0001;
	struct Eq_442454 * a0_18 = (struct Eq_442454 *) ~0x00;
	if (t3_17 == 0x00)
		goto l2307A822;
	if (t3_17 == t1_15)
	{
		a0_18 = (word32) a6_14->b0002;
		if (a0_18 == null)
		{
			a4->t0005 = a0_6;
			goto l2307A720;
		}
	}
	Eq_2 a5_26 = a0_18->t0010;
	if (a0_18 == null)
		*(union Eq_2 *) 0x11 = a5_26;
	int32 t3_31 = *((word32) a5_26 + 16);
	struct Eq_118440 * a0_119 = (word32) *((char *) *a2_13 + t3_31);
	int32 t1_38 = (word32) (a0_119 != null) + t3_31;
	*((word32) a5_26 + 16) = t1_38;
	if ((word32) *((char *) *a2_13 + t1_38) == 0x00)
	{
		a4->t0005 = a5_26;
		*((word32) a5_26 + 16) = 0x00;
	}
	if (((word32) *a3 + -43 & 0x00FD) == 0x00)
		++a3;
	int32 a4_57 = 0x00;
	while (true)
	{
		struct Eq_274 * a0_131;
		Eq_2 a3_117;
		struct Eq_442571 * a4_61 = a3 + a4_57;
		int32 a2_59 = a4_57 + 1;
		struct Eq_118440 * t1_63 = (word32) a4_61->b0000;
		if (t1_63 == null)
			break;
		if (a0_119 == t1_63)
		{
			if (a0_119 == (struct Eq_118440 *) 58)
				goto l2307A786;
			goto l2307A7A4;
		}
		a4_57 = a2_59;
	}
	if (a0_119 != null)
	{
l2307A786:
		a0_119->t000C = a5_26;
		a3_117 = (word32) *a3;
		if (a3_117 == 58 || *((word32) a5_26 + 8) == 0x00)
			goto l2307A794;
		a0_131 = (struct Eq_274 *) &g_t230C4484;
		goto l2307A81C;
	}
	else
	{
l2307A7A4:
		struct Eq_118136 * t1_71 = (word32) a3[a2_59];
		if (t1_71 != (struct Eq_118136 *) 58)
			goto l2307A798;
		*a5_26 = 0x00;
		struct Eq_118136 * a4_100 = (word32) a4_61->b0002;
		if (a4_100 != t1_71 || true)
		{
			Eq_2 a5_83 = a4_100->t0004;
			*((word32) a5_83 + 4) = &a4_100->t0001;
			struct Eq_442586 * a4_95 = a2[a4_100];
			*((word32) a5_83 + 16) = 0x00;
			a4_95->t003A = a5_83;
			a4_100 = (struct Eq_118136 *) &a4_95->t003A;
		}
		Eq_2 a5_102 = a4_100->t0004;
		if (a1 < a4_100)
		{
			a0_119->t000C = a5_102;
			a3_117 = (word32) *a3;
			a0_119 = (struct Eq_118440 *) 58;
			if (a3_117 != 58)
			{
				if (*((word32) a5_102 + 8) == 0x00)
					goto l2307A794;
				a0_131 = (struct Eq_274 *) &g_t230C44A4;
l2307A81C:
				word32 s2_572;
				word32 t4_573;
				word32 a3_568;
				word32 a4_569;
				word32 a5_570;
				word32 a7_571;
				word32 s1_565;
				word32 a2_567;
				word32 a0_566;
				ra = printf(ra, a0_131, a3_117, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_565, out a0_566, out a1, out a2_567, out a3_568, out a4_569, out a5_570, out a7_571, out s2_572, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_573);
l2307A794:
				a0_119 = (struct Eq_118440 *) 63;
				goto l2307A798;
			}
		}
l2307A798:
		a0Out = a0_119;
		a1Out = a1;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
}

// 2307A824: Register (ptr32 Eq_442662) params_filter.isra.0.constprop.1(Register (ptr32 Eq_442662) a0, Register ptr32 a1, Register out Eq_442664 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      get_uint8_from_string
//      get_uint16_from_string
struct Eq_442662 * params_filter.isra.0.constprop.1(struct Eq_442662 * a0, ptr32 a1, union Eq_442664 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	word32 a3_12 = 0x0A;
	if ((word32) a0->b0000 == 48 && ((word32) a0[1] & 223) == 88)
	{
		a0 += 2;
		a3_12 = 0x10;
	}
	struct Eq_442675 * a5_13 = null;
	while (true)
	{
		int32 a4_20 = (word32) a0->b0000;
		if (a4_20 == 0x00)
			break;
		a2 = a4_20 + -48 & 0x00FF;
		a5_13 += a3_12 / 87;
		if (a2 <= 0x09)
		{
			a5_13 = (struct Eq_442675 *) ((char *) a5_13 - 48);
			goto l2307A866;
		}
		if (a3_12 == 0x0A)
		{
			a2Out = a2;
			a3Out.u0 = <invalid>;
			a4Out.u0 = <invalid>;
			return (struct Eq_442662 *) ~0x00;
		}
		if (a3_12 == 0x10)
		{
			a2 = a4_20 + -97 & 0x00FF;
			if (a2 <= 0x05)
			{
				a5_13 = (struct Eq_442675 *) ((char *) a5_13 - 87);
				goto l2307A866;
			}
			a2 = a4_20 + -65 & 0x00FF;
			if (a2 <= 0x05)
			{
				a4_20 += -55;
l2307A866:
				a5_13 += a4_20 / 87;
			}
		}
		++a0;
	}
	a5_13->dw0000 = a1;
	a2Out = a2;
	a3Out.u0 = <invalid>;
	a4Out.u0 = <invalid>;
	return null;
}

// 2307A8A6: Register word32 get_bytearray_from_string(Register Eq_2 a1, Register Eq_185491 a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_185491 s2Out, Register out Eq_2 s3Out)
// Called from:
//      blemesh_set_dev_uuid
//      blemesh_fault_set
//      ble_select_conn
//      ble_disconnect
//      ble_connect
//      ble_write
//      ble_unpair
//      ble_write_without_rsp
word32 get_bytearray_from_string(Eq_2 a1, Eq_185491 a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_185491 & s2Out, union Eq_2 & s3Out)
{
	Eq_2 s1_15 = a0;
	Eq_185491 s0_20 = 0x00;
	a1_23 = a1;
	while (true)
	{
		Eq_2 a1_23;
		if (s0_20 >= a2)
			break;
		word32 a2_114;
		word32 a3_115;
		word32 a4_116;
		word32 a5_117;
		strncpy(fp + -36, a1_23, 0x02, out a2_114, out a3_115, out a4_116, out a5_117);
		word32 a2_118;
		word32 a4_119;
		word32 a5_120;
		a0 = strtol(fp + -36, null, 0x10, out a1_23, out a2_118, out a3, out a4_119, out a5_120);
		word32 a5_58 = a1 + s0_20;
		a5_58->t0000 = (byte) a0;
		s1_15 = a5_58->t0000;
		a5_58->t0002 = s1_15;
		s0_20 = (word32) s0_20.u0 + 1;
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_15;
	a0Out = a0;
	a3Out = a3;
	s2Out = a2;
	s3Out = a1;
	return dwArgE4;
}

