pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307A8F6: Register Eq_2 get_uint8_from_string(Register Eq_2 s0, Register (ptr32 (ptr32 Eq_442662)) a0, Register Eq_2 a1, Register out (ptr32 Eq_2) a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s8Out)
// Called from:
//      blemesh_lpn_set
//      blemesh_net_send
//      blemesh_ivu_test
//      blemesh_fault_set
//      blemesh_pb
//      blemesh_iv_update
//      ble_set_tx_pwr
//      ble_security
//      ble_select_conn
//      ble_disconnect
//      ble_connect
//      ble_start_advertise
//      ble_set_adv_channel
//      ble_discover
//      ble_unpair
//      ble_start_scan
//      ble_write_without_rsp
Eq_2 get_uint8_from_string(Eq_2 s0, struct Eq_442662 ** a0, Eq_2 a1, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s8Out)
{
	byte bLoc14_35 = (byte) s0;
	ptr32 a3_16;
	ptr32 a4_17;
	word32 a2_53;
	union Eq_2 * a0_14 = params_filter.isra.0.constprop.1(*a0, fp + ~0x13, out a2_53, out a3_16, out a4_17);
	word32 a5_23 = 0x00;
	if (a0_14 == null)
		a5_23 = (word32) bLoc14_35;
	*a1 = (byte) a5_23;
	a0Out = a0_14;
	a1Out = fp + ~0x13;
	a3Out = a3_16;
	a4Out = a4_17;
	s8Out = dwLoc1C;
	return a1;
}

// 2307A91C: Register Eq_2 get_uint16_from_string(Register Eq_2 s0, Register (ptr32 (ptr32 Eq_442662)) a0, Register Eq_2 a1, Register out (ptr32 Eq_2) a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      blemesh_seg_send
//      blemesh_net_send
//      ble_start_advertise
//      ble_set_data_len
//      ble_subscribe
//      ble_write
//      ble_read
//      ble_discover
//      ble_conn_update
//      ble_start_scan
//      ble_write_without_rsp
Eq_2 get_uint16_from_string(Eq_2 s0, struct Eq_442662 ** a0, Eq_2 a1, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	uint16 wLoc14_35 = (uint16) s0;
	ptr32 a2_15;
	ptr32 a3_16;
	ptr32 a4_17;
	union Eq_2 * a0_14 = params_filter.isra.0.constprop.1(*a0, fp + ~0x13, out a2_15, out a3_16, out a4_17);
	ptr32 a5_23 = 0x00;
	if (a0_14 == null)
		a5_23 = (word32) wLoc14_35;
	*a1 = (word16) a5_23;
	a0Out = a0_14;
	a2Out = a2_15;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_23;
	return a1;
}

// 2307A942: Register Eq_2 Bl_F_fast.constprop.0(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      utils_wifi_psk_cal_fast_bin
Eq_2 Bl_F_fast.constprop.0(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0198, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a3_36;
	word32 a5_325;
	word32 a2_323;
	word32 a4_324;
	word32 a1_322;
	strlen(a2, out a1_322, out a2_323, out a3_36, out a4_324, out a5_325);
	word32 a5_50;
	Eq_2 a2_53;
	Eq_2 a3_54;
	word32 a7_329;
	word32 a4_327;
	word32 a6_328;
	word32 a1_326;
	memcpy(a0, a3_36, a4, out a1_326, out a2_53, out a3_54, out a4_327, out a5_50, out a6_328, out a7_329);
	word32 a4_63 = a0 + dwArgA4;
	*a4_63 = 0x00;
	*((word32) a4_63 + 3) = (byte) a5_50;
	*((word32) a4_63 + 1) = 0x00;
	*((word32) a4_63 + 2) = 0x00;
	Eq_2 s1_77;
	Eq_2 s2_78;
	Eq_2 s3_79;
	Eq_2 s4_80;
	Eq_2 s5_88;
	Eq_2 ra_85 = bl_sha_mutex_take(ra, a2_53, a3_54, a4_63, mstatus, s4, s2, dwArg20, dwArg24, dwArg48, s3, dwArg6C, dwArgC8, dwArg0108, out s1_77, out s2_78, out s3_79, out s4_80, out s5_88);
	utils_hmac_sha1_fast(ra_85, 0x01, s3_79, s4_80, s2_78);
	word32 a6_335;
	word32 a7_336;
	word32 a4_333;
	word32 a5_334;
	word32 a2_331;
	word32 a3_332;
	word32 a1_330;
	memcpy(s5_88, s2_78, 0x14, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334, out a6_335, out a7_336);
	word32 s0_137;
	for (s0_137 = 0x00FFFFFF; s0_137 != 0x00; s0_137 += ~0x00)
	{
		utils_hmac_sha1_fast(ra_85, 0x01, s3_79, s4_80, s1_77);
		word32 a7_343;
		word32 a5_341;
		word32 a6_342;
		word32 a3_339;
		word32 a4_340;
		word32 a1_337;
		word32 a2_338;
		memcpy(s2_78, s1_77, 0x14, out a1_337, out a2_338, out a3_339, out a4_340, out a5_341, out a6_342, out a7_343);
		int32 a5_190;
		for (a5_190 = 0x00; a5_190 != 0x14; ++a5_190)
		{
			byte * a3_193 = (word32) s5_88 + a5_190;
			Eq_2 a4_200 = (word32) *((word32) s1_77 + a5_190) ^ (word32) (*a3_193);
			*a3_193 = (byte) a4_200;
		}
	}
	ptr32 s1_219;
	ptr32 s2_220;
	ptr32 s3_221;
	Eq_2 ra_233 = bl_sha_mutex_give(ra_85, a4_200, mstatus, s4, s2, dwArg20, dwArg24, dwArg48, s3, dwArg6C, dwArgC8, dwArg0108, dwArg0148, out s1_219, out s2_220, out s3_221);
	0x00 = (int8) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_219;
	s2Out = s2_220;
	s3Out = s3_221;
	s4Out = dwArgF4;
	return ra_233;
}

// 2307AA10: void utils_wifi_psk_cal_fast_bin(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0138)
// Called from:
//      pmkCacheGeneratePSK
void utils_wifi_psk_cal_fast_bin(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0138)
{
	word32 a1_184;
	word32 a2_185;
	word32 a3_186;
	word32 a4_187;
	word32 a5_188;
	if (strlen(a0, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188) <= 63 && a2 <= 32)
	{
		Eq_2 s0_50;
		Eq_2 s1_51;
		Eq_2 s2_54;
		Eq_2 s3_55;
		Eq_2 s4_56;
		Eq_2 ra_49 = Bl_F_fast.constprop.0(ra, fp + -0x0044, a0, a2, a0, a1, s4, mstatus, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, s3, dwArg68, dwArgA8, dwArgE8, dwArg0138, out s0_50, out s1_51, out s2_54, out s3_55, out s4_56);
		word32 a1_189;
		word32 a2_190;
		word32 a3_191;
		word32 a4_192;
		word32 a5_193;
		word32 a6_194;
		word32 a7_195;
		memcpy((word32) s0_50 + 20, s0_50, 0x0C, out a1_189, out a2_190, out a3_191, out a4_192, out a5_193, out a6_194, out a7_195);
		word32 s0_196;
		word32 s1_197;
		word32 s2_198;
		word32 s3_199;
		word32 s4_200;
		Bl_F_fast.constprop.0(ra_49, fp + -0x0044, s2_54, s1_51, s2_54, s3_55, s4_56, mstatus, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, s3, dwArg68, dwArgA8, dwArgE8, dwArg0138, out s0_196, out s1_197, out s2_198, out s3_199, out s4_200);
	}
}

// 2307AA7E: Register ptr32 utils_tlv_bl_pack_auto(Register ptr32 a0, Register int32 a1, Register word32 a2, Register (ptr32 byte) a3, Register (ptr32 Eq_103181) a4)
// Called from:
//      bl_main_cfg_task_req
ptr32 utils_tlv_bl_pack_auto(ptr32 a0, int32 a1, word32 a2, byte * a3, struct Eq_103181 * a4)
{
	ptr32 a5_12;
	if (a2 != 0x01)
	{
		if (a2 != 0x07)
		{
			a5_12 = ~0x01;
			return a5_12;
		}
	}
	else
		a4 = (word32) *a3;
	a5_12 = ~0x00;
	if (a1 > 0x03)
	{
		a4->ptr0000 = a0;
		a5_12 = 0x04;
	}
	return a5_12;
}

