pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307AAA6: void utils_tlv_bl_unpack_auto(Register int32 a1, Register word32 a2, Register (ptr32 byte) a3)
// Called from:
//      cfg_start_req_handler
void utils_tlv_bl_unpack_auto(int32 a1, word32 a2, byte * a3)
{
	if (a2 == 0x01)
	{
		word32 a5_12;
		if (a1 > 0x03)
			a5_12 = (word32) true;
		else
			a5_12 = 0x01;
		*a3 = (byte) a5_12;
	}
	else
	{
		if (a2 != 0x07)
			return;
		byte ** a5_18 = (byte **) 0x03;
		if (a1 <= 0x03)
			a5_18 = null;
		*a5_18 = (byte **) a3;
	}
}

// 2307AAE4: void utils_hmac_sha1_fast(Register Eq_2 ra, Register int32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      Bl_F_fast.constprop.0
void utils_hmac_sha1_fast(Eq_2 ra, int32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5)
{
	Eq_2 s5_165 = a5;
	Eq_2 s2_113 = a3;
	Eq_2 s1_111 = a4;
	if (a4 > 64)
	{
		bl_sha_init(ra, fp + -0x00C4, 0x02, (word32 *) 64, dwLoc8C);
		ui32 * a4_62;
		Eq_2 s2_68;
		Eq_2 s5_71;
		word32 a1_473;
		word32 a2_474;
		word32 s3_475;
		word32 s4_476;
		bl_sha_update(fp + -0x00C4, a3, a4, a5, dwLoc88, out a1_473, out a2_474, out a4_62, out s2_68, out s3_475, out s4_476, out s5_71);
		word32 s0_477;
		word32 s1_478;
		word32 s4_479;
		word32 s6_480;
		ra = bl_sha_finish(s2_68, a4_62, s5_71, dwLocA8, out s0_477, out s1_478, out s2_113, out s4_479, out s5_165, out s6_480);
		s1_111.u0 = 0x14;
	}
	word32 t1_460;
	word32 a4_465;
	word32 a5_466;
	word32 a0_461;
	word32 a1_462;
	word32 a2_463;
	word32 a3_464;
	Eq_2 ra_108 = memset(ra, fp + -288, 0x00, 64, out t1_460, out a0_461, out a1_462, out a2_463, out a3_464, out a4_465, out a5_466);
	word32 a4_469;
	word32 a5_470;
	word32 a6_471;
	word32 a7_472;
	word32 a1_467;
	word32 a2_468;
	struct Eq_443265 ** a3_121;
	memcpy(fp + -288, s2_113, s1_111, out a1_467, out a2_468, out a3_121, out a4_469, out a5_470, out a6_471, out a7_472);
	do
	{
		struct Eq_443265 * a5_136 = *a3_121;
		a5_136->dw1000 = a3_121 ^ 0x36363636;
		int32 a3_141 = a5_136->dw0004;
		a5_136->dw1004 = a3_141 ^ 0x36363636;
		a3_121 = a3_141 ^ 0x36363636;
	} while (&a5_136->dw0004 + 1 != fp + -224);
	bl_sha_init(ra_108, fp + -0x00C4, 0x02, &a5_136->dw0004 + 1, dwLoc8C);
	word32 s2_481;
	word32 s3_482;
	Eq_2 a2_168;
	Eq_2 a1_167;
	Eq_2 s5_179;
	Eq_2 s4_178;
	ui32 * a4_170;
	bl_sha_update(fp + -0x00C4, fp + -288, 64, s5_165, dwLoc88, out a1_167, out a2_168, out a4_170, out s2_481, out s3_482, out s4_178, out s5_179);
	int32 s3_184 = 0x00;
	while (s3_184 < a2)
	{
		word32 s2_483;
		bl_sha_update(fp + -0x00C4, a1_167, a2_168, s5_179, dwLoc88, out a1_167, out a2_168, out a4_170, out s2_483, out s3_184, out s4_178, out s5_179);
	}
	Eq_2 s1_228;
	Eq_2 s2_229;
	ptr32 s4_231;
	Eq_2 s5_232;
	word32 a2_489;
	word32 a3_490;
	word32 a4_491;
	word32 a5_492;
	word32 s6_485;
	word32 t1_486;
	word32 a0_487;
	word32 a1_488;
	word32 s0_484;
	Eq_2 ra_246 = memset(bl_sha_finish(s4_178, a4_170, s5_179, dwLocA8, out s0_484, out s1_228, out s2_229, out s4_231, out s5_232, out s6_485), fp + -288, 0x00, 64, out t1_486, out a0_487, out a1_488, out a2_489, out a3_490, out a4_491, out a5_492);
	word32 a6_497;
	word32 a7_498;
	word32 a1_493;
	word32 a2_494;
	word32 a3_495;
	word32 a5_496;
	struct Eq_443380 ** a4_252;
	memcpy(fp + -288, s2_229, s1_228, out a1_493, out a2_494, out a3_495, out a4_252, out a5_496, out a6_497, out a7_498);
	do
	{
		struct Eq_443380 * s0_269 = *a4_252;
		s0_269->dw1000 = a4_252 ^ 0x5C5C5C5C;
		int32 a4_274 = s0_269->dw0004;
		s0_269->dw1004 = a4_274 ^ 0x5C5C5C5C;
		a4_252 = a4_274 ^ 0x5C5C5C5C;
	} while (&s0_269->dw0004 + 1 != s4_231);
	bl_sha_init(ra_246, fp + -0x00C4, 0x02, (word32 *) 0x5C5C5C5C, dwLoc8C);
	word32 s3_508;
	word32 s2_511;
	word32 s1_510;
	Eq_2 s5_311;
	ui32 * a4_323;
	Eq_2 s5_332;
	Eq_2 s0_347;
	Eq_2 s5_352;
	Eq_2 s6_353;
	word32 s4_509;
	word32 a1_505;
	word32 a2_506;
	word32 s2_507;
	word32 s3_503;
	word32 s4_504;
	word32 s2_502;
	word32 a4_501;
	word32 a1_499;
	word32 a2_500;
	word32 s4_512;
	bl_sha_finish(bl_sha_update(fp + -0x00C4, bl_sha_update(fp + -0x00C4, fp + -288, 64, s5_232, dwLoc88, out a1_499, out a2_500, out a4_501, out s2_502, out s3_503, out s4_504, out s5_311), 0x14, s5_311, dwLoc88, out a1_505, out a2_506, out a4_323, out s2_507, out s3_508, out s4_509, out s5_332), a4_323, s5_332, dwLocA8, out s0_347, out s1_510, out s2_511, out s4_512, out s5_352, out s6_353);
	word32 a1_513;
	word32 a2_514;
	word32 a3_515;
	word32 a4_516;
	word32 a5_517;
	word32 a6_518;
	word32 a7_519;
	memcpy(s5_352, s0_347, s6_353, out a1_513, out a2_514, out a3_515, out a4_516, out a5_517, out a6_518, out a7_519);
}

// 2307AC46: Register Eq_2 vfs_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      aos_loop_proc
Eq_2 vfs_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_22 = (word32) g_b4200F6BC;
	ptr32 a5_14 = 0x00;
	if (a4_22 != 0x01)
	{
		word32 a0_31;
		word32 a2_115;
		word32 s1_24 = xQueueCreateMutexStatic(0x01, &g_t4201B48C, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0108, dwArg0138, dwArg0178, out a0_31, out a2_115, out a3, out a4_22);
		g_dw42027930 = a0_31;
		a5_14 = ~0x00;
		if (a0_31 != 0x00)
		{
			ra = inode_init(ra, out a3, out a4_22);
			g_b4200F6BC = (byte) s1_24;
			a5_14 = 0x00;
		}
	}
	a3Out = a3;
	a4Out = a4_22;
	a5Out = a5_14;
	return ra;
}

// 2307AC90: Register Eq_2 aos_open(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out (ptr32 (ptr32 Eq_444682)) s1Out, Register out (ptr32 Eq_2) a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
//      cat_cmd
//      hexdump_cmd
//      aos_event_service_init
//      at_serial_open
//      get_romfs_file_content
Eq_2 aos_open(Eq_2 ra, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s0Out, struct Eq_444682 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	union Eq_2 * s0_107;
	if (a0 == 0x00)
	{
		s0_107 = (union Eq_2 *) ~0x15;
		goto l2307ACDC;
	}
	s2 = a0;
	s3 = a1;
	a5.u0 = 0x0400;
	Eq_2 a2_26;
	word32 a5_370;
	word32 a1_369;
	if (strlen(a0, out a1_369, out a2_26, out a3, out a4, out a5_370) > 0x0400)
	{
		s0_107 = (union Eq_2 *) ~0x19;
		goto l2307ACDC;
	}
	word32 a0_33;
	word32 s4_374;
	word32 s8_375;
	word32 a2_372;
	word32 a5_373;
	word32 a1_371;
	xQueueSemaphoreTake(g_t42026930, ~0x00, a2_26, a3, a4, 0x0400, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1, out a0_33, out a1_371, out a2_372, out a3, out a4, out a5_373, out s2, out s3, out s4_374, out s8_375);
	a5.u0 = 0x01;
	if (a0_33 != 0x01)
	{
		s0_107 = (union Eq_2 *) ~0x00;
		goto l2307ACDC;
	}
	struct Eq_443566 * a0_51;
	word32 * a2_53;
	Eq_2 a4_55;
	Eq_2 a5_56;
	word32 s3_62;
	struct Eq_443571 * s4_63;
	inode_open(s2, dwArg88, out a0_51, out a2_53, out a4_55, out a5_56, out s3_62, out s4_63);
	if (a0_51 == null)
	{
		word32 a0_382;
		word32 a1_383;
		word32 a2_384;
		word32 a7_385;
		word32 s4_386;
		word32 s5_387;
		word32 s8_388;
		xQueueGenericSend(s4_63->tFFFFF930, 0x00, 0x00, a4_55, a5_56, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1, out a0_382, out a1_383, out a2_384, out a3, out a4, out a5, out a7_385, out s2, out s3, out s4_386, out s5_387, out s6, out s8_388);
		s0_107 = (union Eq_2 *) ~0x01;
		goto l2307ACDC;
	}
	a0_51->dw000C = s3_62;
	Eq_2 a5_78;
	word32 s4_96;
	word32 a0_376;
	word32 a1_377;
	word32 a2_378;
	word32 a7_379;
	word32 s5_380;
	word32 s8_381;
	xQueueGenericSend(s4_63->tFFFFF930, 0x00, 0x00, new_file(a0_51, a2_53, out a5_78), a5_78, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1, out a0_376, out a1_377, out a2_378, out a3, out a4, out a5, out a7_379, out s2, out s3, out s4_96, out s5_380, out s6, out s8_381);
	if (s1 == null)
	{
		s0_107 = (union Eq_2 *) ~0x16;
		goto l2307ACDC;
	}
	union Eq_2 * a0_121;
	struct Eq_443664 * s0_108 = *a5.u0;
	a3 = (word32) s0_108->b0010;
	a4.u0 = 0x03;
	struct Eq_443664 * a5_111 = *a5.u0;
	if (a3 == 0x03)
	{
		if (a5_111 == null)
			goto l2307AD32;
		word32 a5_153;
		word32 tp_161;
		word32 a7_162;
		word32 s5_163;
		word32 t1_165;
		word32 t0_166;
		word32 t2_167;
		word32 t4_168;
		word32 t5_169;
		word32 t6_170;
		a5_111();
	}
	else
	{
		if (a5_111 == null)
			goto l2307AD32;
		word32 a5_123;
		word32 tp_131;
		word32 a7_132;
		word32 s5_133;
		word32 t1_135;
		word32 t0_136;
		word32 t2_137;
		word32 t4_138;
		word32 t5_139;
		word32 t6_140;
		a5_111();
	}
	s0_107 = a0_121;
	if (a0_121 != null)
	{
		a5 = del_file(s1);
l2307ACDC:
		s0Out.u0 = <invalid>;
		s1Out = s1;
		a0Out = s0_107;
		a2Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
l2307AD32:
	Eq_2 a5_188;
	union Eq_2 * a0_187 = get_fd(s1, out a5_188);
	s0Out.u0 = <invalid>;
	s1Out = s1;
	a0Out = a0_187;
	a2Out.u0 = <invalid>;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_188;
	s2Out = s2;
	s3Out = s3;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

