pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307AD54: Register (ptr32 (ptr32 Eq_444682)) aos_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_341941) s2, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_341975) a5Out, Register out (ptr32 Eq_341941) s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      cat_cmd
//      hexdump_cmd
//      at_server_init
//      get_romfs_file_content
struct Eq_444682 ** aos_close(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_341941 * s2, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a2Out, union Eq_2 & a4Out, struct Eq_341975 & a5Out, struct Eq_341941 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	struct Eq_443718 * sp_22 = fp + ~0x0F;
	struct Eq_341975 * a5_126;
	if (get_file(a0, out a5_126) != 0x00)
	{
		word32 a0_17 = *a4;
		Eq_2 a4_20 = a5_126->t0000;
		Eq_2 a5_21 = a5_126->t0004;
		if (a5_21 != 0x00)
		{
			word32 a1_32;
			word32 a6_109;
			word32 s3_110;
			word32 s4_111;
			word32 s8_112;
			word32 t3_113;
			word32 a7_114;
			word32 s5_115;
			word32 t0_117;
			word32 t1_118;
			word32 t4_119;
			word32 t5_120;
			word32 t6_121;
			a5_21();
		}
		word32 a0_48;
		word32 a1_183;
		word32 a2_184;
		word32 a3_185;
		word32 a5_186;
		word32 s4_187;
		word32 s8_188;
		xQueueSemaphoreTake(g_t42026930, ~0x00, a2, a3, a4_20, a5_21, mstatus, sp_22->t0008, sp_22->t0024, sp_22->t00A4, sp_22->t0118, sp_22->t0158, out s1, out a0_48, out a1_183, out a2_184, out a3_185, out a4, out a5_186, out s2, out s3, out s4_187, out s8_188);
		a5_126 = (struct Eq_341975 *) 0x01;
		if (a0_48 == 0x01)
		{
			word32 a0_189;
			word32 a1_190;
			word32 a2_191;
			word32 a3_192;
			word32 a7_193;
			word32 s4_194;
			word32 s5_195;
			word32 s8_196;
			xQueueGenericSend(s2->tFFFFF930, 0x00, 0x00, a4, del_file(s1), mstatus, sp_22->t0008, sp_22->t0024, sp_22->t00A4, sp_22->t0118, sp_22->t0158, sp_22->t0198, out s1, out a0_189, out a1_190, out a2_191, out a3_192, out a4, out a5_126, out a7_193, out s2, out s3, out s4_194, out s5_195, out s6, out s8_196);
		}
	}
	0x00 = (int8) dwArg38;
	a2Out = dwArg10;
	a4Out = a4;
	a5Out = a5_126;
	s2Out = s2;
	s3Out = s3;
	s6Out = s6;
	return s1;
}

// 2307ADAC: Register Eq_2 aos_read(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_341835) a4, Stack Eq_2 dwArg00, Stack word32 dwArg44, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out)
// Called from:
//      cat_cmd
//      console_cb_read
//      event_read_cb
//      at_serial_read
Eq_2 aos_read(Eq_2 ra, Eq_2 a0, ptr32 a1, struct Eq_341835 * a4, Eq_2 dwArg00, word32 dwArg44, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a1Out)
{
	ptr32 a0_13;
	word32 * a5_12;
	if (get_file(a0, out a5_12) != 0x00)
	{
		word32 a0_14 = *a5_12;
		s0 = a1;
		<anonymous> * t1_19 = a4->ptr0008;
		if (t1_19 != null)
		{
			Eq_2 ra_28;
			ptr32 a1_29;
			ptr32 a0_31;
			ptr32 s0_33;
			word32 t1_35;
			t1_19();
			s0Out = s0_33;
			a0Out = a0_31;
			a1Out = a1_29;
			return ra_28;
		}
		a0_13 = ~0x00;
	}
	else
		a0_13 = ~0x01;
	s0Out = s0;
	a0Out = a0_13;
	a1Out = a1;
	return ra;
}

// 2307ADDA: Register Eq_2 aos_write(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_342406) a4, Stack word32 dwArg00, Stack word32 dwArg44, Register out (ptr32 code) t1Out, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out (ptr32 Eq_342406) a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      cli_putstr
//      at_serial_write
Eq_2 aos_write(Eq_2 ra, Eq_2 a0, ptr32 a1, struct Eq_342406 * a4, word32 dwArg00, word32 dwArg44, <anonymous> & t1Out, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a1Out, struct Eq_342406 & a4Out, word32 & a5Out)
{
	ptr32 a0_13;
	word32 * a5_12;
	if (get_file(a0, out a5_12) != 0x00)
	{
		word32 a0_14 = *a5_12;
		s0 = a1;
		a5_12 = a4->ptr0000;
		t1 = a4->ptr000C;
		if (t1 != null)
		{
			Eq_2 ra_28;
			ptr32 a1_29;
			ptr32 a0_31;
			word32 * a5_32;
			ptr32 s0_33;
			struct Eq_342406 * a4_34;
			<anonymous> * t1_35;
			t1();
			t1Out = t1_35;
			s0Out = s0_33;
			a0Out = a0_31;
			a1Out = a1_29;
			a4Out = a4_34;
			a5Out = a5_32;
			return ra_28;
		}
		a0_13 = ~0x00;
	}
	else
		a0_13 = ~0x01;
	t1Out = t1;
	s0Out = s0;
	a0Out = a0_13;
	a1Out = a1;
	a4Out = a4;
	a5Out = a5_12;
	return ra;
}

// 2307AE08: Register Eq_2 aos_ioctl(Register Eq_2 ra, Register Eq_2 a0, Register uint32 a1, Register Eq_2 a2, Register (ptr32 Eq_446) a4, Stack Eq_2 dwArg00, Stack Eq_2 dwArg44, Register out Eq_2 s0Out, Register out Eq_342218 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_446) a4Out)
// Called from:
//      hexdump_cmd
//      aos_post_event
//      at_key_value_set
//      get_romfs_file_content
Eq_2 aos_ioctl(Eq_2 ra, Eq_2 a0, uint32 a1, Eq_2 a2, struct Eq_446 * a4, Eq_2 dwArg00, Eq_2 dwArg44, union Eq_2 & s0Out, union Eq_342218 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, struct Eq_446 & a4Out)
{
	if (a0 < 0x00)
	{
		s0Out = s0;
		a0Out.u0 = ~0x15;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
	else
	{
		Eq_342218 a0_14;
		struct Eq_443913 * a5_13;
		if (get_file(a0, out a5_13) != 0x00)
		{
			<anonymous> * t1_22;
			word32 a0_16 = a4->dw0000;
			s0 = dwArg44;
			a3 = (word32) a4->b0010;
			a4 = (struct Eq_446 *) 0x03;
			if (a3 == 0x03)
				t1_22 = a5_13->ptr0044;
			else
				t1_22 = a5_13->ptr0010;
			if (t1_22 != null)
			{
				Eq_342218 a0_40;
				Eq_2 ra_41;
				Eq_2 a2_42;
				struct Eq_446 * a4_44;
				Eq_2 s0_45;
				ptr32 a3_46;
				word32 a5_47;
				word32 t1_48;
				t1_22();
				s0Out = s0_45;
				a0Out = a0_40;
				a2Out = a2_42;
				a3Out = a3_46;
				a4Out = a4_44;
				return ra_41;
			}
			a0_14.u0 = -71;
		}
		else
			a0_14.u0 = ~0x01;
		s0Out = s0;
		a0Out = a0_14;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
}

// 2307AE50: Register Eq_2 aos_stat(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 (ptr32 Eq_444682)) s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_343488) s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      ls_cmd
Eq_2 aos_stat(Eq_2 ra, ptr32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_444682 & s3Out, union Eq_2 & s4Out, struct Eq_343488 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_443949 * sp_113 = fp + ~0x1F;
	Eq_2 s0_104 = ~0x15;
	if (a0 != 0x00)
	{
		word32 a0_31;
		Eq_2 s1_39;
		word32 s8_347;
		word32 a5_344;
		word32 s2_345;
		word32 s4_346;
		word32 a1_341;
		word32 a2_342;
		word32 a4_343;
		s2 = xQueueSemaphoreTake(g_t42026930, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_39, out a0_31, out a1_341, out a2_342, out a3, out a4_343, out a5_344, out s2_345, out s3, out s4_346, out s8_347);
		if (a0_31 != 0x01)
		{
l2307AE7E:
			a5.u0 = 0x01;
			s0_104.u0 = ~0x00;
			goto l2307AE80;
		}
		struct Eq_443566 * a0_49;
		word32 * a2_51;
		Eq_2 a4_53;
		Eq_2 a5_54;
		word32 s3_348;
		word32 s4_349;
		struct Eq_443588 * s0_57 = inode_open(s1_39, dwArg88, out a0_49, out a2_51, out a4_53, out a5_54, out s3_348, out s4_349);
		if (a0_49 == null)
		{
			word32 s1_355;
			word32 a0_356;
			word32 a1_357;
			word32 a2_358;
			word32 a4_359;
			word32 a7_360;
			word32 s4_361;
			word32 s8_362;
			xQueueGenericSend(s0_57->tFFFFF930, 0x00, 0x00, a4_53, a5_54, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_355, out a0_356, out a1_357, out a2_358, out a3, out a4_359, out a5, out a7_360, out s2, out s3, out s4_361, out s5, out s6, out s8_362);
			s0_104.u0 = ~0x12;
		}
		else
		{
			Eq_2 a5_75;
			word32 s1_90;
			word32 s4_93;
			word32 a0_350;
			word32 a1_351;
			word32 a4_352;
			word32 a7_353;
			word32 s8_354;
			Eq_2 a2_127;
			xQueueGenericSend(s0_57->tFFFFF930, 0x00, 0x00, new_file(a0_49, a2_51, out a5_75), a5_75, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_90, out a0_350, out a1_351, out a2_127, out a3, out a4_352, out a5, out a7_353, out s2, out s3, out s4_93, out s5, out s6, out s8_354);
			s0_104.u0 = ~0x01;
			if (s3 != null)
			{
				Eq_2 a4_105 = (word32) s5->b0010;
				Eq_2 a5_106 = 0x03;
				if (a4_105 == 0x03)
				{
					a5_106 = s5->ptr0000->t0018;
					if (a5_106 != 0x00)
					{
						word32 a7_132;
						word32 t1_134;
						word32 t0_135;
						word32 t2_136;
						word32 t4_137;
						word32 t5_138;
						word32 t6_139;
						a5_106();
					}
				}
				word32 a0_151;
				Eq_2 a4_155;
				word32 s1_363;
				word32 a1_364;
				word32 a2_365;
				word32 a5_366;
				word32 s4_367;
				word32 s8_368;
				xQueueSemaphoreTake(*((word32) s2 - 1744), ~0x00, a2_127, a3, a4_105, a5_106, mstatus, sp_113->t0008, sp_113->t0024, sp_113->t00A4, sp_113->t0118, sp_113->t0158, out s1_363, out a0_151, out a1_364, out a2_365, out a3, out a4_155, out a5_366, out s2, out s3, out s4_367, out s8_368);
				if (a0_151 != 0x01)
					goto l2307AE7E;
				word32 s1_369;
				word32 a0_370;
				word32 a1_371;
				word32 a2_372;
				word32 a4_373;
				word32 a7_374;
				word32 s4_375;
				word32 s8_376;
				s0_104 = xQueueGenericSend(*((word32) s2 - 1744), 0x00, 0x00, a4_155, del_file(s3), mstatus, sp_113->t0008, sp_113->t0024, sp_113->t00A4, sp_113->t0118, sp_113->t0158, sp_113->t0198, out s1_369, out a0_370, out a1_371, out a2_372, out a3, out a4_373, out a5, out a7_374, out s2, out s3, out s4_375, out s5, out s6, out s8_376);
			}
		}
	}
l2307AE80:
	a0Out = s0_104;
	a3Out = a3;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2307AF0A: Register Eq_2 aos_opendir(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      ls_cmd
Eq_2 aos_opendir(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s0Out, union Eq_2 & a0Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 s0_132;
	struct Eq_444188 * sp_105 = fp + ~0x1F;
	if (a0 == 0x00)
	{
l2307AF1A:
		s0_132.u0 = 0x00;
		goto l2307AF4C;
	}
	word32 a0_27;
	Eq_2 s1_35;
	word32 s3_336;
	word32 s4_337;
	word32 s8_338;
	word32 a4_333;
	word32 a5_334;
	word32 s2_335;
	word32 a1_331;
	word32 a2_332;
	xQueueSemaphoreTake(g_t42026930, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_35, out a0_27, out a1_331, out a2_332, out a3, out a4_333, out a5_334, out s2_335, out s3_336, out s4_337, out s8_338);
	if (a0_27 != 0x01)
		goto l2307AF1A;
	struct Eq_443566 * a0_44;
	word32 * a2_46;
	Eq_2 a4_48;
	Eq_2 a5_49;
	struct Eq_444228 * s3_55;
	word32 s4_339;
	inode_open(s1_35, dwArg88, out a0_44, out a2_46, out a4_48, out a5_49, out s3_55, out s4_339);
	if (a0_44 != null)
	{
		Eq_2 a5_70;
		word32 s1_85;
		word32 s2_86;
		word32 s3_87;
		word32 a4_342;
		word32 a5_343;
		word32 a7_344;
		word32 a0_340;
		word32 a1_341;
		word32 s5_345;
		word32 s6_346;
		word32 s8_347;
		struct Eq_444252 * s4_111;
		Eq_2 a2_116;
		Eq_2 s0_84 = xQueueGenericSend(s3_55->tFFFFF930, 0x00, 0x00, new_file(a0_44, a2_46, out a5_70), a5_70, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_85, out a0_340, out a1_341, out a2_116, out a3, out a4_342, out a5_343, out a7_344, out s2_86, out s3_87, out s4_111, out s5_345, out s6_346, out s8_347);
		if (s2_86 == 0x00)
			goto l2307AF1A;
		Eq_2 a4_120 = (word32) *((word32) s0_84 + 16);
		Eq_2 a5_100 = 0x03;
		if (a4_120 == 0x03)
		{
			Eq_2 s0_101 = *(union Eq_2 *) 0x03;
			a5_100 = *(union Eq_2 *) 0x27;
			if (a5_100 != 0x00)
			{
				struct Eq_444682 ** s2_109;
				Eq_2 a0_112;
				word32 tp_122;
				word32 a7_123;
				word32 s5_124;
				word32 s6_125;
				word32 t1_126;
				word32 t0_127;
				word32 t2_128;
				word32 t4_129;
				word32 t5_130;
				word32 t6_131;
				a5_100();
				s0_132 = a0_112;
				if (a0_112 != 0x00)
				{
					word32 a5_380;
					*get_fd(s2_109, out a5_380) = (union Eq_2 *) a0_112;
l2307AF4C:
					s0Out = s1;
					a0Out = s0_132;
					a3Out = a3;
					mstatusOut = mstatus;
					return ra;
				}
			}
		}
		word32 a0_147;
		Eq_2 a4_151;
		struct Eq_444682 ** s2_156;
		struct Eq_444334 * s4_158;
		word32 s1_361;
		word32 a1_362;
		word32 a2_363;
		word32 a5_364;
		word32 s3_365;
		word32 s8_366;
		xQueueSemaphoreTake(s4_111->tFFFFF930, ~0x00, a2_116, a3, a4_120, a5_100, mstatus, sp_105->t0008, sp_105->t0024, sp_105->t00A4, sp_105->t0118, sp_105->t0158, out s1_361, out a0_147, out a1_362, out a2_363, out a3, out a4_151, out a5_364, out s2_156, out s3_365, out s4_158, out s8_366);
		if (a0_147 == 0x01)
		{
			word32 s1_367;
			word32 a0_368;
			word32 a1_369;
			word32 a2_370;
			word32 a4_371;
			word32 a5_372;
			word32 a7_373;
			word32 s2_374;
			word32 s3_375;
			word32 s4_376;
			word32 s5_377;
			word32 s6_378;
			word32 s8_379;
			xQueueGenericSend(s4_158->tFFFFF930, 0x00, 0x00, a4_151, del_file(s2_156), mstatus, sp_105->t0008, sp_105->t0024, sp_105->t00A4, sp_105->t0118, sp_105->t0158, sp_105->t0198, out s1_367, out a0_368, out a1_369, out a2_370, out a3, out a4_371, out a5_372, out a7_373, out s2_374, out s3_375, out s4_376, out s5_377, out s6_378, out s8_379);
		}
		goto l2307AF1A;
	}
	else
	{
		word32 s1_348;
		word32 a0_349;
		word32 a1_350;
		word32 a2_351;
		word32 a4_352;
		word32 a5_353;
		word32 a7_354;
		word32 s2_355;
		word32 s3_356;
		word32 s4_357;
		word32 s5_358;
		word32 s6_359;
		word32 s8_360;
		s0_132 = xQueueGenericSend(s3_55->tFFFFF930, 0x00, 0x00, a4_48, a5_49, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_348, out a0_349, out a1_350, out a2_351, out a3, out a4_352, out a5_353, out a7_354, out s2_355, out s3_356, out s4_357, out s5_358, out s6_359, out s8_360);
		goto l2307AF4C;
	}
}

// 2307AFBA: Register Eq_2 aos_closedir(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register (ptr32 Eq_2) s2, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      ls_cmd
Eq_2 aos_closedir(Eq_2 ra, union Eq_2 * a0, union Eq_2 * s2, ptr32 mstatus, Eq_2 dwArg44, ptr32 & a2Out, union Eq_2 & a5Out)
{
	struct Eq_444451 * sp_28 = fp + ~0x1F;
	Eq_2 s0_103 = ~0x15;
	if (a0 != null)
	{
		s0_103.u0 = ~0x01;
		Eq_2 a0_18 = get_file(*a0, out a5);
		if (a0_18 != 0x00)
		{
			struct Eq_444471 * a0_21 = *a5;
			Eq_2 a4_22 = 0x03;
			Eq_2 a3_24 = (word32) *((word32) a5 + 16);
			Eq_2 a2_25 = dwArg44;
			if (a3_24 == 0x03)
			{
				a5 = *((word32) *a5.u0 + 44);
				if (a5 != 0x00)
				{
					word32 a1_34;
					word32 s3_119;
					word32 tp_120;
					word32 a7_121;
					word32 s5_122;
					word32 s6_123;
					word32 t0_124;
					word32 t1_125;
					word32 t4_126;
					word32 t5_127;
					word32 t6_128;
					a5();
				}
			}
			word32 a0_55;
			Eq_2 a4_59;
			struct Eq_444682 ** s1_63;
			struct Eq_444488 * s2_64;
			word32 s4_190;
			word32 s8_191;
			word32 a5_188;
			word32 s3_189;
			word32 a1_186;
			word32 a3_187;
			xQueueSemaphoreTake(g_t42026930, ~0x00, a2_25, a3_24, a4_22, a5, mstatus, sp_28->t0008, sp_28->t0024, sp_28->t00A4, sp_28->t0118, sp_28->t0158, out s1_63, out a0_55, out a1_186, out a2, out a3_187, out a4_59, out a5_188, out s2_64, out s3_189, out s4_190, out s8_191);
			a5.u0 = 0x01;
			if (a0_55 == 0x01)
			{
				word32 s1_192;
				word32 a0_193;
				word32 a1_194;
				word32 a3_195;
				word32 a4_196;
				word32 a7_197;
				word32 s2_198;
				word32 s3_199;
				word32 s4_200;
				word32 s5_201;
				word32 s6_202;
				word32 s8_203;
				s0_103 = xQueueGenericSend(s2_64->tFFFFF930, 0x00, 0x00, a4_59, del_file(s1_63), mstatus, sp_28->t0008, sp_28->t0024, sp_28->t00A4, sp_28->t0118, sp_28->t0158, sp_28->t0198, out s1_192, out a0_193, out a1_194, out a2, out a3_195, out a4_196, out a5, out a7_197, out s2_198, out s3_199, out s4_200, out s5_201, out s6_202, out s8_203);
			}
			else
				s0_103.u0 = ~0x00;
		}
	}
	a2Out = a2;
	a5Out = a5;
	return s0_103;
}

// 2307B02A: Register Eq_2 aos_readdir(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Stack word32 dwArg00, Stack Eq_2 dwArg44, Register out ptr32 a0Out)
// Called from:
//      ls_cmd
Eq_2 aos_readdir(Eq_2 ra, union Eq_2 * a0, word32 dwArg00, Eq_2 dwArg44, ptr32 & a0Out)
{
	if (a0 == null)
	{
		a0Out = 0x00;
		return ra;
	}
	else
	{
		struct Eq_444605 * a5_12;
		if (get_file(*a0, out a5_12) != 0x00)
		{
			struct Eq_444615 * a0_13 = a5_12->ptr0000;
			if ((word32) a5_12->b0010 == 0x03)
			{
				<anonymous> * t1_17 = a5_12->ptr0000->ptr0028;
				if (t1_17 != null)
				{
					ptr32 a0_27;
					Eq_2 ra_28;
					word32 a1_29;
					word32 a5_30;
					word32 a4_31;
					word32 a3_32;
					word32 t1_33;
					t1_17();
					a0Out = a0_27;
					return ra_28;
				}
			}
		}
		a0Out = 0x00;
		return ra;
	}
}

// 2307B064: Register word32 new_file(Register (ptr32 Eq_443566) a0, Register (ptr32 word32) a2, Register out ptr32 a5Out)
// Called from:
//      aos_open
//      aos_stat
//      aos_opendir
word32 new_file(struct Eq_443566 * a0, word32 * a2, ptr32 & a5Out)
{
	ptr32 a5_10;
	for (a5_10 = 0x0C; a5_10 != 0x30; ++a5_10)
	{
		word32 a4_18;
		word32 a4_15 = *a2;
		if (a2 == null)
		{
			struct Eq_444652 * a5_22 = a5_10 + 0x00;
			a0->dw0000 = (char *) a5_22 + 1107408092;
			a5_22->dw4201B4E0 = 0x00;
			a5_22->dw4201B4E4 = 0x00;
			a4_18 = 0x0C;
			a5_10 = inode_ref(a0);
			break;
		}
		a4_18 = a4_15 + 0x0C;
	}
	a5Out = a5_10;
	return a4_18;
}

// 2307B0AA: Register word32 del_file(Register (ptr32 (ptr32 Eq_444682)) a0)
// Called from:
//      aos_open
//      aos_close
//      aos_stat
//      aos_opendir
//      aos_closedir
word32 del_file(struct Eq_444682 ** a0)
{
	word32 a5_11 = inode_unref(*a0);
	*a0 = (struct Eq_444682 **) null;
	return a5_11;
}

// 2307B0C2: Register (ptr32 (ptr32 Eq_444682)) get_fd(Register (ptr32 (ptr32 Eq_444682)) a0, Register out ptr32 a5Out)
// Called from:
//      aos_open
//      aos_opendir
struct Eq_444682 ** get_fd(struct Eq_444682 ** a0, ptr32 & a5Out)
{
	a5Out = ~0x55555554;
	return (a0 - 0x4201B4DC >> 2) + ~0x55555552;
}

// 2307B0DE: Register Eq_2 get_file(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      aos_close
//      aos_ioctl
//      aos_closedir
//      aos_readdir
//      aos_poll
//      at_serial_write
//      at_serial_read
Eq_2 get_file(Eq_2 a0, union Eq_2 & a5Out)
{
	Eq_2 a0_15;
	Eq_2 a5_12 = 59;
	if (a0 <= ~0x3C)
	{
		a0_15 = (word32) a0 + 0x0A;
		a5_12 = *((word32) a0 + 0x0A);
		if (a0 != 0x0A)
		{
			a5Out = a5_12;
			return a5_12;
		}
	}
	else
		a0_15.u0 = 0x00;
	a5Out = a5_12;
	return a0_15;
}

// 2307B104: Register Eq_2 inode_init(Register Eq_2 ra, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      vfs_init
Eq_2 inode_init(Eq_2 ra, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_13;
	ptr32 a4_14;
	word32 t1_26;
	word32 a0_27;
	word32 a1_28;
	word32 a2_29;
	word32 a5_30;
	Eq_2 ra_16 = memset(ra, 1107408812, 0x00, 600, out t1_26, out a0_27, out a1_28, out a2_29, out a3_13, out a4_14, out a5_30);
	a3Out = a3_13;
	a4Out = a4_14;
	return ra_16;
}

