pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307B5CC: void vfs_uart_poll(Register (ptr32 Eq_445777) s0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void vfs_uart_poll(struct Eq_445777 * s0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a5_61;
	Eq_2 a4_55;
	word32 a0_33;
	Eq_2 a3_36;
	Eq_2 a4_37;
	<anonymous> * s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 a5_158;
	Eq_2 s1_41;
	struct Eq_372468 * s0_40 = aos_mutex_lock((char *) &s0->t0004 + 28, ~0x00, a2, a3, a4, s0->t0004, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_41, out a0_33, out a3_36, out a4_37, out a5_158, out s2_42, out s3_43, out s4_44);
	if (a1 == 0x00)
	{
		word32 a5_160;
		vTaskEnterCritical(a4_37, mstatus, out a5_160);
		s0_40->ptr0024 = null;
		s0_40->dw002C = 0x00;
		vTaskExitCritical(a3_36, mstatus, out a4_55, out a5_61);
	}
	else
	{
		word32 a5_159;
		vTaskEnterCritical(a4_37, mstatus, out a5_159);
		s0_40->ptr0024 = s2_42;
		s0_40->dw0028 = s3_43;
		s0_40->dw002C = s4_44;
		struct Eq_360347 ** a5_53;
		Eq_2 a3_54 = vTaskExitCritical(a3_36, mstatus, out a4_55, out a5_53);
		a5_61.u0 = 0x01;
		word32 a2_58;
		if (xStreamBufferIsEmpty(a0_33, a4_55, a5_53, mstatus, out a2_58) != 0x01)
		{
			ui32 a5_65 = (word32) *((word32) a4_55 + 6);
			*((word32) a4_55 + 6) = (word16) (a5_65 | 1);
			s2_42();
		}
	}
	aos_mutex_unlock(s1_41, a4_55, a5_61, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
}

// 2307B658: void vfs_uart_sync(Register (ptr32 Eq_445873) s0, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void vfs_uart_sync(struct Eq_445873 * s0, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if (a0 == 0x00)
		return;
	if (a5 == 0x00)
		return;
	Eq_2 a5_16 = s0->t0004;
	if (s0 != null)
	{
		Eq_2 a4_28;
		Eq_2 a5_43;
		word32 s1_150;
		word32 a0_151;
		word32 a3_152;
		word32 a5_153;
		word32 s2_154;
		word32 s3_155;
		word32 s4_156;
		aos_mutex_unlock(hal_uart_send_flush(aos_mutex_lock((char *) &s0->t0004 + 28, ~0x00, a2, a3, a4, a5_16, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_150, out a0_151, out a3_152, out a4_28, out a5_153, out s2_154, out s3_155, out s4_156), out a5_43), a4_28, a5_43, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178);
	}
}

// 2307B698: void uart_ioctl_cmd_waimode(Register Eq_2 ra, Register (ptr32 Eq_445924) a0, Register word32 a1, Register (ptr32 Eq_445926) a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Stack Eq_2 dwArg0138)
void uart_ioctl_cmd_waimode(Eq_2 ra, struct Eq_445924 * a0, word32 a1, struct Eq_445926 * a2, Eq_2 a4, Eq_2 a5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, Eq_2 dwArg0138)
{
	if (a2 != null)
	{
		Eq_2 s6_28 = a2->t0004;
		struct Eq_445924 * s4_34 = a0;
		Eq_2 s0_35 = 0x00;
		Eq_2 s3_38 = (word32) a2->t0008 + 1000 >> 1000;
		do
		{
			word32 a0_55;
			word32 s0_63;
			Eq_445956 s2_65;
			word32 s5_68;
			word32 s8_69;
			word32 a2_177;
			word32 s1_176;
			ra = xStreamBufferReceive(ra, s0_35, s4_34->ptr0010, (word32) s0_35 + a1, s6_28 - s0_35, s3_38, a4, a5, mstatus, s6, dwLoc08, dwArg84, dwArgA0, dwArgA4, dwArgC8, dwArgF8, dwArg0138, out s0_63, out s1_176, out a0_55, out a1, out a2_177, out a4, out a5, out s2_65, out s3_38, out s4_34, out s5_68, out s8_69, out mstatus);
			s0_35 = s0_63 + a0_55;
		} while (s6_28 != s0_35 && (s2_65 > 999 && (s5_68 != s8_69 || s0_35 <= 0x00)));
	}
	0x00 = dwArg0128;
}

// 2307B712: void uart_ioctl_cmd_setconfig(Register (ptr32 byte) a0, Register (ptr32 Eq_445992) a1)
void uart_ioctl_cmd_setconfig(byte * a0, struct Eq_445992 * a1)
{
	if (a1 == null)
		return;
	word32 a2_8 = (word32) a1->b0004;
	hal_uart_setconfig(a0);
}

// 2307B73C: void vfs_uart_ioctl(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_446009) s1, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0158)
void vfs_uart_ioctl(Eq_2 ra, Eq_2 s0, struct Eq_446009 * s1, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0158)
{
	if (a0 != 0x00 && a5 != 0x00)
	{
		Eq_2 a5_19 = s1->t0004;
		if (s1 != null)
		{
			up32 s2_39;
			Eq_2 s3_40;
			word32 s1_134;
			word32 a0_135;
			word32 a3_136;
			word32 a4_137;
			word32 a5_138;
			word32 s4_139;
			aos_mutex_lock((char *) &s1->t0004 + 28, ~0x00, a2, a3, a4, a5_19, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_134, out a0_135, out a3_136, out a4_137, out a5_138, out s2_39, out s3_40, out s4_139);
			if (s2_39 <= ~0x07)
				;
			aos_mutex_unlock(s3_40, 0x06, s2_39 + -2, mstatus, s0, ra, dwArgD8, dwArg0118, dwArg0158);
		}
	}
	0x00 = dwArg0128;
}

// 2307B7CA: Register word32 get_context(Register Eq_2 a0, Register Eq_2 a1, Register out (ptr32 word32) a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      aos_loop_set_eventfd
//      aos_poll_read_fd
//      aos_post_delayed_action
//      aos_loop_run
word32 get_context(Eq_2 a0, Eq_2 a1, word32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 s1_21 = *a0;
	ptr32 a4_15;
	ptr32 a3_17;
	ptr32 a5_16;
	word32 * a0_13 = aos_task_getspecific(a0, out a3_17, out a4_15, out a5_16);
	if (a0_13 == null)
	{
		s1_21 = *a0_13;
		aos_task_setspecific(a0_13, a1, out a0_13, out a3_17, out a4_15, out a5_16);
	}
	a0Out = a0_13;
	a3Out = a3_17;
	a4Out = a4_15;
	a5Out = a5_16;
	return s1_21;
}

