pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307B7FA: void aos_loop_set_eventfd(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      aos_event_service_init
void aos_loop_set_eventfd(Eq_2 a0, Eq_2 a1)
{
	word32 a0_11;
	word32 a3_27;
	word32 a4_28;
	word32 a5_29;
	get_context(a0, a1, out a0_11, out a3_27, out a4_28, out a5_29);
	*((word32) a0 + 16) = a0_11;
}

// 2307B810: Register Eq_2 aos_loop_init(Register Eq_2 ra, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
Eq_2 aos_loop_init(Eq_2 ra, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 ra_132;
	ptr32 s2_136;
	word32 a5_286;
	Eq_2 a4_19;
	Eq_2 a3_21;
	word32 * a0_17 = aos_task_getspecific(g_t4200F6C0, out a3_21, out a4_19, out a5_286);
	Eq_2 a5_22 = g_t4200F6C4;
	if (a5_22 == 0x00)
		a3_21 = aos_task_key_create(0x4200F6C0, out a4_19, out a5_22);
	else if (a0_17 != null)
	{
		word32 s9_315;
		word32 s10_316;
		word32 s11_317;
		word32 t4_318;
		word32 s8_314;
		word32 s5_311;
		word32 s6_312;
		word32 s7_313;
		word32 a7_308;
		word32 s3_309;
		word32 s4_310;
		word32 a3_305;
		word32 a4_306;
		word32 a5_307;
		word32 a0_302;
		word32 a1_303;
		word32 a2_304;
		word32 s1_301;
		ra_132 = printf(ra, &g_t230C4504, a3_21, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a2_304, out a3_305, out a4_306, out a5_307, out a7_308, out s2_136, out s3_309, out s4_310, out s5_311, out s6_312, out s7_313, out s8_314, out s9_315, out s10_316, out s11_317, out t4_318);
		goto l2307B87C;
	}
	Eq_2 a0_66;
	Eq_2 s2_75;
	word32 ** s3_76;
	word32 s4_299;
	word32 s8_300;
	word32 a4_297;
	word32 a6_298;
	word32 a1_294;
	word32 a2_295;
	word32 a3_296;
	word32 s1_293;
	union Eq_2 * a5_71;
	pvPortMalloc(ra, 0x4200F6C4, 0x1C, a3_21, a4_19, a5_22, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_293, out a0_66, out a1_294, out a2_295, out a3_296, out a4_297, out a5_71, out a6_298, out s2_75, out s3_76, out s4_299, out s8_300);
	if (a0_66 != 0x00)
	{
		word32 a3_291;
		word32 a4_292;
		word32 a0_288;
		word32 a1_289;
		word32 a2_290;
		word32 t1_287;
		ra = memset(ra, a0_66, 0x00, 0x1C, out t1_287, out a0_288, out a1_289, out a2_290, out a3_291, out a4_292, out a5_71);
	}
	Eq_2 s1_95 = *a5_71;
	if (a5_71 == null)
		*a0_66 = s1_95;
	*a0_66 = a0_66;
	word32 * a0_102 = *s3_76;
	*(union Eq_2 *) 0x0F = a0_66;
	*((word32) a0_66 + 4) = a0_66;
	word32 a0_319;
	word32 a3_320;
	word32 a4_321;
	word32 a5_322;
	ra_132 = aos_event_service_init(ra, aos_task_setspecific(a0_102, a0_66, out a0_319, out a3_320, out a4_321, out a5_322), s2_75, mstatus, dwLoc20, dwLoc1C, dwArg10, dwArg14, dwArg38, dwArg58, dwArg5C, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s2_136, out mstatus);
l2307B87C:
	s2Out = s2_136;
	mstatusOut = mstatus;
	return ra_132;
}

// 2307B88C: Register Eq_2 aos_poll_read_fd(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      aos_loop_proc
//      aos_event_service_init
Eq_2 aos_poll_read_fd(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 s2_182 = a0;
	struct Eq_446293 * a0_30;
	Eq_2 a5_161;
	Eq_2 a3_146;
	Eq_2 a4_147;
	Eq_2 s1_35 = get_context(a0, a1, out a0_30, out a3_146, out a4_147, out a5_161);
	if (a0 >= 0x00)
	{
		ui32 s5_40 = (word32) a0_30->b0016;
		Eq_2 a0_47;
		Eq_2 a3_50;
		Eq_2 a4_51;
		Eq_2 a5_52;
		ui32 s4_58;
		word32 s1_326;
		word32 a1_327;
		word32 a2_328;
		word32 a6_329;
		word32 s2_330;
		word32 s3_331;
		word32 s8_332;
		pvPortMalloc(ra, s1_35, s5_40 + 0x0D, a3_146, a4_147, a5_161, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_326, out a0_47, out a1_327, out a2_328, out a3_50, out a4_51, out a5_52, out a6_329, out s2_330, out s3_331, out s4_58, out s8_332);
		word32 a0_64;
		Eq_2 a3_67;
		Eq_2 s1_72;
		word32 s8_76;
		word32 a1_333;
		word32 a2_334;
		word32 a4_335;
		word32 a5_336;
		word32 a6_337;
		word32 s3_338;
		word32 s4_339;
		Eq_2 s0_71 = pvPortMalloc(ra, a0_47, s4_58 << 0x03, a3_50, a4_51, a5_52, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_72, out a0_64, out a1_333, out a2_334, out a3_67, out a4_335, out a5_336, out a6_337, out s2_182, out s3_338, out s4_339, out s8_76);
		if (s1_72 != 0x00 && a0_64 != 0x00)
		{
			aos_fcntl(s2_182);
			aos_fcntl(s2_182);
			*((word32) *(union Eq_2 *) 0x10 + 22) = (byte) ((word32) *((word32) s0_71 + 22) + 0x01);
			Eq_2 a5_101;
			Eq_2 a2_104;
			word32 a1_370;
			word32 a3_371;
			word32 a4_372;
			word32 a6_373;
			word32 a7_374;
			memcpy(s1_72, 0x04, s5_40 + s8_76, out a1_370, out a2_104, out a3_371, out a4_372, out a5_101, out a6_373, out a7_374);
			struct Eq_446492 * s1_118;
			Eq_2 a1_121;
			Eq_2 s4_124;
			word32 s0_375;
			word32 a0_376;
			word32 a2_377;
			word32 a3_378;
			word32 a4_379;
			word32 a5_380;
			word32 a6_381;
			word32 t3_382;
			vPortFree(s1_72, a2_104, a5_101, mstatus, dwArg0128, dwArg0168, out s0_375, out s1_118, out a0_376, out a1_121, out a2_377, out a3_378, out a4_379, out a5_380, out a6_381, out s4_124, out t3_382);
			s1_118->dw000C = (word32) *((word32) a1_121 + 8);
			Eq_2 a5_131;
			Eq_2 a2_134;
			word32 a1_383;
			word32 a3_384;
			word32 a4_385;
			word32 a6_386;
			word32 a7_387;
			memcpy(s4_124, a1_121, s5_40 << 0x03, out a1_383, out a2_134, out a3_384, out a4_385, out a5_131, out a6_386, out a7_387);
			struct Eq_446540 * s1_149;
			struct Eq_446541 * s0_154;
			word32 s4_155;
			word32 a0_388;
			word32 a2_389;
			word32 a5_390;
			word32 a6_391;
			word32 t3_392;
			vPortFree(s4_124, a2_134, a5_131, mstatus, dwArg0128, dwArg0168, out s0_154, out s1_149, out a0_388, out a1, out a2_389, out a3_146, out a4_147, out a5_390, out a6_391, out s4_155, out t3_392);
			s0_154->dw0008 = s4_155;
			s1_149->t0000 = s2_182;
			s1_149->dw0004 = a2;
			s1_149->t0008 = a1;
			a5_161 = (word32) s0_154->w0014;
			if (a5_161 < s2_182)
				s0_154->w0014 = (word16) s2_182;
		}
		else
		{
			Eq_2 a5_171;
			Eq_2 a2_174;
			Eq_2 s1_179;
			word32 a0_340;
			word32 a1_341;
			word32 a3_342;
			word32 a4_343;
			word32 a7_344;
			word32 s3_345;
			word32 s4_346;
			word32 s5_347;
			word32 s6_348;
			word32 s7_349;
			word32 s8_350;
			word32 s9_351;
			word32 s10_352;
			word32 s11_353;
			word32 t4_354;
			ra = printf(ra, &g_t230C4530, a3_67, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_179, out a0_340, out a1_341, out a2_174, out a3_342, out a4_343, out a5_171, out a7_344, out s2_182, out s3_345, out s4_346, out s5_347, out s6_348, out s7_349, out s8_350, out s9_351, out s10_352, out s11_353, out t4_354);
			Eq_2 a2_194;
			Eq_2 a5_197;
			Eq_2 s4_204;
			word32 s0_355;
			word32 s1_356;
			word32 a0_357;
			word32 a1_358;
			word32 a3_359;
			word32 a4_360;
			word32 a6_361;
			word32 t3_362;
			vPortFree(s1_179, a2_174, a5_171, mstatus, dwArg0128, dwArg0168, out s0_355, out s1_356, out a0_357, out a1_358, out a2_194, out a3_359, out a4_360, out a5_197, out a6_361, out s4_204, out t3_362);
			word32 s0_363;
			word32 s1_364;
			word32 a0_365;
			word32 a2_366;
			word32 a6_367;
			word32 s4_368;
			word32 t3_369;
			vPortFree(s4_204, a2_194, a5_197, mstatus, dwArg0128, dwArg0168, out s0_363, out s1_364, out a0_365, out a1, out a2_366, out a3_146, out a4_147, out a5_161, out a6_367, out s4_368, out t3_369);
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = s4;
	a1Out = a1;
	a3Out = a3_146;
	a4Out = a4_147;
	a5Out = a5_161;
	s2Out = s2_182;
	return ra;
}

