pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307B972: Register Eq_2 aos_post_delayed_action(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      blsync_ble_start
//      blsync_ble_stop
//      event_cb_wifi_event_mgmr
//      trigger_auto_denoise
Eq_2 aos_post_delayed_action(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a1 == 0x00)
		return a3;
	Eq_2 a3_25;
	Eq_2 a4_26;
	Eq_2 a5_27;
	word32 a0_35;
	Eq_2 a3_38;
	Eq_2 s1_43;
	word32 s2_44;
	word32 s3_45;
	struct Eq_446595 * s4_46;
	word32 a5_198;
	word32 a6_199;
	word32 s8_200;
	word32 a0_194;
	word32 a1_195;
	word32 a2_196;
	word32 a4_197;
	pvPortMalloc(ra, get_context(a0, a1, out a0_194, out a3_25, out a4_26, out a5_27), 32, a3_25, a4_26, a5_27, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_43, out a0_35, out a1_195, out a2_196, out a3_38, out a4_197, out a5_198, out a6_199, out s2_44, out s3_45, out s4_46, out s8_200);
	if (a0_35 != 0x00)
	{
		Eq_2 a0_60 = (word32) s1_43 + a0_52;
		word32 a0_52;
		word32 a1_53;
		word32 a4_202;
		word32 a5_203;
		word32 a2_201;
		Eq_2 s0_57 = aos_now_ms(a3_38, out a0_52, out a1_53, out a2_201, out a4_202, out a5_203);
		*((word32) a0_60 + 8) = s0_57;
		Eq_2 a4_63 = (word32) (a0_60 < s1_43) + (a1_53 + (s1_43 >> 0x1F));
		*((word32) a4_63 + 0x0C) = s0_57;
		*((word32) s0_57 + 16) = s3_45;
		*((word32) s0_57 + 20) = s2_44;
		*((word32) s1_43 + 24) = s0_57;
		struct Eq_446595 * a5_69 = s4_46->ptr0004;
		while (a5_69 != s4_46)
		{
			struct Eq_446683 * a5_74 = *((word32) a3_38 + 0x0C);
			if (a4_63 < a3_38)
				break;
			if (a3_38 == a4_63)
			{
				a5_74 = (struct Eq_446683 *) *((word32) a3_38 + 8);
				if (a0_60 < a3_38)
					break;
			}
			a5_69 = a5_74->ptr0004;
		}
		Eq_2 a5_83 = *a4_63;
		*((word32) a5_83 + 4) = s0_57;
		*a4_63 = s0_57;
		*((word32) s0_57 + 4) = a4_63;
		*s0_57 = a5_83;
	}
	return a3_38;
}

// 2307B9F6: Register Eq_2 aos_loop_run(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
Eq_2 aos_loop_run(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & mstatusOut)
{
	word32 a5_693;
	Eq_2 a3_107;
	Eq_2 a4_108;
	Eq_2 a0_127;
	Eq_2 s1_176 = get_context(a0, a1, out a0_127, out a3_107, out a4_108, out a5_693);
	Eq_2 s0_130 = a0_127;
	word32 s3_116 = 0x0C;
	word32 s4_117 = 0x01;
	while ((word32) *((word32) s0_130 + 24) == 0x00)
	{
		s0_130 = *((word32) s1_176 + 4);
		Eq_2 s2_40 = (word32) *((word32) s0_130 + 22);
		if (s0_130 == s1_176 && s2_40 == 0x00)
			break;
		if (s0_130 != s1_176)
		{
			int32 a1_47;
			Eq_2 a2_48;
			int32 a5_50;
			aos_now_ms(a3_107, out a0_127, out a1_47, out a2_48, out a4_108, out a5_50);
			if (a1_47 >= a5_50 && (a5_50 != a1_47 || a0_127 >= a2_48))
				;
		}
		Eq_2 a5_60 = 0x00;
		while (a5_60 < s2_40)
		{
			Eq_446746 a1_70 = a5_60 << 0x03;
			union Eq_2 * a4_67 = (word32) a5_60 + s3_116;
			a0_127 += a1_70;
			a3_107 = *a4_67;
			*a4_67 = (union Eq_2 *) a0_127;
			a4_108 = a4_67 + a1_70;
			*((word32) a4_108 + 4) = (word16) s4_117;
			a5_60 = (word32) a5_60 + 1;
		}
		Eq_2 a0_104;
		Eq_2 s1_114;
		Eq_2 s2_115;
		Eq_2 a5_109;
		Eq_2 a1_105;
		Eq_2 s5_118;
		ra = aos_poll(ra, a0_127, a3_107, a4_108, a5_60, mstatus, dwArg88, dwArgC8, dwArgF8, dwArg0138, dwArg0178, out s1_114, out a0_104, out a1_105, out a3_107, out a4_108, out a5_109, out s2_115, out s3_116, out s4_117, out s5_118, out mstatus);
		Eq_2 s6_124 = a0_104;
		a0_127 = a0_104;
		if (a0_104 < 0x00)
		{
			__errno(out a5_109);
			a0_127 = *a5_109;
			if (a5_109 != s5_118)
			{
				0x00 = (int8) dwArgA8;
				Eq_2 a3_240;
				word32 a1_696;
				word32 s7_706;
				word32 a7_700;
				word32 s10_709;
				word32 t4_711;
				word32 s11_710;
				word32 s8_707;
				word32 s9_708;
				word32 s4_703;
				word32 s6_705;
				word32 s5_704;
				word32 s2_701;
				word32 s3_702;
				word32 a5_699;
				word32 a2_697;
				word32 a4_698;
				word32 a0_695;
				word32 s1_694;
				printf(ra, &g_t230C4520, a3_107, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_694, out a0_695, out a1_696, out a2_697, out a3_240, out a4_698, out a5_699, out a7_700, out s2_701, out s3_702, out s4_703, out s5_704, out s6_705, out s7_706, out s8_707, out s9_708, out s10_709, out s11_710, out t4_711);
				mstatusOut = mstatus;
				return a3_240;
			}
		}
		s0_130 = *((word32) s1_114 + 4);
		if (s0_130 != s1_114)
		{
			word32 a2_712;
			s0_130 = aos_now_ms(a3_107, out a0_127, out a1_105, out a2_712, out a4_108, out a5_109);
			if (a1_105 >= a5_109 && (a5_109 != a1_105 || a0_127 >= a5_109))
			{
				*((word32) a5_109 + 4) = a4_108;
				*a4_108 = a5_109;
				Eq_2 a2_154;
				Eq_2 a5_156;
				a5_109();
				word32 a6_715;
				word32 t3_716;
				word32 s1_713;
				word32 a2_714;
				vPortFree(*((word32) a5_109 + 20), a2_154, a5_156, mstatus, dwArg0138, dwArg0178, out s0_130, out s1_713, out a0_127, out a1_105, out a2_714, out a3_107, out a4_108, out a5_109, out a6_715, out s4_117, out t3_716);
			}
		}
		s1_176.u0 = 0x00;
		if (a0_104 > 0x00)
		{
			while (s1_176 != s2_115)
			{
				ptr32 mstatus_221;
				a4_108 = s1_176 << 0x03;
				word32 a5_187 = CONVERT(Mem271[a5_109 + a4_108 + 6:uint16], uint16, word32);
				s0_130 = *((word32) a5_109 + 8);
				a5_109 = a5_187 & 0x01;
				if ((a5_187 & 0x01) != 0x00)
				{
					word32 s7_222;
					word32 t0_351;
					word32 t4_352;
					word32 s9_350;
					word32 s11_349;
					word32 s10_348;
					word32 a7_347;
					a4_108();
					mstatus = mstatus_221;
				}
				s1_176 = (byte) s1_176.u0 + 1;
			}
		}
	}
	*((word32) s0_130 + 24) = 0x00;
	0x00 = (int8) dwArgA8;
	mstatusOut = mstatus;
	return a3_107;
}

// 2307BB10: void vfs_poll_notify(Register (ptr32 Eq_2) a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void vfs_poll_notify(union Eq_2 * a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	aos_sem_signal(a1, a2, a4, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178);
}

// 2307BB14: Register Eq_2 aos_poll(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_446788) a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_run
Eq_2 aos_poll(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, struct Eq_446788 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_446962 * sp_282 = fp + -64;
	Eq_2 s0_284 = a0;
	Eq_2 s3_100;
	Eq_2 s2_159;
	Eq_2 a2_107 = aos_sem_new(ra, a0, 0x00, a3, a4, a5, mstatus, dwArgA8, dwArgE8, out s2_159, out s3_100);
	int32 a5_48;
	for (a5_48 = 0x00; a5_48 != 0x08; ++a5_48)
	{
		Eq_2 a3_110 = fp + -56 + a5_48;
		*a3_110 = 0x00;
	}
	word32 s1_102 = (word32) a0 + 6;
	Eq_2 a4_109 = (word32) a0 + 6;
	Eq_2 a5_108 = 0x00;
	while (a5_108 < s2_159)
	{
		*a4_109 = 0x00;
		a5_108 = (word32) a5_108 + 1;
		a4_109 = (word32) a4_109 + 8;
	}
	Eq_2 s6_105 = a0;
	Eq_2 s7_106 = 0x00;
	Eq_2 s4_103 = 0x01;
	word32 s5_104 = 0x2307C000;
	while (true)
	{
		word32 s4_188;
		Eq_2 a0_150;
		if (s7_106 >= s2_159)
			break;
		Eq_2 a0_76 = *s6_105;
		if (s4_103 >= a0_76)
		{
			a5_108 = (char *) sp_282 + 16 + ((a0_76 >> 0x05) << 2);
			a4_109 = *((word32) a5_108 - 8);
			*((word32) a5_108 + 0x0FF8) = s4_103 << a0_76 | a4_109;
		}
		else
		{
			struct Eq_447197 ** a5_79;
			a0_150 = get_file(a0_76, out a5_79);
			if (a0_150 == 0x00)
			{
				s4_188 = ~0x00;
				goto l2307BBEC;
			}
			<anonymous> * a5_89 = *((char *) *a5_79 + 20);
			a5_89();
		}
		s7_106 = (word32) s7_106 + 1;
		s6_105 = (word32) s6_105 + 8;
	}
	Eq_2 a1_128 = s3_100;
	if (s3_100 < 0x00)
		a1_128.u0 = ~0x00;
	struct Eq_447031 * s1_158 = aos_sem_wait((char *) sp_282 + 4, a1_128, a2_107, a3_110, a4_109, a5_108, mstatus, sp_282->t0014, sp_282->t0094, sp_282->t0108, sp_282->t0148, out a0_150, out a4_109, out s2_159);
	a3_110.u0 = 0x00;
	while (a3_110 < s2_159)
	{
		Eq_447093 a5_171 = s1_158->dwFFFFFFFA;
		a4_109 = ((char *) sp_282 + 16 + ((a5_171 >> 0x05) << 2))[-8];
		if ((0x01 << a5_171 & a4_109) != 0x00)
			s1_158->w0000 = (word16) ((word32) s1_158->w0000 | 1);
		a3_110 = (byte) a3_110.u0 + 1;
		++s1_158;
	}
	s4_188 = 0x00;
l2307BBEC:
	word32 s1_189 = 0x00;
	Eq_2 s3_190 = 0x00;
	Eq_2 s5_191 = 0x01;
	while (s3_190 < s2_159)
	{
		word32 s0_196 = *a0_150;
		if (s5_191 < a0_150)
		{
			struct Eq_447164 ** a5_199;
			a0_150 = get_file(a0_150, out a5_199);
			if (a0_150 != 0x00)
			{
				<anonymous> * a5_206 = *((char *) *a5_199 + 20);
				struct Eq_447168 * s0_215;
				a5_206();
				if ((int32) s0_215->w0006 != 0x00)
					++s1_189;
			}
		}
		s3_190 = (word32) s3_190 + 1;
	}
	ptr32 a1_251;
	ptr32 a3_253;
	struct Eq_446788 * a4_254;
	ptr32 a5_255;
	word32 s4_259;
	ptr32 s1_258 = aos_sem_free(fp - 60, a3_110, a4_109, mstatus, dwArg0118, dwArg0158, out a1_251, out a3_253, out a4_254, out a5_255, out s4_259);
	if (s4_259 != 0x00)
		s1_258 = 0x00;
	0x00 = (int8) dwArg0198;
	s1Out = s1_258;
	a0Out = s1_258;
	a1Out = a1_251;
	a3Out = a3_253;
	a4Out = a4_254;
	a5Out = a5_255;
	s2Out = s2_159;
	s3Out = s3_190;
	s4Out = dwArgF4;
	s5Out = s5_191;
	mstatusOut = mstatus;
	return ra;
}

// 2307BC46: void aos_fcntl(Register Eq_2 a0)
// Called from:
//      aos_poll_read_fd
void aos_fcntl(Eq_2 a0)
{
}

// 2307BC5A: void dfl_entry(Register (ptr32 Eq_447212) s0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
void dfl_entry(struct Eq_447212 * s0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	word32 a2_15;
	word32 a5_18;
	word32 s1_19;
	<anonymous> * s0_24;
	word32 a0_70;
	word32 a1_71;
	word32 a3_72;
	word32 a4_73;
	word32 a6_74;
	word32 s4_75;
	word32 t3_76;
	vPortFree(s0->t0004, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_24, out s1_19, out a0_70, out a1_71, out a2_15, out a3_72, out a4_73, out a5_18, out a6_74, out s4_75, out t3_76);
	Eq_2 a3_29;
	Eq_2 a4_30;
	Eq_2 a5_31;
	s0_24();
	word32 a0_77;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 s2_81;
	vTaskDelete(0x00, dwArg10, a3_29, a4_30, a5_31, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_77, out a3_78, out a4_79, out a5_80, out s2_81);
}

// 2307BC7C: void aos_task_new(Register Eq_2 ra, Register Eq_2 s1, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ota_cmd
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
void aos_task_new(Eq_2 ra, Eq_2 s1, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_35;
	Eq_2 a4_36;
	Eq_2 a5_37;
	Eq_2 s1_40;
	word32 s8_259;
	word32 s4_258;
	word32 s3_257;
	word32 s2_256;
	word32 a6_255;
	word32 a2_254;
	word32 a1_253;
	word32 a0_252;
	pvPortMalloc(ra, s1, 0x009C, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_40, out a0_252, out a1_253, out a2_254, out a3_35, out a4_36, out a5_37, out a6_255, out s2_256, out s3_257, out s4_258, out s8_259);
	Eq_2 a0_49;
	Eq_2 a3_52;
	Eq_2 a4_53;
	Eq_2 a5_54;
	Eq_2 s3_59;
	word32 s1_260;
	word32 a1_261;
	word32 a2_262;
	word32 a6_263;
	word32 s2_264;
	word32 s4_265;
	word32 s8_266;
	pvPortMalloc(ra, s1_40, 0x0C, a3_35, a4_36, a5_37, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_260, out a0_49, out a1_261, out a2_262, out a3_52, out a4_53, out a5_54, out a6_263, out s2_264, out s3_59, out s4_265, out s8_266);
	Eq_2 a0_66;
	Eq_2 s1_74;
	Eq_2 s3_76;
	Eq_2 s4_77;
	word32 a1_267;
	word32 a2_268;
	word32 a3_269;
	word32 a4_270;
	word32 a5_271;
	word32 a6_272;
	word32 s2_273;
	word32 s8_274;
	Eq_2 s0_73 = pvPortMalloc(ra, a0_49, s3_59, a3_52, a4_53, a5_54, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_74, out a0_66, out a1_267, out a2_268, out a3_269, out a4_270, out a5_271, out a6_272, out s2_273, out s3_76, out s4_77, out s8_274);
	word32 t1_275;
	word32 a0_276;
	word32 a1_277;
	word32 a2_278;
	word32 a3_279;
	word32 a4_280;
	word32 a5_281;
	word32 t1_282;
	word32 a0_283;
	word32 a1_284;
	word32 a2_285;
	word32 a3_286;
	word32 a4_287;
	word32 a5_288;
	Eq_2 ra_102 = memset(memset(ra, a0_66, 0x00, s3_76, out t1_275, out a0_276, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281), s0_73, 0x00, 0x009C, out t1_282, out a0_283, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288);
	*(union Eq_2 *) 0x50 = s0_73;
	*((word32) s0_73 + 116) = a0_66;
	word32 a2_289;
	word32 a3_290;
	word32 a4_291;
	word32 a5_292;
	strncpy((word32) s0_73 + 0x0078, s4_77, 0x1F, out a2_289, out a3_290, out a4_291, out a5_292);
	*((word32) s0_73 + 0x0098) = 0x20171020;
	*s0_73 = s1_74;
	*((word32) s1_74 + 4) = a1;
	*((word32) s1_74 + 8) = a2;
	word32 a0_134;
	Eq_2 a2_135;
	Eq_2 a5_136;
	Eq_2 s0_138;
	Eq_2 s2_148;
	word32 tp_293;
	word32 t0_294;
	word32 s1_295;
	word32 a3_296;
	word32 a4_297;
	word32 s3_298;
	word32 s6_299;
	word32 s7_300;
	xTaskCreateStatic(ra_102, &g_ptr2307BC5A, s4_77, s3_76 >> 0x02, s1_74, 0x0A, a0_66, s0_73, mstatus, s4, dwArg04, dwArgC8, dwArg0194, out tp_293, out t0_294, out s0_138, out s1_295, out a0_134, out a2_135, out a3_296, out a4_297, out a5_136, out s2_148, out s3_298, out s6_299, out s7_300);
	if (a0_134 == 0x00)
	{
		Eq_2 a2_158;
		Eq_2 a5_161;
		word32 s0_301;
		word32 s1_302;
		word32 a0_303;
		word32 a1_304;
		word32 a3_305;
		word32 a4_306;
		word32 a6_307;
		word32 s4_308;
		word32 t3_309;
		vPortFree(s0_138, a2_135, a5_136, mstatus, dwArg0138, dwArg0178, out s0_301, out s1_302, out a0_303, out a1_304, out a2_158, out a3_305, out a4_306, out a5_161, out a6_307, out s4_308, out t3_309);
		Eq_2 a2_171;
		Eq_2 a5_174;
		Eq_2 s1_175;
		word32 s0_310;
		word32 a0_311;
		word32 a1_312;
		word32 a3_313;
		word32 a4_314;
		word32 a6_315;
		word32 s4_316;
		word32 t3_317;
		vPortFree(s2_148, a2_158, a5_161, mstatus, dwArg0138, dwArg0178, out s0_310, out s1_175, out a0_311, out a1_312, out a2_171, out a3_313, out a4_314, out a5_174, out a6_315, out s4_316, out t3_317);
		word32 s0_318;
		word32 s1_319;
		word32 a0_320;
		word32 a1_321;
		word32 a2_322;
		word32 a3_323;
		word32 a4_324;
		word32 a5_325;
		word32 a6_326;
		word32 s4_327;
		word32 t3_328;
		vPortFree(s1_175, a2_171, a5_174, mstatus, dwArg0138, dwArg0178, out s0_318, out s1_319, out a0_320, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out a6_326, out s4_327, out t3_328);
	}
	0x00 = dwArgA8;
}

// 2307BD36: void aos_task_exit(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
// Called from:
//      tftp_ota_thread
void aos_task_exit(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	word32 a0_28;
	word32 a3_29;
	word32 a4_30;
	word32 a5_31;
	word32 s2_32;
	vTaskDelete(0x00, a2, a3, a4, a5, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_28, out a3_29, out a4_30, out a5_31, out s2_32);
}

