pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307BD3C: Register ui32 aos_task_key_create(Register word32 a0, Register out ptr32 a4Out, Register out (ptr32 Eq_446142) a5Out)
// Called from:
//      aos_loop_init
ui32 aos_task_key_create(word32 a0, ptr32 & a4Out, struct Eq_446142 & a5Out)
{
	ptr32 a4_15;
	struct Eq_446142 * a5_14 = (struct Eq_446142 *) 0x20171020;
	word32 a5_59;
	if (*((word32) xTaskGetCurrentTaskHandle(out a5_59) + 0x0098) != 0x20171020)
	{
		a4_15 = ~0x00;
		goto l2307BD80;
	}
	word32 * a4_18;
	word32 a0_16 = *(word32 *) 0x20171080;
	if (false)
	{
		if (false)
		{
			if (false)
			{
				a3 = 0x00;
				a4_15 = ~0x00;
				if (false)
					goto l2307BD80;
				a4_18 = (word32 *) 0x03;
				a3 = 0x08;
			}
			else
			{
				a4_18 = (word32 *) 0x02;
				a3 = 0x04;
			}
		}
		else
		{
			a4_18 = (word32 *) 0x01;
			a3 = 0x02;
		}
	}
	else
	{
		a4_18 = null;
		a3 = 0x01;
	}
	a5_14 = a3 | 0x20171020;
	a5_14->dw0060 = a0_16;
	*a4_18 = a0;
	a4_15 = 0x00;
l2307BD80:
	a4Out = a4_15;
	a5Out = a5_14;
	return a3;
}

// 2307BDA0: Register (ptr32 word32) aos_task_setspecific(Register (ptr32 word32) a0, Register Eq_2 a1, Register out (ptr32 word32) a0Out, Register out Eq_446094 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      get_context
//      aos_loop_init
word32 * aos_task_setspecific(word32 * a0, Eq_2 a1, word32 & a0Out, union Eq_446094 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	word32 * a0_15;
	word32 * s0_24 = a0;
	Eq_2 a5_13;
	Eq_2 a0_12 = xTaskGetCurrentTaskHandle(out a5_13);
	ptr32 a4_14 = 0x03;
	if (a0 <= (word32 *) 0x03)
	{
		a3 = *((word32) a0_12 + 0x0098);
		a4_14 = 0x20171020;
		a5_13 = a0_12;
		a0_15 = (word32 *) ~0x00;
		if (a3 == 0x20171020)
		{
			s0_24 = (word32) a0_12 + (a0 + 6 << 2);
			*((word32) a1 + 4) = s0_24;
			a0_15 = null;
		}
	}
	else
		a0_15 = (word32 *) ~0x00;
	a0Out = a0_15;
	a3Out = a3;
	a4Out = a4_14;
	a5Out = a5_13;
	return s0_24;
}

// 2307BDE0: Register Eq_2 aos_task_getspecific(Register Eq_2 a0, Register out Eq_446077 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      get_context
//      aos_loop_init
Eq_2 aos_task_getspecific(Eq_2 a0, union Eq_446077 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_11;
	Eq_2 a0_10 = xTaskGetCurrentTaskHandle(out a5_11);
	ptr32 a4_12 = 0x03;
	if (a0 <= 0x03)
	{
		a3 = *((word32) a0_10 + 0x0098);
		a4_12 = 0x20171020;
		a5_11 = a0_10;
	}
	a3Out = a3;
	a4Out = a4_12;
	a5Out = a5_11;
	return 0x00;
}

// 2307BE1A: Register word32 aos_mutex_new(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      vfs_uart_open
//      event_open
word32 aos_mutex_new(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_17;
	ptr32 a4_18;
	union Eq_2 * a0_28;
	word32 a1_55;
	word32 a5_56;
	word32 s2_57;
	word32 s3_58;
	word32 s1_21 = xQueueCreateMutex(ra, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_28, out a1_55, out a3_17, out a4_18, out a5_56, out s2_57, out s3_58);
	*a0_28 = (union Eq_2 *) a0;
	a0Out = 0x00 - (word32) (a0_28 < (union Eq_2 *) 1);
	a3Out = a3_17;
	a4Out = a4_18;
	return s1_21;
}

// 2307BE3A: Register (ptr32 Eq_123468) aos_mutex_free(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      vfs_uart_close
//      event_close
struct Eq_123468 * aos_mutex_free(union Eq_2 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_5 = *a0;
	ptr32 a0_9;
	ptr32 a2_11;
	ptr32 a4_13;
	ptr32 a5_14;
	word32 s1_27;
	word32 a1_28;
	word32 a3_29;
	word32 s4_30;
	struct Eq_123468 * s0_16 = vQueueDelete(a0_5, a3, a4, mstatus, dwArg0158, dwArg0198, out s1_27, out a0_9, out a1_28, out a2_11, out a3_29, out a4_13, out a5_14, out s4_30);
	a0Out = a0_9;
	a2Out = a2_11;
	a4Out = a4_13;
	a5Out = a5_14;
	return s0_16;
}

// 2307BE40: Register Eq_2 aos_mutex_lock(Register (ptr32 Eq_445636) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      vfs_uart_read
//      vfs_uart_poll
//      vfs_uart_sync
//      vfs_uart_ioctl
//      event_poll
//      event_write
//      event_read
Eq_2 aos_mutex_lock(struct Eq_445636 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == null)
	{
		s1Out = s1;
		a0Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s0;
	}
	else
	{
		Eq_2 a3_18;
		Eq_2 a4_19;
		Eq_2 a5_20;
		ptr32 s1_23;
		ptr32 s2_24;
		ptr32 s3_25;
		ptr32 s4_26;
		word32 a0_73;
		word32 a1_74;
		word32 a2_75;
		word32 s8_76;
		Eq_2 s0_22 = xQueueSemaphoreTake(a0->t0000, a1, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_23, out a0_73, out a1_74, out a2_75, out a3_18, out a4_19, out a5_20, out s2_24, out s3_25, out s4_26, out s8_76);
		s1Out = s1_23;
		a0Out.u0 = <invalid>;
		a3Out = a3_18;
		a4Out = a4_19;
		a5Out = a5_20;
		s2Out = s2_24;
		s3Out = s3_25;
		s4Out = s4_26;
		return s0_22;
	}
}

// 2307BE58: void aos_mutex_unlock(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      vfs_uart_read
//      vfs_uart_poll
//      vfs_uart_sync
//      vfs_uart_ioctl
//      event_poll
//      event_write
//      event_read
void aos_mutex_unlock(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	word32 s1_93;
	word32 a0_94;
	word32 a1_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 a5_99;
	word32 a7_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s8_106;
	xQueueGenericSend(*a0, 0x00, 0x00, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_93, out a0_94, out a1_95, out a2_96, out a3_97, out a4_98, out a5_99, out a7_100, out s2_101, out s3_102, out s4_103, out s5_104, out s6_105, out s8_106);
}

// 2307BE76: Register word32 aos_sem_new(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_poll
word32 aos_sem_new(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & s2Out, ptr32 & s3Out)
{
	struct Eq_251193 ** a0_16;
	ptr32 s2_25;
	ptr32 s3_26;
	word32 s1_44;
	word32 a1_45;
	word32 a3_46;
	word32 a4_47;
	word32 s4_48;
	word32 s8_49;
	*a0_16 = (struct Eq_251193 **) xQueueCreateCountingSemaphore(ra, 0x0080, a1, a3, a4, a5, mstatus, dwLoc10, s0, dwArgE8, dwArg0128, out s1_44, out a0_16, out a1_45, out a3_46, out a4_47, out s2_25, out s3_26, out s4_48, out s8_49);
	s2Out = s2_25;
	s3Out = s3_26;
	return dwArg10;
}

// 2307BE92: Register word32 aos_sem_free(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      aos_poll
word32 aos_sem_free(union Eq_2 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	if (a0 == null)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a0_5 = *a0;
		ptr32 a1_10;
		Eq_2 a3_12;
		Eq_2 a4_13;
		ptr32 a5_14;
		word32 s1_17;
		ptr32 s4_18;
		word32 a0_50;
		word32 a2_51;
		vQueueDelete(a0_5, a3, a4, mstatus, dwArg0158, dwArg0198, out s1_17, out a0_50, out a1_10, out a2_51, out a3_12, out a4_13, out a5_14, out s4_18);
		a1Out = a1_10;
		a3Out = a3_12;
		a4Out = a4_13;
		a5Out = a5_14;
		s4Out = s4_18;
		return s1_17;
	}
}

