pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307BE9C: Register word32 aos_sem_wait(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out ptr32 s2Out)
// Called from:
//      aos_poll
word32 aos_sem_wait(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a0Out, union Eq_2 & a4Out, ptr32 & s2Out)
{
	if (a0 == null)
	{
		a0Out = ~0x00;
		a4Out = a4;
		s2Out = s2;
		return s1;
	}
	else
	{
		word32 a0_15;
		Eq_2 a4_19;
		word32 s1_23;
		ptr32 s2_24;
		word32 a1_70;
		word32 a2_71;
		word32 a3_72;
		word32 a5_73;
		word32 s3_74;
		word32 s4_75;
		word32 s8_76;
		xQueueSemaphoreTake(*a0, a1, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_23, out a0_15, out a1_70, out a2_71, out a3_72, out a4_19, out a5_73, out s2_24, out s3_74, out s4_75, out s8_76);
		a0Out = 0x00 - (word32) (a0_15 != ~0x00);
		a4Out = a4_19;
		s2Out = s2_24;
		return s1_23;
	}
}

// 2307BEBC: void aos_sem_signal(Register (ptr32 Eq_2) a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      vfs_poll_notify
void aos_sem_signal(union Eq_2 * a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if (a0 != null)
	{
		Eq_2 a5_9 = g_t4200F560;
		Eq_2 a0_10 = *a0;
		if (a5_9 != 0x00)
		{
			word32 a5_43;
			word32 a3_46 = xQueueGiveFromISR(a0_10, fp + ~0x13, a2, a4, a5_9, mstatus, out a5_43);
			if (a5_43 != 0x00)
			{
				word32 a0_132;
				word32 a4_133;
				word32 a5_134;
				vTaskSwitchContext(a3_46, mstatus, out a0_132, out a4_133, out a5_134);
			}
		}
		else
		{
			word32 s1_118;
			word32 a0_119;
			word32 a1_120;
			word32 a2_121;
			word32 a3_122;
			word32 a4_123;
			word32 a5_124;
			word32 a7_125;
			word32 s2_126;
			word32 s3_127;
			word32 s4_128;
			word32 s5_129;
			word32 s6_130;
			word32 s8_131;
			xQueueGenericSend(a0_10, 0x00, 0x00, a4, a5_9, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_118, out a0_119, out a1_120, out a2_121, out a3_122, out a4_123, out a5_124, out a7_125, out s2_126, out s3_127, out s4_128, out s5_129, out s6_130, out s8_131);
		}
	}
}

// 2307BEF0: Register Eq_2 aos_malloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_342347) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aos_cli_init
//      proc_onecmd
//      romfs_opendir
//      event_open
//      event_write
//      aos_register_event_filter
Eq_2 aos_malloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_342347 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_11;
	ptr32 a3_14;
	ptr32 a4_15;
	struct Eq_342347 * a5_16;
	ptr32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	ptr32 s4_22;
	word32 a1_39;
	word32 a2_40;
	word32 a6_41;
	word32 s8_42;
	Eq_2 s0_18 = pvPortMalloc(ra, s1, a0, a3, a4, a5, mstatus, dwArg40, dwArg44, dwArg8C, dwArg0138, dwArg0178, out s1_19, out a0_11, out a1_39, out a2_40, out a3_14, out a4_15, out a5_16, out a6_41, out s2_20, out s3_21, out s4_22, out s8_42);
	s1Out = s1_19;
	a0Out = a0_11;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	return s0_18;
}

// 2307BEF4: Register word32 free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a5Out)
// Called from:
//      scan
//      http_req
//      base_station_info
//      udp_send_data
//      tcp_send_data
word32 free(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a5Out)
{
	ptr32 a2_8;
	ptr32 a5_11;
	word32 s1_12;
	ptr32 a0_14;
	word32 s0_25;
	word32 a1_26;
	word32 a3_27;
	word32 a4_28;
	word32 a6_29;
	word32 s4_30;
	word32 t3_31;
	vPortFree(a0, a2, a5, mstatus, dwArg0158, dwArg0198, out s0_25, out s1_12, out a0_14, out a1_26, out a2_8, out a3_27, out a4_28, out a5_11, out a6_29, out s4_30, out t3_31);
	a0Out = a0_14;
	a2Out = a2_8;
	a5Out = a5_11;
	return s1_12;
}

// 2307BEF8: Register word32 aos_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_2) a4Out, Register out (ptr32 Eq_343100) a5Out, Register out ptr32 a6Out, Register out ptr32 t3Out)
// Called from:
//      proc_onecmd
//      romfs_closedir
//      romfs_opendir
//      event_close
//      event_read
word32 aos_free(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_343100 & a5Out, ptr32 & a6Out, ptr32 & t3Out)
{
	ptr32 a2_8;
	ptr32 a3_9;
	union Eq_2 * a4_10;
	struct Eq_343100 * a5_11;
	ptr32 s1_12;
	ptr32 a0_14;
	ptr32 a6_16;
	ptr32 t3_19;
	word32 s0_30;
	word32 a1_31;
	word32 s4_32;
	word32 tp_13 = vPortFree(a0, a2, a5, mstatus, dwArg0158, dwArg0198, out s0_30, out s1_12, out a0_14, out a1_31, out a2_8, out a3_9, out a4_10, out a5_11, out a6_16, out s4_32, out t3_19);
	s1Out = s1_12;
	a0Out = a0_14;
	a2Out = a2_8;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	a6Out = a6_16;
	t3Out = t3_19;
	return tp_13;
}

// 2307BEFC: Register Eq_2 malloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      scan
//      http_req
//      base_station_info
//      bl_cipsend
Eq_2 malloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 a0_11;
	ptr32 a2_13;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 a5_16;
	ptr32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	word32 a1_39;
	word32 a6_40;
	word32 s4_41;
	word32 s8_42;
	Eq_2 s0_18 = pvPortMalloc(ra, s1, a0, a3, a4, a5, mstatus, dwArg40, dwArg44, dwArg8C, dwArg0138, dwArg0178, out s1_19, out a0_11, out a1_39, out a2_13, out a3_14, out a4_15, out a5_16, out a6_40, out s2_20, out s3_21, out s4_41, out s8_42);
	s1Out = s1_19;
	a0Out = a0_11;
	a2Out = a2_13;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	s2Out = s2_20;
	s3Out = s3_21;
	return s0_18;
}

// 2307BF00: Register word32 aos_now_ms(Register Eq_2 a3, Register out ptr32 a0Out, Register out Eq_1005 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_1007) a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      event_cb_wifi_event
//      uptime_cmd
//      sec_trng_IRQHandler
//      aos_post_delayed_action
//      aos_loop_run
word32 aos_now_ms(Eq_2 a3, ptr32 & a0Out, union Eq_1005 & a1Out, ptr32 & a2Out, struct Eq_1007 & a4Out, union Eq_2 & a5Out)
{
	word32 a0_10 = xTaskGetTickCount2(fp + ~0x17, fp + ~0x13);
	if (a0_10 == 0x01)
	{
		ptr32 a5_19 = 0x00 - a3;
		ptr32 a0_21 = a0_10 + a5_19;
		a0Out = a0_21;
		struct Eq_1007 * a4_18 = (word32) (a3 > ~0x00);
		union Eq_2 * a5_23 = (word32) (a0_21 < a5_19);
		a1Out = (a3 >>u 0x1F) + a4_18 + a5_23;
		a2Out = dwArg84;
		a4Out = a4_18;
		a5Out = a5_23;
		return dwArg24;
	}
	else
	{
		while (true)
			;
	}
}

// 2307BF3A: void event_poll(Register word32 ra, Register (ptr32 Eq_445636) s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArg84, Stack word32 dwArgA4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void event_poll(word32 ra, struct Eq_445636 * s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArg84, word32 dwArgA4, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_448081 * a3_26;
	word32 s1_31;
	word32 s4_140;
	word32 s3_139;
	word32 s2_138;
	word32 a0_137;
	Eq_2 a4_27;
	Eq_2 a5_28;
	aos_mutex_lock(s0, ~0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_31, out a0_137, out a3_26, out a4_27, out a5_28, out s2_138, out s3_139, out s4_140);
	Eq_2 s0_39 = dwArg84;
	if (s1_31 == 0x00)
	{
		*((word32) dwArg84 + 4) = 0x00;
		*((word32) dwArg84 + 0x0C) = 0x00;
	}
	else
	{
		s0_39 = *((word32) a5_28 + 16);
		*((word32) a2 + 4) = s0_39;
		a3_26->t0008 = s0_39;
		*((word32) a4_27 + 0x0C) = s0_39;
		if (a5_28 != 0x00)
		{
			ui32 a5_45 = (word32) a3_26->w0006;
			a3_26->w0006 = (word16) (a5_45 | 1);
			a2();
		}
	}
	aos_mutex_unlock(s0_39, a4_27, a5_28, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
}

// 2307BF94: void event_open(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void event_open(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a0_17;
	word32 s1_91;
	word32 a3_92;
	word32 a4_93;
	word32 a5_94;
	word32 s2_95;
	word32 s3_96;
	word32 s4_97;
	aos_malloc(ra, a1, 40, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_91, out a0_17, out a3_92, out a4_93, out a5_94, out s2_95, out s3_96, out s4_97);
	Eq_2 a3_38;
	Eq_2 a4_39;
	Eq_2 a5_40;
	word32 t1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	word32 a0_102;
	word32 a3_103;
	word32 a4_104;
	word32 s1_53 = aos_mutex_new(memset(ra, a0_17, 0x00, 40, out t1_98, out a0_99, out a1_100, out a2_101, out a3_38, out a4_39, out a5_40), a0_17, a3_38, a4_39, a5_40, mstatus, dwLoc10, s0, ra, dwArgE8, dwArg0128, dwArg0168, out a0_102, out a3_103, out a4_104);
	*((word32) a0_17 + 40) = a0_17;
	*((word32) a0_17 + 44) = a0_17;
	*((word32) a0_17 + 64) = a0_17;
	*((word32) a0_17 + 0x0044) = a0_17;
	*((word32) a0_17 + 4) = s1_53;
}

// 2307BFD6: void _event_write.isra.0(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_445636) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
// Called from:
//      event_ioctl
//      event_write
void _event_write.isra.0(Eq_2 ra, Eq_2 s0, struct Eq_445636 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a5_156;
	Eq_2 a4_107;
	Eq_2 s0_121;
	Eq_2 s1_73;
	Eq_2 a3_31;
	Eq_2 a4_32;
	Eq_2 a5_33;
	word32 a0_287;
	word32 s2_288;
	Eq_2 s1_36;
	Eq_2 s4_39;
	word32 s3_108;
	aos_mutex_lock(a0, ~0x00, a2, a3, a4, a5, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_36, out a0_287, out a3_31, out a4_32, out a5_33, out s2_288, out s3_108, out s4_39);
	Eq_2 s2_134 = a2;
	if (a5_33 > 0x00)
	{
		s1_36 = *((word32) a5_33 + 8);
		if (a2 == a5_33)
		{
			s1_73 = *a4_32;
			*((word32) a5_33 + 4) = a4_32;
			*a4_32 = a5_33;
			*((word32) a5_33 + 27) = *((word32) a5_33 + 28);
			a5_156 = (word32) a5_33 - 1;
			goto l2307C012;
		}
	}
	Eq_2 a0_58;
	word32 s1_292;
	word32 a3_293;
	s0_121 = aos_malloc(ra, s1_36, (word32) a2 + 0x0C, a3_31, a4_32, a5_33, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_292, out a0_58, out a3_293, out a4_107, out a5_156, out s2_134, out s3_108, out s4_39);
	s1_73 = a0_58;
	if (a0_58 == 0x00)
		goto l2307C050;
l2307C012:
	Eq_24022 s0_85 = *((word32) a5_156 + 16);
	*((word32) a5_156 + 0x0011) = s0_85;
	*((word32) a2 + 8) = s1_73;
	Eq_2 a0_89 = (word32) s1_73 + 0x0C;
	word32 a1_97;
	word32 a2_98;
	word32 a3_99;
	word32 a7_291;
	word32 a4_289;
	word32 a6_290;
	memcpy(a0_89, s4_39, a2, out a1_97, out a2_98, out a3_99, out a4_289, out a5_156, out a6_290, out a7_291);
	a4_107 = (word32) s0_85 + 20;
	if (s3_108 != 0x00)
	{
		word32 s0_114 = *((word32) a5_156 + 24);
		*((word32) s0_85 + 20) = s1_73;
		*((word32) a5_156 + 4) = s1_73;
		*((word32) s1_73 + 24) = s0_114;
		*s1_73 = a5_156;
	}
	else
	{
		word32 s0_109 = *((word32) a5_156 + 20);
		*((word32) s0_85 + 24) = s1_73;
		*a5_156 = s1_73;
		*((word32) s1_73 + 4) = a5_156;
		*((word32) s1_73 + 20) = s0_109;
	}
	s0_121 = *((word32) a5_156 + 4);
	if (a5_156 != 0x00)
	{
		ui32 a5_124 = (word32) *((word32) s0_85 + 26);
		*((word32) s0_85 + 26) = (word16) (a5_124 | 1);
		(a5_124 | 1)();
	}
l2307C050:
	aos_mutex_unlock(s0_121, a4_107, a5_156, mstatus, s0, ra, dwArgD8, dwArg0118, dwArg0158);
	0x00 = dwArg0128;
}

