pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307C088: void event_ioctl(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_448380) a0, Register int32 a1, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void event_ioctl(Eq_2 ra, Eq_2 s0, struct Eq_448380 * a0, int32 a1, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a3_10;
	Eq_2 a4_11 = 0x01;
	if ((a1 & 0x0F) != 0x01)
	{
		a4_11.u0 = 0x02;
		if ((a1 & 0x0F) != 0x02)
			return;
		a3_10.u0 = 0x01;
	}
	else
		a3_10.u0 = 0x00;
	struct Eq_445636 * a0_17 = a0->ptr0004;
	_event_write.isra.0(ra, s0, a0_17, a1 >> 0x04, a3_10, a4_11, a1 & 0x0F, s3, mstatus, dwArg10, dwArg14, dwArgD8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158);
}

// 2307C0AE: void event_write(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_448417) a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void event_write(Eq_2 ra, Eq_2 s0, struct Eq_448417 * a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	struct Eq_445636 * a0_5 = a0->ptr0004;
	_event_write.isra.0(ra, s0, a0_5, a2, 0x00, a4, a5, s3, mstatus, dwArg10, dwArg14, dwArgD8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158);
}

// 2307C0B6: void event_close(Register (ptr32 Eq_2) s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void event_close(union Eq_2 * s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_448444 * a0_15;
	Eq_2 a4_19;
	Eq_2 a5_20;
	Eq_2 a2_17;
	struct Eq_448444 * s1_27 = aos_mutex_free(s0, a3, a4, mstatus, dwArg0148, dwArg0188, out a0_15, out a2_17, out a4_19, out a5_20) + 20;
	while (true)
	{
		word32 s0_30 = a0_15->dw0018;
		if (a0_15 == s1_27)
			break;
		Eq_2 a0_35 = *((word32) a5_20 + 4);
		*((word32) a5_20 + 4) = a4_19;
		*a4_19 = a5_20;
		word32 t3_116;
		word32 a6_115;
		word32 a3_114;
		aos_free(a0_35, a2_17, a5_20, mstatus, dwArg0148, dwArg0188, out s1_27, out a0_15, out a2_17, out a3_114, out a4_19, out a5_20, out a6_115, out t3_116);
	}
	struct Eq_448444 * s1_53 = s0_30 + 32;
	while (true)
	{
		Eq_2 s0_56 = a0_15->t0024;
		if (a0_15 == s1_53)
			break;
		Eq_2 a0_61 = *((word32) a5_20 + 4);
		*((word32) a5_20 + 4) = a4_19;
		*a4_19 = a5_20;
		word32 a3_117;
		word32 a6_118;
		word32 t3_119;
		aos_free(a0_61, a2_17, a5_20, mstatus, dwArg0148, dwArg0188, out s1_53, out a0_15, out a2_17, out a3_117, out a4_19, out a5_20, out a6_118, out t3_119);
	}
	word32 a2_122;
	word32 a3_123;
	word32 s1_120;
	word32 a0_121;
	word32 a4_124;
	word32 a5_125;
	word32 a6_126;
	word32 t3_127;
	aos_free(s0_56, a2_17, a5_20, mstatus, dwArg0148, dwArg0188, out s1_120, out a0_121, out a2_122, out a3_123, out a4_124, out a5_125, out a6_126, out t3_127);
}

// 2307C108: void event_read(Register (ptr32 Eq_445636) s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void event_read(struct Eq_445636 * s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	if (s0->dw0010 != 0x00)
	{
		Eq_2 a4_32;
		struct Eq_448552 * a5_33;
		Eq_2 s3_38;
		Eq_2 s4_39;
		word32 a3_212;
		word32 s2_213;
		word32 s1_210;
		word32 a0_211;
		aos_mutex_lock(s0, ~0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_210, out a0_211, out a3_212, out a4_32, out a5_33, out s2_213, out s3_38, out s4_39);
		Eq_2 s1_45 = a5_33->t0004;
		a5_33->t0004 = a4_32;
		*a4_32 = a5_33;
		Eq_2 s2_48 = *((word32) s1_45 + 8);
		if (s3_38 < s2_48)
			s2_48 = s3_38;
		Eq_2 a4_103;
		struct Eq_448587 * a5_80;
		int32 a4_56;
		Eq_2 a2_60;
		word32 a3_215;
		word32 a1_214;
		word32 a5_216;
		word32 a6_217;
		word32 a7_218;
		memcpy(s4_39, (word32) s1_45 + 0x0C, s2_48, out a1_214, out a2_60, out a3_215, out a4_56, out a5_216, out a6_217, out a7_218);
		if (a4_56 <= 0x03)
		{
			Eq_2 s0_87 = *(union Eq_2 *) 0x27;
			*((word32) s0_87 + 32) = s1_45;
			*(union Eq_2 *) 0x07 = s1_45;
			*((word32) s1_45 + 36) = s0_87;
			*s1_45 = 0x03;
			*(union Eq_2 *) 0x20 = *(union Eq_2 *) 0x1F;
			a4_103 = (word32) s0_87 + 32;
			a5_80 = (struct Eq_448587 *) 0x04;
		}
		else
		{
			word32 s1_219;
			word32 a0_220;
			word32 a2_221;
			word32 a3_222;
			word32 a6_223;
			word32 t3_224;
			aos_free(s1_45, a2_60, 0x03, mstatus, dwArg0138, dwArg0178, out s1_219, out a0_220, out a2_221, out a3_222, out a4_103, out a5_80, out a6_223, out t3_224);
		}
		Eq_2 s0_98 = a5_80->t0010;
		Eq_2 a5_100 = (char *) a5_80 - 1;
		*((word32) a5_100 + 16) = s0_98;
		aos_mutex_unlock(s0_98, a4_103, a5_100, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
	}
}

// 2307C18E: Register Eq_2 vfs_device_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out ptr32 s6Out)
// Called from:
//      aos_loop_proc
Eq_2 vfs_device_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, ptr32 & s6Out)
{
	if (a5 != 0x01)
	{
		word32 a0_23;
		word32 s0_30;
		word32 * s1_31;
		word32 a5_104;
		word32 s2_105;
		word32 s4_106;
		ra = aos_register_driver(ra, 588006752, 0x00, a3, a4, a5, mstatus, dwArg64, dwArgA4, dwArgD8, dwArg0118, dwArg0158, out s0_30, out s1_31, out a0_23, out a5_104, out s2_105, out s4_106, out s6);
		if (a0_23 == 0x00)
			*s1_31 = s0_30;
	}
	s6Out = s6;
	return ra;
}

