pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307C1CC: void event_read_cb(Register Eq_2 ra, Register word32 s1, Register Eq_2 a0, Register (ptr32 Eq_341835) a4, Stack word32 dwArg24, Stack word32 dwArgC4)
void event_read_cb(Eq_2 ra, word32 s1, Eq_2 a0, struct Eq_341835 * a4, word32 dwArg24, word32 dwArgC4)
{
	uint16 wLoc1C = (uint16) dwLoc1C;
	struct Eq_448692 * sp_3 = fp + ~0x1F;
	word32 a0_14;
	struct Eq_448697 * s0_18;
	word32 a1_20;
	Eq_2 ra_22 = aos_read(ra, a0, fp + ~0x1F, a4, dwLoc20, dwArg24, out s0_18, out a0_14, out a1_20);
	if (a0_14 == 0x10)
	{
		int32 a4_24 = (word32) wLoc1C;
		if (a4_24 == 0x0100)
			(*(<anonymous> *) 0x0100)();
		else
		{
			struct Eq_448697 * a4_27 = s0_18->ptr0004;
			struct Eq_448697 * s1_28 = &g_t4200ECC4;
			for (; s0_18 != s1_28; s0_18 = s0_18->ptr0004)
			{
				struct Eq_448697 * a5_32 = (word32) s0_18->w0010;
				if (a5_32 != null)
				{
					a4_27 = (word32) sp_3->w0004;
					if (a4_27 == a5_32)
						goto l2307C21E;
				}
				else
				{
l2307C21E:
					a5_32();
				}
			}
		}
	}
}

// 2307C22A: Register Eq_2 aos_event_service_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_init
Eq_2 aos_event_service_init(Eq_2 ra, Eq_2 s0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 a0_13;
	struct Eq_448737 * a4_22;
	Eq_2 s3_25;
	Eq_2 s6_30;
	ptr32 mstatus_37;
	word32 s2_133;
	word32 a5_132;
	word32 a3_131;
	word32 a2_130;
	word32 s1_129;
	word32 s0_128;
	Eq_2 ra_38 = aos_open(ra, 588006752, s2, mstatus, s0, ra, dwArg78, dwArgE8, dwArg0128, dwArg0168, out s0_128, out s1_129, out a0_13, out a2_130, out a3_131, out a4_22, out a5_132, out s2_133, out s3_25, out s6_30, out mstatus_37);
	word32 a5_40 = a4_22->dw0004;
	if (a4_22 < null)
		*((word32) a0_13 + 4) = a5_40;
	Eq_2 s0_60;
	ptr32 s2_62;
	Eq_2 a1_69;
	word32 a5_136;
	word32 a4_135;
	word32 a3_134;
	Eq_2 ra_71 = aos_poll_read_fd(ra_38, a0_13, 0x2307C1CC, 0x00, s3_25, s6_30, mstatus_37, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_60, out a1_69, out a3_134, out a4_135, out a5_136, out s2_62);
	aos_loop_set_eventfd(s0_60, a1_69);
	s2Out = s2_62;
	mstatusOut = mstatus_37;
	return ra_71;
}

// 2307C270: Register Eq_2 aos_post_event(Register Eq_2 ra, Register uint32 a0, Register (ptr32 Eq_446) a4, Stack Eq_2 dwArg24, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      cmd_stack_wifi
//      wifi_prov_api_event_trigger_connect
//      wifi_prov_api_event_trigger_disconnect
//      wifi_prov_api_event_trigger_scan
//      wifi_prov_api_event_state_get
//      bl_rx_apm_sta_del_ind
//      bl_rx_apm_sta_add_ind
//      stateConnectingEnter
//      stateDisconnect_action_reconnect
//      stateConnectedIPNoEnter
//      stateGlobalGuard_AP
//      stateGlobalGuard_denoise
//      stateGlobalGuard_stop
//      stateDisconnect_enter
//      stateGlobalGuard_fw_scan
//      stateConnectedIPYes_enter
//      wifi_mgmr_start
//      cb_event_ind
//      ble_sync
Eq_2 aos_post_event(Eq_2 ra, uint32 a0, struct Eq_446 * a4, Eq_2 dwArg24, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out)
{
	ptr32 a0_22;
	ptr32 a3_25;
	ptr32 s0_27;
	word32 a2_45;
	word32 a4_46;
	Eq_2 ra_31 = aos_ioctl(ra, g_t4200ECD0, (a0 >> 0x0F) + 0x0101, fp + ~0x1F, a4, 0x00, dwArg24, out s0_27, out a0_22, out a2_45, out a3_25, out a4_46);
	s0Out = s0_27;
	a0Out = a0_22;
	a3Out = a3_25;
	return ra_31;
}

// 2307C2A4: Register (ptr32 Eq_448814) aos_register_event_filter(Register Eq_2 ra, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_loop_proc
//      wifi_mgmr_start
struct Eq_448814 * aos_register_event_filter(Eq_2 ra, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	if (a1 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		return s1;
	}
	else
	{
		Eq_2 a0_24;
		Eq_2 a3_27;
		struct Eq_448814 * s1_32;
		ptr32 s2_33;
		ptr32 s3_34;
		word32 s4_113;
		word32 a5_112;
		Eq_2 a4_28;
		Eq_2 s0_31 = aos_malloc(ra, a2, 0x14, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_32, out a0_24, out a3_27, out a4_28, out a5_112, out s2_33, out s3_34, out s4_113);
		if (a0_24 != 0x00)
		{
			a4_28 = *a3_27;
			*((word32) s0_31 + 8) = a0_24;
			*((word32) a0_24 + 16) = (word16) s2_33;
			*a3_27 = a0_24;
			s1_32->t000C = a0_24;
			*((word32) a4_28 + 4) = a0_24;
			*((word32) a0_24 + 4) = a3_27;
			*a0_24 = a4_28;
		}
		0x00 = (int8) dwArg38;
		a3Out = a3_27;
		a4Out = a4_28;
		a5Out = a0_24;
		s2Out = s2_33;
		s3Out = s3_34;
		return s1_32;
	}
}

// 2307C2EE: void at_serial_write(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a3, Register (ptr32 Eq_342406) a4, Stack word32 dwArg00, Stack Eq_2 dwArg18, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void at_serial_write(Eq_2 ra, ptr32 a0, Eq_2 a3, struct Eq_342406 * a4, word32 dwArg00, Eq_2 dwArg18, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_2 a5_5 = g_t4201BA0C;
	if (a5_5 < 0x00)
	{
		word32 s1_103;
		word32 a0_104;
		word32 a1_105;
		word32 a2_106;
		word32 a3_107;
		word32 a4_108;
		word32 a5_109;
		word32 a7_110;
		word32 s2_111;
		word32 s3_112;
		word32 s4_113;
		word32 s5_114;
		word32 s6_115;
		word32 s7_116;
		word32 s8_117;
		word32 s9_118;
		word32 s10_119;
		word32 s11_120;
		word32 t4_121;
		printf(ra, &g_t230C4768, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_103, out a0_104, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109, out a7_110, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117, out s9_118, out s10_119, out s11_120, out t4_121);
	}
	else
	{
		word32 t1_122;
		word32 s0_123;
		word32 a0_124;
		word32 a1_125;
		word32 a4_126;
		word32 a5_127;
		aos_write(ra, a5_5, a0, a4, dwArg00, dwArg44, out t1_122, out s0_123, out a0_124, out a1_125, out a4_126, out a5_127);
	}
}

// 2307C31C: void at_serial_read(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a3, Register (ptr32 Eq_341835) a4, Stack Eq_2 dwArg00, Stack Eq_2 dwArg18, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void at_serial_read(Eq_2 ra, ptr32 a0, Eq_2 a3, struct Eq_341835 * a4, Eq_2 dwArg00, Eq_2 dwArg18, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_2 a5_5 = g_t4201BA0C;
	if (a5_5 < 0x00)
	{
		word32 s1_103;
		word32 a0_104;
		word32 a1_105;
		word32 a2_106;
		word32 a3_107;
		word32 a4_108;
		word32 a5_109;
		word32 a7_110;
		word32 s2_111;
		word32 s3_112;
		word32 s4_113;
		word32 s5_114;
		word32 s6_115;
		word32 s7_116;
		word32 s8_117;
		word32 s9_118;
		word32 s10_119;
		word32 s11_120;
		word32 t4_121;
		printf(ra, &g_t230C4768, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_103, out a0_104, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109, out a7_110, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117, out s9_118, out s10_119, out s11_120, out t4_121);
	}
	else
	{
		word32 s0_122;
		word32 a0_123;
		word32 a1_124;
		aos_read(ra, a5_5, a0, a4, dwArg00, dwArg44, out s0_122, out a0_123, out a1_124);
	}
}

// 2307C34A: void at_cmd_exec(Register Eq_2 ra, Register ptr32 mstatus)
void at_cmd_exec(Eq_2 ra, ptr32 mstatus)
{
	at_parse(ra, mstatus);
}

// 2307C360: Register word32 at_serial_cfg_set(Register ptr32 a1, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_365987) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      at_server_init
//      uart_set
word32 at_serial_cfg_set(ptr32 a1, Eq_2 dwArg94, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, struct Eq_365987 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a0_137;
	word32 a6_192;
	word32 a7_193;
	word32 a5_191;
	word32 a1_189;
	word32 a2_190;
	ptr32 a4_142;
	struct Eq_365987 * a3_140;
	memcpy(fp + -32, 588006800, 0x10, out a1_189, out a2_190, out a3_140, out a4_142, out a5_191, out a6_192, out a7_193);
	ptr32 a5_144 = 40000000;
	if ((a1 + -5 & 0x00FF) <= 0x03)
	{
		uint32 a2_50 = (word32) dwArg94 - 1 & 0x00FF;
		if (a2_50 > 0x02 || a3_140 > (struct Eq_365987 *) 0x02)
			goto l2307C3A2;
		a5_144 = 0x01;
		if (a4_142 != 0x01 && a4_142 != 0x00)
		{
			if (a4_142 != 0x02 && a4_142 != 0x03)
				goto l2307C3A2;
		}
		a3_140 = UART_TxFreeRun(0x01, UART_Init(0x01, a2_50, UART_Disable(0x02)));
		UART_Enable(0x01, 0x02, out a4_142, out a5_144);
		a0_137 = 0x00;
l2307C3A4:
		0x00 = (int8) dwArg0128;
		s1Out = a1;
		a0Out = a0_137;
		a3Out = a3_140;
		a4Out = a4_142;
		a5Out = a5_144;
		return dwArgE4;
	}
	else
	{
l2307C3A2:
		a0_137 = 0x04;
		goto l2307C3A4;
	}
}

