pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307C410: Register Eq_2 at_serial_open(Register Eq_2 ra, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      at_server_init
Eq_2 at_serial_open(Eq_2 ra, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a3Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	word32 a0_11;
	ptr32 s0_14;
	ptr32 a3_19;
	ptr32 s3_23;
	ptr32 mstatus_35;
	word32 s1_54;
	word32 a2_55;
	word32 a4_56;
	word32 a5_57;
	word32 s2_58;
	word32 s6_59;
	Eq_2 ra_36 = aos_open(ra, 588007228, s2, mstatus, dwLoc0C, ra, dwArg78, dwArgE8, dwArg0128, dwArg0168, out s0_14, out s1_54, out a0_11, out a2_55, out a3_19, out a4_56, out a5_57, out s2_58, out s3_23, out s6_59, out mstatus_35);
	g_dw4201CA0C = a0_11;
	s0Out = s0_14;
	a3Out = a3_19;
	a5Out = 0x4201C000;
	s3Out = s3_23;
	mstatusOut = mstatus_35;
	return ra_36;
}

// 2307C432: Register Eq_2 at_serial_lock(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      scan
//      tcp_receive_callback
//      udp_receive_callback
Eq_2 at_serial_lock(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a0_15;
	word32 a2_112;
	word32 a4_113;
	Eq_2 a3_21;
	ptr32 s2_18;
	ptr32 s3_25;
	ptr32 s1_24 = xQueueTakeMutexRecursive(s1, g_t4201BA10, ~0x00, a2, a3, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, out a0_15, out a2_112, out a3_21, out a4_113, out s2_18, out s3_25);
	ptr32 a4_29 = 0x01;
	if (a0_15 != 0x01)
	{
		word32 a0_114;
		word32 a1_115;
		word32 a2_116;
		word32 a5_117;
		word32 a7_118;
		word32 s4_119;
		word32 s5_120;
		word32 s6_121;
		word32 s7_122;
		word32 s8_123;
		word32 s9_124;
		word32 s10_125;
		word32 s11_126;
		word32 t4_127;
		ra = printf(ra, &g_t230C471C, a3_21, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_24, out a0_114, out a1_115, out a2_116, out a3_21, out a4_29, out a5_117, out a7_118, out s2_18, out s3_25, out s4_119, out s5_120, out s6_121, out s7_122, out s8_123, out s9_124, out s10_125, out s11_126, out t4_127);
	}
	s1Out = s1_24;
	a2Out = dwArg10;
	a3Out = a3_21;
	a4Out = a4_29;
	s2Out = s2_18;
	s3Out = s3_25;
	return ra;
}

// 2307C462: Register Eq_2 at_serial_unlock(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      scan
//      tcp_receive_callback
//      udp_receive_callback
Eq_2 at_serial_unlock(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 a0_11;
	word32 a2_116;
	word32 a4_117;
	word32 a5_118;
	word32 s2_119;
	word32 s5_120;
	word32 s6_121;
	Eq_2 a3_14;
	ptr32 s3_21;
	ptr32 s4_22;
	xQueueGiveMutexRecursive(g_t4201BA10, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_11, out a2_116, out a3_14, out a4_117, out a5_118, out s2_119, out s3_21, out s4_22, out s5_120, out s6_121);
	ptr32 a4_33 = 0x01;
	ptr32 a5_34 = 0x00;
	if (a0_11 != 0x01)
	{
		word32 s1_122;
		word32 a0_123;
		word32 a1_124;
		word32 a2_125;
		word32 a5_126;
		word32 a7_127;
		word32 s2_128;
		word32 s5_129;
		word32 s6_130;
		word32 s7_131;
		word32 s8_132;
		word32 s9_133;
		word32 s10_134;
		word32 s11_135;
		word32 t4_136;
		ra = printf(ra, &g_t230C4748, a3_14, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_122, out a0_123, out a1_124, out a2_125, out a3_14, out a4_33, out a5_126, out a7_127, out s2_128, out s3_21, out s4_22, out s5_129, out s6_130, out s7_131, out s8_132, out s9_133, out s10_134, out s11_135, out t4_136);
		a5_34 = ~0x00;
	}
	a0Out = a5_34;
	a2Out = dwArg10;
	a3Out = a3_14;
	a4Out = a4_33;
	a5Out = a5_34;
	s3Out = s3_21;
	s4Out = s4_22;
	return ra;
}

// 2307C490: Register Eq_2 at_data_output(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_449258) s1Out, Register out (ptr32 Eq_449258) a0Out, Register out ptr32 a2Out, Register out (ptr32 word32) a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      cb_altcp_recv_fn
//      tcp_receive_callback
//      udp_receive_callback
Eq_2 at_data_output(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0138, struct Eq_449258 & s1Out, struct Eq_449258 & a0Out, ptr32 & a2Out, word32 & a3Out, ptr32 & a4Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 s4_100;
	Eq_2 ra_151;
	ptr32 a4_146;
	word32 * a3_145;
	struct Eq_449258 * s1_108;
	word32 s0_11 = *((word32) a0 + 0x0C);
	word32 a0_23;
	word32 a2_24;
	word32 s2_26;
	Eq_2 a3_29;
	word32 a4_30;
	word32 s3_185;
	ptr32 s1_32 = xQueueTakeMutexRecursive(a0, a0, ~0x00, a2, a3, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, out a0_23, out a2_24, out a3_29, out a4_30, out s2_26, out s3_185);
	if (a0_23 != 0x01)
	{
		word32 s1_193;
		word32 a0_194;
		word32 a1_195;
		word32 a2_196;
		word32 a5_197;
		word32 a7_198;
		word32 s2_199;
		word32 s3_200;
		word32 s5_201;
		word32 s6_202;
		word32 s7_203;
		word32 s8_204;
		word32 s9_205;
		word32 s10_206;
		word32 s11_207;
		word32 t4_208;
		ra_151 = printf(ra, &g_t230C471C, a3_29, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_193, out a0_194, out a1_195, out a2_196, out a3_145, out a4_146, out a5_197, out a7_198, out s2_199, out s3_200, out s4_100, out s5_201, out s6_202, out s7_203, out s8_204, out s9_205, out s10_206, out s11_207, out t4_208);
		s1_108 = (struct Eq_449258 *) ~0x00;
	}
	else
	{
		<anonymous> * a5_39 = g_ptr42027948;
		struct Eq_449359 * sp_42;
		Eq_2 a0_45;
		Eq_2 a4_53;
		word32 t1_130;
		word32 t5_132;
		word32 t6_133;
		a5_39();
		word32 a0_186;
		word32 a2_187;
		word32 a5_188;
		word32 s2_189;
		word32 s3_190;
		word32 s5_191;
		word32 s6_192;
		s1_108 = xQueueGiveMutexRecursive(a0_45, a4_53, mstatus, sp_42->t0014, sp_42->t0038, sp_42->t0094, sp_42->t0108, sp_42->t0148, sp_42->t0188, out a0_186, out a2_187, out a3_145, out a4_146, out a5_188, out s2_189, out s3_190, out s4_100, out s5_191, out s6_192);
	}
	0x00 = dwArg38;
	s1Out = s1_108;
	a0Out = s1_108;
	a2Out = dwArg10;
	a3Out = a3_145;
	a4Out = a4_146;
	s4Out = s4_100;
	mstatusOut = mstatus;
	return ra_151;
}

// 2307C4E8: Register Eq_2 at_key_value_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      cwjap_cur
//      cwmode_cur
//      uart_set
//      setautoconnect_handler
//      scan_handler_opt
//      echo_on_handler
Eq_2 at_key_value_set(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 s6_166;
	Eq_2 s5_165;
	Eq_2 s4_164;
	Eq_2 s3_163;
	Eq_2 s2_162;
	Eq_2 ra_189;
	Eq_2 s0_185;
	struct Eq_274 * a1_278;
	word32 a2_543;
	word32 a3_544;
	word32 a5_546;
	word32 a4_545;
	word32 t1_540;
	word32 a1_542;
	word32 a0_541;
	Eq_2 ra_23 = memset(ra, fp + -84, 0x00, 65, out t1_540, out a0_541, out a1_542, out a2_543, out a3_544, out a4_545, out a5_546);
	word32 a5_551;
	word32 a1_547;
	word32 a2_548;
	word32 a4_550;
	word32 a3_549;
	if (strcmp(a0, 587897308, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551) == 0x00)
	{
		g_dw4201CA04 = (word32) *a1;
		goto l2307C51C;
	}
	word32 a4_555;
	word32 a5_556;
	word32 a1_552;
	word32 a3_554;
	word32 a2_553;
	if (strcmp(a0, 587897332, out a1_552, out a2_553, out a3_554, out a4_555, out a5_556) != 0x00)
	{
		word32 a4_571;
		word32 a5_572;
		word32 a1_568;
		word32 a3_570;
		word32 a2_569;
		if (strcmp(a0, 0x230A9A00, out a1_568, out a2_569, out a3_570, out a4_571, out a5_572) == 0x00)
			goto l2307C53A;
		word32 a5_577;
		word32 a4_576;
		word32 a3_575;
		word32 a2_574;
		word32 a1_573;
		if (strcmp(a0, 587897320, out a1_573, out a2_574, out a3_575, out a4_576, out a5_577) == 0x00)
		{
			byte * s1_203;
			Eq_2 s4_208;
			word32 s9_594;
			word32 s10_595;
			word32 s11_596;
			word32 s5_590;
			word32 s6_591;
			word32 s8_593;
			word32 s7_592;
			word32 a4_586;
			word32 a5_587;
			word32 s3_589;
			word32 s2_588;
			word32 a2_585;
			word32 a1_584;
			word32 a0_583;
			Eq_2 ra_201 = sprintf(ra_23, fp + -84, &g_t230C7894, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_185, out s1_203, out a0_583, out a1_584, out a2_585, out a4_586, out a5_587, out s2_588, out s3_589, out s4_208, out s5_590, out s6_591, out s7_592, out s8_593, out s9_594, out s10_595, out s11_596);
			if ((word32) *s1_203 != 0x00)
			{
				word32 s1_598;
				ra_189 = wifi_mgmr_sta_autoconnect_enable(ra_201, s4_208, mstatus, dwLoc58, dwLoc30, dwLoc2C, dwLoc08, dwArg04, dwArg1C, dwArg20, dwArg24, s1, dwArg78, dwArg98, dwArgB8, dwArgD8, out s1_598, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out mstatus);
			}
			else
			{
				word32 s1_597;
				ra_189 = wifi_mgmr_sta_autoconnect_disable(ra_201, s4_208, mstatus, dwLoc58, dwLoc30, dwLoc2C, dwLoc08, dwArg04, dwArg1C, dwArg20, dwArg24, s1, dwArg78, dwArg98, dwArgB8, dwArgD8, out s1_597, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out mstatus);
			}
		}
		else
		{
			word32 a4_581;
			word32 a5_582;
			word32 a1_578;
			word32 a3_580;
			word32 a2_579;
			if (strcmp(a0, 0x230C4700, out a1_578, out a2_579, out a3_580, out a4_581, out a5_582) != 0x00)
			{
				word32 a4_602;
				word32 a5_603;
				word32 a1_599;
				word32 a3_601;
				word32 a2_600;
				if (strcmp(a0, 587986180, out a1_599, out a2_600, out a3_601, out a4_602, out a5_603) != 0x00)
				{
					word32 a2_618;
					word32 a3_619;
					word32 a5_621;
					word32 a4_620;
					word32 a1_617;
					if (strcmp(a0, 587986188, out a1_617, out a2_618, out a3_619, out a4_620, out a5_621) != 0x00)
					{
						word32 a5_626;
						word32 a1_622;
						word32 a2_623;
						word32 a4_625;
						word32 a3_624;
						if (strcmp(a0, 587986184, out a1_622, out a2_623, out a3_624, out a4_625, out a5_626) != 0x00)
						{
							word32 a4_630;
							word32 a5_631;
							word32 a1_627;
							word32 a3_629;
							word32 a2_628;
							if (strcmp(a0, 588007180, out a1_627, out a2_628, out a3_629, out a4_630, out a5_631) != 0x00)
							{
								word32 a3_634;
								word32 a5_636;
								word32 a4_635;
								word32 a2_633;
								word32 a1_632;
								if (strcmp(a0, 588007188, out a1_632, out a2_633, out a3_634, out a4_635, out a5_636) != 0x00)
								{
l2307C51C:
									a1_278 = (struct Eq_274 *) &g_t230C7894;
l2307C544:
									word32 s11_567;
									word32 s7_563;
									word32 s8_564;
									word32 s10_566;
									word32 s9_565;
									word32 a1_559;
									word32 a2_560;
									word32 a5_562;
									word32 a4_561;
									word32 a0_558;
									word32 s1_557;
									ra_189 = sprintf(ra_23, fp + -84, a1_278, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_185, out s1_557, out a0_558, out a1_559, out a2_560, out a4_561, out a5_562, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out s7_563, out s8_564, out s9_565, out s10_566, out s11_567);
									goto l2307C588;
								}
							}
						}
					}
				}
				goto l2307C53A;
			}
			Eq_2 a0_150;
			Eq_2 a2_152;
			struct Eq_446 * a4_154;
			word32 s9_610;
			word32 s10_611;
			word32 s11_612;
			word32 a1_606;
			word32 a5_607;
			word32 s8_609;
			word32 s7_608;
			word32 s1_605;
			word32 s0_604;
			Eq_2 ra_157 = sprintf(ra_23, fp + -84, &g_t230C7894, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_604, out s1_605, out a0_150, out a1_606, out a2_152, out a4_154, out a5_607, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out s7_608, out s8_609, out s9_610, out s10_611, out s11_612);
			a4_154->dw0004 = 0x4201BA04;
			word32 a2_614;
			word32 a3_615;
			word32 a4_616;
			word32 a0_613;
			ra_189 = aos_ioctl(ra_157, a0_150, 0x03, a2_152, a4_154, dwLoc60, dwLoc1C, out s0_185, out a0_613, out a2_614, out a3_615, out a4_616);
		}
l2307C588:
		ptr32 s0_344;
		ptr32 s1_345;
		ptr32 s4_350;
		Eq_2 ra_343 = ef_set_env(ra_189, s0_185, fp + -84, s2_162, s3_163, s4_164, s5_165, s6_166, mstatus, dwLoc60, dwLoc5C, dwLoc58, dwLoc54, dwLoc50, dwLoc4C, dwLoc48, dwLoc38, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc14, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, s1, dwArg58, dwArg68, dwArg88, dwArgC8, dwArg0108, out s0_344, out s1_345, out s4_350);
		s0Out = s0_344;
		s1Out = s1_345;
		a0Out = 0x00;
		s4Out = s4_350;
		mstatusOut = mstatus;
		return ra_343;
	}
	else
	{
l2307C53A:
		a1_278 = (struct Eq_274 *) &g_t230C6978;
		goto l2307C544;
	}
}

// 2307C632: Register Eq_2 at_key_value_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      event_cb_wifi_event
//      at_server_init
//      cwmode_cur_get
//      uart_get
//      scan
//      set_apcfg
//      cwjap_cur
//      cwmode_cur
//      setautoconnect_handler
//      scan_handler_opt
//      echo_on_handler
//      join_ap_handler
Eq_2 at_key_value_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 a1, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgE8, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	if (a1 == 0x00)
	{
		s1Out = s1;
		a0Out.u0 = ~0x00;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ra;
	}
	union Eq_2 * a5_136;
	ptr32 a4_135;
	Eq_2 a0_157;
	ptr32 a3_100;
	Eq_2 a0_18;
	Eq_2 s1_27;
	Eq_2 s3_31;
	ptr32 s4_32;
	Eq_2 ra_26 = ef_get_env(ra, a0, s3, mstatus, s0, dwArg08, dwArg38, dwArg50, dwArg54, dwArg68, dwArg78, dwArg9C, dwArgA8, dwArgE8, out s1_27, out a0_18, out s3_31, out s4_32);
	if (a0_18 != 0x00)
	{
		word32 a5_484;
		word32 a4_483;
		word32 a2_482;
		word32 a1_481;
		if (strcmp(a0, 587897332, out a1_481, out a2_482, out a3_100, out a4_483, out a5_484) != 0x00)
		{
			word32 a2_491;
			word32 a5_493;
			word32 a4_492;
			word32 a1_490;
			if (strcmp(a0, 0x230A9A00, out a1_490, out a2_491, out a3_100, out a4_492, out a5_493) != 0x00)
			{
				word32 a2_501;
				word32 a5_503;
				word32 a4_502;
				word32 a1_500;
				if (strcmp(a0, 587986180, out a1_500, out a2_501, out a3_100, out a4_502, out a5_503) != 0x00)
				{
					word32 a1_504;
					word32 a4_506;
					word32 a5_507;
					word32 a2_505;
					if (strcmp(a0, 587986188, out a1_504, out a2_505, out a3_100, out a4_506, out a5_507) != 0x00)
					{
						word32 a2_509;
						word32 a5_511;
						word32 a4_510;
						word32 a1_508;
						if (strcmp(a0, 587986184, out a1_508, out a2_509, out a3_100, out a4_510, out a5_511) != 0x00)
						{
							word32 a4_514;
							word32 a5_515;
							word32 a2_513;
							word32 a1_512;
							if (strcmp(a0, 588007180, out a1_512, out a2_513, out a3_100, out a4_514, out a5_515) != 0x00)
							{
								word32 a5_519;
								word32 a1_516;
								word32 a4_518;
								word32 a2_517;
								if (strcmp(a0, 588007188, out a1_516, out a2_517, out a3_100, out a4_518, out a5_519) != 0x00)
								{
									word32 a2_521;
									word32 a1_520;
									*atoi(a0_18, out a1_520, out a2_521, out a3_100, out a4_135, out a5_136) = s1_27;
									goto l2307C6D8;
								}
							}
						}
					}
				}
			}
		}
		strcpy(s1_27, a0_18, out a4_135, out a5_136);
		goto l2307C6D8;
	}
	else
	{
		word32 a2_486;
		word32 a5_487;
		word32 a1_485;
		a0_157 = strcmp(a0, 587897308, out a1_485, out a2_486, out a3_100, out a4_135, out a5_487);
		if (a0_157 == 0x00)
		{
			a5_136 = g_ptr4201BA04;
			*s1_27 = (byte) a5_136;
			goto l2307C6EE;
		}
		word32 a2_489;
		word32 a1_488;
		a0_157 = strcmp(a0, 0x230A9A00, out a1_488, out a2_489, out a3_100, out a4_135, out a5_136);
		if (a0_157 == 0x00)
		{
			*s1_27 = 0x00;
			goto l2307C6EE;
		}
		word32 a1_494;
		word32 a5_496;
		word32 a2_495;
		a0_157 = strcmp(a0, 0x230C4700, out a1_494, out a2_495, out a3_100, out a4_135, out a5_496);
		if (a0_157 == 0x00)
		{
			a5_136 = g_ptr4201BA08;
			goto l2307C69A;
		}
		word32 a5_499;
		word32 a2_498;
		word32 a1_497;
		a0_157 = strcmp(a0, 0x230C46E0, out a1_497, out a2_498, out a3_100, out a4_135, out a5_499);
		a5_136 = (union Eq_2 *) 0x08;
		if (a0_157 == 0x00)
			goto l2307C69A;
		word32 a2_523;
		word32 a5_524;
		word32 a1_522;
		a0_157 = strcmp(a0, 588007144, out a1_522, out a2_523, out a3_100, out a4_135, out a5_524);
		if (a0_157 == 0x00)
		{
			a5_136 = (union Eq_2 *) 0x01;
l2307C69A:
			*a5_136 = (union Eq_2 *) s1_27;
			goto l2307C6EE;
		}
		word32 a1_525;
		word32 a2_526;
		if (strcmp(a0, 588007152, out a1_525, out a2_526, out a3_100, out a4_135, out a5_136) != 0x00)
		{
			word32 a2_528;
			word32 a1_527;
			if (strcmp(a0, 588007160, out a1_527, out a2_528, out a3_100, out a4_135, out a5_136) != 0x00)
			{
				a0_157.u0 = ~0x00;
l2307C6EE:
				0x00 = (int8) dwArg38;
				s1Out = s1_27;
				a0Out = a0_157;
				a2Out = dwArg10;
				a3Out = a3_100;
				a4Out = a4_135;
				a5Out = a5_136;
				s2Out = a0_18;
				s3Out = s3_31;
				s4Out = s4_32;
				return ra_26;
			}
		}
		*s1_27 = 0x00;
l2307C6D8:
		a0_157.u0 = 0x00;
		goto l2307C6EE;
	}
}

