pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307C77E: Register Eq_2 at_dump_noend(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_4348) s3Out, Register out ptr32 s4Out, Register out Eq_4350 s5Out, Register out ptr32 s6Out, Register out Eq_4352 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      __usr_at_cmd_demo
//      cipsta_ip_get
//      version
//      ap_sta_get
//      cwjap_info
//      deep_sleep
//      scan
//      reset
//      cb_httpc_headers_done_fn
//      domain_name_resolution
//      base_station_info
//      setautoconnect_handler
//      scan_handler_opt
//      echo_on_handler
//      help_handler
//      ble_sync_mode
//      join_ap_handler
//      at_response
//      at_uart_config_get
//      at_wifi_mode_get
//      tcp_sent_callback
//      tcp_connected_callback
//      tcp_receive_callback
//      udp_send_data
//      tcp_err_callback
//      udp_receive_callback
//      tcp_accept_callback
//      tcp_send_data
//      bl_cipstatus
//      bl_cipstart
//      bl_cipclose
Eq_2 at_dump_noend(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_4348 & s3Out, ptr32 & s4Out, union Eq_4350 & s5Out, ptr32 & s6Out, union Eq_4352 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s9_150;
	Eq_4352 s7_149;
	ptr32 s6_169;
	Eq_4350 s5_168;
	struct Eq_4348 * s3_166;
	Eq_2 s2_165;
	ptr32 s11_147;
	ptr32 s10_146;
	Eq_2 ra_133;
	ptr32 a1_186;
	ptr32 a3_180;
	ptr32 a4_181;
	union Eq_2 * a5_182;
	ptr32 s1_183;
	struct Eq_274 * a0_192;
	Eq_2 s0_11 = *((word32) a0 + 0x0C);
	word32 a0_34;
	struct Eq_274 * s3_44;
	word32 a2_339;
	word32 a4_340;
	word32 s2_341;
	Eq_2 a3_196;
	xQueueTakeMutexRecursive(s1, a0, ~0x00, a2, a3, a4, mstatus, dwLoc4C, dwLoc28, s3, dwArgA8, dwArgE8, out a0_34, out a2_339, out a3_196, out a4_340, out s2_341, out s3_44);
	if (a0_34 != 0x01)
		a0_192 = (struct Eq_274 *) &g_t230C471C;
	else
	{
		word32 a0_55;
		Eq_2 a3_56;
		Eq_2 a5_57;
		Eq_2 s1_61;
		Eq_2 a4_76;
		word32 t0_342;
		word32 s0_343;
		word32 a1_344;
		word32 a2_345;
		word32 a7_346;
		word32 s2_347;
		word32 s3_348;
		word32 s4_349;
		word32 s5_350;
		word32 s6_351;
		word32 s7_352;
		word32 s8_353;
		word32 s9_354;
		word32 s10_355;
		word32 s11_356;
		word32 t4_357;
		ra = vsnprintf(ra, 0x00, 0x00, s3_44, fp + -28, dwLoc08, dwArg18, a3, dwArg60, dwArg64, dwArg88, dwArgAC, out t0_342, out s0_343, out s1_61, out a0_55, out a1_344, out a2_345, out a3_56, out a4_76, out a5_57, out a7_346, out s2_347, out s3_348, out s4_349, out s5_350, out s6_351, out s7_352, out s8_353, out s9_354, out s10_355, out s11_356, out t4_357);
		Eq_2 a0_81;
		Eq_2 a1_82;
		word32 a6_87;
		Eq_485 s1_89;
		struct Eq_274 * s3_91;
		word32 a2_358;
		word32 a4_359;
		word32 a5_360;
		word32 s2_361;
		word32 s4_362;
		word32 s8_363;
		s0_11 = pvPortMalloc(ra, s1_61, a0_55 + 0x0A, a3_56, a4_76, a5_57, mstatus, dwLoc20, dwLoc1C, fp + -28, dwArgD8, dwArg0118, out s1_89, out a0_81, out a1_82, out a2_358, out a3_196, out a4_359, out a5_360, out a6_87, out s2_361, out s3_91, out s4_362, out s8_363);
		if (a0_81 != 0x00)
		{
			word32 a0_100;
			word32 a3_101;
			word32 a7_103;
			word32 s0_105;
			word32 s1_106;
			word32 s2_109;
			word32 s3_110;
			word32 a2_120;
			word32 a4_121;
			word32 t0_364;
			word32 a1_365;
			word32 a5_366;
			word32 s4_367;
			word32 s5_368;
			word32 s6_369;
			word32 s7_370;
			word32 s8_371;
			word32 s9_372;
			word32 s10_373;
			word32 s11_374;
			word32 t4_375;
			Eq_2 ra_104 = vsnprintf(ra, a0_81, a1_82, s3_91, s1_89, dwLoc08, dwArg18, a3, dwArg60, dwArg64, dwArg88, dwArgAC, out t0_364, out s0_105, out s1_106, out a0_100, out a1_365, out a2_120, out a3_101, out a4_121, out a5_366, out a7_103, out s2_109, out s3_110, out s4_367, out s5_368, out s6_369, out s7_370, out s8_371, out s9_372, out s10_373, out s11_374, out t4_375);
			<anonymous> * a5_124 = g_ptr42027948;
			struct Eq_450260 * sp_127;
			Eq_2 a0_130;
			Eq_2 a4_138;
			word32 t1_262;
			word32 t5_263;
			word32 t6_264;
			a5_124();
			Eq_2 a2_158;
			Eq_2 a5_161;
			word32 a0_376;
			word32 a3_377;
			word32 a4_378;
			word32 s4_379;
			xQueueGiveMutexRecursive(a0_130, a4_138, mstatus, sp_127->t0014, sp_127->t0038, sp_127->t0094, sp_127->t0108, sp_127->t0148, sp_127->t0188, out a0_376, out a2_158, out a3_377, out a4_378, out a5_161, out s2_165, out s3_166, out s4_379, out s5_168, out s6_169);
			word32 a0_380;
			word32 a2_381;
			word32 a6_382;
			word32 s4_383;
			word32 t3_384;
			vPortFree(s2_165, a2_158, a5_161, mstatus, sp_127->t0158, sp_127->t0198, out s0_11, out s1_183, out a0_380, out a1_186, out a2_381, out a3_180, out a4_181, out a5_182, out a6_382, out s4_383, out t3_384);
			goto l2307C7BE;
		}
		a0_192 = (struct Eq_274 *) &g_t230C46CC;
	}
	word32 s1_385;
	word32 a0_386;
	word32 a2_387;
	word32 a7_388;
	word32 s4_389;
	word32 s8_390;
	word32 t4_391;
	ra_133 = printf(ra, a0_192, a3_196, dwLoc58, a4, dwArg10, dwArg14, s1, dwArg5C, out s1_385, out a0_386, out a1_186, out a2_387, out a3_180, out a4_181, out a5_182, out a7_388, out s2_165, out s3_166, out s4_389, out s5_168, out s6_169, out s7_149, out s8_390, out s9_150, out s10_146, out s11_147, out t4_391);
	s1_183 = ~0x00;
l2307C7BE:
	s0Out = s0_11;
	s1Out = s1_183;
	a0Out = s1_183;
	a1Out = a1_186;
	a2Out = dwArg0118;
	a3Out = a3_180;
	a4Out = a4_181;
	a5Out = a5_182;
	s2Out = s2_165;
	s3Out = s3_166;
	s4Out = dwArgD4;
	s5Out = s5_168;
	s6Out = s6_169;
	s7Out = s7_149;
	s8Out = dwArgB4;
	s9Out = s9_150;
	s10Out = s10_146;
	s11Out = s11_147;
	mstatusOut = mstatus;
	return ra_133;
}

