pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307C820: void at_async_event(Register word32 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48)
void at_async_event(word32 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48)
{
	do
	{
		up32 a5_50;
		word32 s1_54;
		<anonymous> * s2_55[];
		word32 s3_56;
		word32 s4_57;
		up32 s8_58;
		word32 a2_131;
		word32 a1_130;
		Eq_2 s0_53 = xQueueReceive(a0, fp + -0x00B4, ~0x00, a3, a4, a5, mstatus, dwLoc0108, dwLocEC, dwLoc6C, dwArg08, dwArg48, out s1_54, out a0, out a1_130, out a2_131, out a3, out a4, out a5_50, out s2_55, out s3_56, out s4_57, out s8_58);
		a5 = a5_50 + ~0x00;
	} while (s8_58 < a5_50 + ~0x00);
	<anonymous> * a5_70 = s2_55[a5_50 + ~0x00];
	word32 a0_86;
	word32 mstatus_91;
	word32 a4_92;
	word32 a3_93;
	a5_70();
}

// 2307CA0C: Register Eq_2 at_cmd_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 s3Out)
// Called from:
//      at_server_init
Eq_2 at_cmd_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & s3Out)
{
	Eq_2 a3_38;
	Eq_2 a4_39;
	Eq_2 a5_40;
	Eq_2 ra_41 = at_init(at_queue_init(ra, 0x4201BA18, 0x0400, 0x2307C31C), fp + ~0x17, out a3_38, out a4_39, out a5_40);
	word32 a0_47;
	Eq_2 a3_50;
	ptr32 s3_57;
	ptr32 s1_55 = at_cmd_impl_init(ra_41, a3_38, a4_39, a5_40, mstatus, dwLoc20, 587717210, 587711214, dwArgD8, dwArg0118, dwArg0128, dwArg0158, dwArg0168, out a0_47, out a3_50, out s3_57);
	if (a0_47 == 0x00)
	{
		s1Out = s1_55;
		s3Out = s3_57;
		return ra_41;
	}
	else
	{
		word32 s1_113;
		word32 a0_114;
		word32 a1_115;
		word32 a2_116;
		word32 a3_117;
		word32 a4_118;
		word32 a5_119;
		word32 a7_120;
		word32 s2_121;
		word32 s3_122;
		word32 s4_123;
		word32 s5_124;
		word32 s6_125;
		word32 s7_126;
		word32 s8_127;
		word32 s9_128;
		word32 s10_129;
		word32 s11_130;
		word32 t4_131;
		word32 a0_132;
		word32 s2_133;
		word32 s6_134;
		word32 s7_135;
		word32 s8_136;
		word32 s9_137;
		abort(printf(ra_41, &g_t230C46B4, a3_50, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_113, out a0_114, out a1_115, out a2_116, out a3_117, out a4_118, out a5_119, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127, out s9_128, out s10_129, out s11_130, out t4_131), out a0_132, out s2_133, out s6_134, out s7_135, out s8_136, out s9_137);
	}
}

// 2307CA5E: Register Eq_2 at_server_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
Eq_2 at_server_init(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & mstatusOut)
{
	Eq_2 ra_306;
	Eq_2 a3_37;
	int32 a5_39;
	ptr32 mstatus_42;
	Eq_2 s0_44;
	Eq_2 s3_47;
	word32 a5_950;
	word32 a3_948;
	word32 a4_949;
	word32 t1_944;
	word32 a0_945;
	word32 a1_946;
	word32 a2_947;
	Eq_2 ra_43 = at_serial_open(memset(ra, 0x4201BA04, 0x00, 0x0414, out t1_944, out a0_945, out a1_946, out a2_947, out a3_948, out a4_949, out a5_950), s2, mstatus, dwArg58, dwArgC8, dwArg0108, dwArg0148, out s0_44, out a3_37, out a5_39, out s3_47, out mstatus_42);
	if (a5_39 < 0x00)
	{
		word32 t4_978;
		word32 s11_977;
		word32 s9_975;
		word32 s10_976;
		word32 s7_973;
		word32 s8_974;
		word32 s5_971;
		word32 s6_972;
		word32 s3_969;
		word32 s4_970;
		word32 a7_967;
		word32 s2_968;
		word32 a4_965;
		word32 a5_966;
		word32 a3_964;
		word32 a1_962;
		word32 a2_963;
		word32 s1_960;
		word32 a0_961;
		ra_306 = printf(ra_43, &g_t230C478C, a3_37, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_960, out a0_961, out a1_962, out a2_963, out a3_964, out a4_965, out a5_966, out a7_967, out s2_968, out s3_969, out s4_970, out s5_971, out s6_972, out s7_973, out s8_974, out s9_975, out s10_976, out s11_977, out t4_978);
		goto l2307CAAA;
	}
	int32 a4_68;
	Eq_2 s3_77;
	word32 s4_957;
	word32 s2_956;
	word32 a3_954;
	word32 a5_955;
	word32 a0_952;
	word32 a2_953;
	word32 s1_951;
	Eq_2 ra_72 = at_key_value_get(ra_43, s0_44, 588007332, fp + ~0x13, s3_47, mstatus_42, s2, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_951, out a0_952, out a2_953, out a3_954, out a4_68, out a5_955, out s2_956, out s3_77, out s4_957);
	*(int32 *) 0x42028F44 = a4_68;
	Eq_2 a0_97;
	Eq_2 s3_110;
	word32 s4_959;
	word32 s1_958;
	Eq_2 ra_105 = ef_get_env(ra_72, 587897308, s3_77, mstatus_42, 0x0108, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, s1, dwArg8C, dwArg98, dwArgD8, out s1_958, out a0_97, out s3_110, out s4_959);
	Eq_2 a5_125 = 0x00;
	if (a0_97 != 0x00)
	{
		word32 a5_985;
		word32 a4_984;
		word32 a3_983;
		word32 a2_982;
		word32 a1_981;
		a5_125 = atoi(a0_97, out a1_981, out a2_982, out a3_983, out a4_984, out a5_985);
	}
	Eq_2 a0_179;
	*a5_125 = (word32) s0_44 - 0x05FC;
	Eq_2 a0_151;
	Eq_2 s3_164;
	word32 s4_980;
	word32 s1_979;
	Eq_2 ra_159 = ef_get_env(ra_105, 0x230C4700, s3_110, mstatus_42, 0x0108, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, s1, dwArg8C, dwArg98, dwArgD8, out s1_979, out a0_151, out s3_164, out s4_980);
	if (a0_151 != 0x00)
	{
		word32 a1_986;
		word32 a2_987;
		word32 a3_988;
		word32 a4_989;
		word32 a5_990;
		a0_179 = atoi(a0_151, out a1_986, out a2_987, out a3_988, out a4_989, out a5_990);
	}
	else
		a0_179.u0 = 0x1C000200;
	*((byte) a0_179.u0 + 4) = (word32) s0_44 - 0x05FC;
	Eq_2 s3_218;
	Eq_2 s3_249;
	Eq_2 s3_280;
	word32 s1_1016;
	word32 a0_1017;
	word32 a2_1018;
	word32 a3_1019;
	word32 a4_1020;
	word32 a5_1021;
	word32 s2_1022;
	word32 s4_1023;
	word32 s1_1024;
	word32 a0_1025;
	word32 a2_1026;
	word32 a3_1027;
	word32 a4_1028;
	word32 a5_1029;
	word32 s2_1030;
	word32 s4_1031;
	word32 s1_1032;
	word32 a0_1033;
	word32 a2_1034;
	word32 a3_1035;
	word32 a4_1036;
	word32 a5_1037;
	word32 s2_1038;
	word32 s4_1039;
	word32 s1_1040;
	word32 a0_1041;
	word32 a2_1042;
	word32 a3_1043;
	word32 a4_1044;
	word32 a5_1045;
	word32 s2_1046;
	word32 s3_1047;
	word32 s4_1048;
	ra_306 = at_key_value_get(at_key_value_get(at_key_value_get(at_key_value_get(ra_159, (word32) s0_44 - 0x05FC, 0x230C46E0, fp + ~0x1B, s3_164, mstatus_42, s2, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_1016, out a0_1017, out a2_1018, out a3_1019, out a4_1020, out a5_1021, out s2_1022, out s3_218, out s4_1023), (word32) s0_44 - 0x05FC, 588007144, fp + ~0x1A, s3_218, mstatus_42, s2, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_1024, out a0_1025, out a2_1026, out a3_1027, out a4_1028, out a5_1029, out s2_1030, out s3_249, out s4_1031), (word32) s0_44 - 0x05FC, 588007152, fp + ~0x19, s3_249, mstatus_42, s2, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_1032, out a0_1033, out a2_1034, out a3_1035, out a4_1036, out a5_1037, out s2_1038, out s3_280, out s4_1039), (word32) s0_44 - 0x05FC, 588007160, fp + ~0x18, s3_280, mstatus_42, s2, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_1040, out a0_1041, out a2_1042, out a3_1043, out a4_1044, out a5_1045, out s2_1046, out s3_1047, out s4_1048);
	word32 a0_331;
	Eq_2 a3_334;
	Eq_2 a4_335;
	Eq_2 a5_336;
	word32 s1_1049;
	word32 s0_339 = at_serial_cfg_set(0x08, dwArg74, dwArg0108, out s1_1049, out a0_331, out a3_334, out a4_335, out a5_336);
	if (a0_331 == 0x00)
	{
		Eq_2 a2_617;
		Eq_2 a3_618;
		Eq_2 a4_619;
		struct Eq_341941 * s2_536;
		Eq_2 a0_615;
		Eq_2 a3_354;
		Eq_2 a4_355;
		Eq_2 a5_356;
		struct Eq_450722 * a0_365;
		word32 a1_991;
		word32 s2_992;
		word32 s3_993;
		xQueueCreateMutex(ra_306, a3_334, a4_335, a5_336, mstatus_42, dwLoc10, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out a0_365, out a1_991, out a3_354, out a4_355, out a5_356, out s2_992, out s3_993);
		a0_365->dw000C = s0_339;
		if (a0_365 == null)
		{
			word32 s1_1002;
			word32 a1_1003;
			word32 a5_1004;
			word32 a7_1005;
			word32 s3_1006;
			word32 s4_1007;
			word32 s5_1008;
			word32 s6_1009;
			word32 s7_1010;
			word32 s8_1011;
			word32 s9_1012;
			word32 s10_1013;
			word32 s11_1014;
			word32 t4_1015;
			ra_306 = printf(ra_306, &g_t230C47B0, a3_354, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_1002, out a0_615, out a1_1003, out a2_617, out a3_618, out a4_619, out a5_1004, out a7_1005, out s2_536, out s3_1006, out s4_1007, out s5_1008, out s6_1009, out s7_1010, out s8_1011, out s9_1012, out s10_1013, out s11_1014, out t4_1015);
			goto l2307CB72;
		}
		Eq_2 a3_575;
		Eq_2 a4_576;
		Eq_2 a0_572;
		struct Eq_450749 * a0_378;
		Eq_2 a3_381;
		word32 s1_994;
		word32 a1_995;
		word32 a2_996;
		word32 a4_997;
		word32 a5_998;
		word32 s2_999;
		word32 s3_1000;
		word32 s4_1001;
		a0_378->ptr0010 = xQueueGenericCreate(ra_306, 0x04, 0x1C, a3_354, a4_355, a5_356, mstatus_42, dwArg00, dwArg04, dwArgF8, dwArg0138, out s1_994, out a0_378, out a1_995, out a2_996, out a3_381, out a4_997, out a5_998, out s2_999, out s3_1000, out s4_1001);
		if (a0_378 == null)
		{
			word32 s1_1054;
			word32 a1_1055;
			word32 a2_1056;
			word32 a5_1057;
			word32 a7_1058;
			word32 s3_1059;
			word32 s4_1060;
			word32 s5_1061;
			word32 s6_1062;
			word32 s7_1063;
			word32 s8_1064;
			word32 s9_1065;
			word32 s10_1066;
			word32 s11_1067;
			word32 t4_1068;
			ra_306 = printf(ra_306, &g_t230C47D0, a3_381, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_1054, out a0_572, out a1_1055, out a2_1056, out a3_575, out a4_576, out a5_1057, out a7_1058, out s2_536, out s3_1059, out s4_1060, out s5_1061, out s6_1062, out s7_1063, out s8_1064, out s9_1065, out s10_1066, out s11_1067, out t4_1068);
			goto l2307CB9C;
		}
		Eq_2 a3_530;
		Eq_2 a4_531;
		Eq_2 a0_527;
		Eq_2 s1_404;
		Eq_2 s3_406;
		word32 a0_426;
		Eq_2 a3_429;
		Eq_2 s1_434;
		Eq_2 s3_436;
		word32 a2_1050;
		word32 a4_1051;
		word32 a5_1052;
		word32 s2_1053;
		Eq_2 ra_444 = xTaskCreate(at_cmd_init(ra_306, mstatus_42, s2, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out s1_404, out s3_406), s1_404, 0x0100, 0x00, 0x03, fp + ~0x17, s3_406, mstatus_42, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_434, out a0_426, out a2_1050, out a3_429, out a4_1051, out a5_1052, out s2_1053, out s3_436);
		if (a0_426 != 0x01)
		{
			word32 s1_1080;
			word32 a1_1081;
			word32 a2_1082;
			word32 a5_1083;
			word32 a7_1084;
			word32 s3_1085;
			word32 s4_1086;
			word32 s5_1087;
			word32 s6_1088;
			word32 s7_1089;
			word32 s8_1090;
			word32 s9_1091;
			word32 s10_1092;
			word32 s11_1093;
			word32 t4_1094;
			ra_306 = printf(ra_444, &g_t230C47FC, a3_429, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_1080, out a0_527, out a1_1081, out a2_1082, out a3_530, out a4_531, out a5_1083, out a7_1084, out s2_536, out s3_1085, out s4_1086, out s5_1087, out s6_1088, out s7_1089, out s8_1090, out s9_1091, out s10_1092, out s11_1093, out t4_1094);
			goto l2307CBDA;
		}
		word32 a0_457;
		Eq_2 a3_460;
		word32 s2_466;
		word32 s1_1075;
		word32 a2_1076;
		word32 a4_1077;
		word32 a5_1078;
		word32 s3_1079;
		Eq_2 ra_475 = xTaskCreate(ra_444, s1_434, 0x0600, 0x00, 0x00, 0x00, s3_436, mstatus_42, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_1075, out a0_457, out a2_1076, out a3_460, out a4_1077, out a5_1078, out s2_466, out s3_1079);
		if (a0_457 != s2_466)
		{
			Eq_2 a0_504;
			Eq_2 a5_505;
			Eq_2 a2_508;
			Eq_2 a3_509;
			Eq_2 a4_510;
			word32 s1_1118;
			word32 a1_1119;
			word32 a7_1120;
			word32 s2_1121;
			word32 s3_1122;
			word32 s4_1123;
			word32 s5_1124;
			word32 s6_1125;
			word32 s7_1126;
			word32 s8_1127;
			word32 s9_1128;
			word32 s10_1129;
			word32 s11_1130;
			word32 t4_1131;
			ra_306 = printf(ra_475, &g_t230C482C, a3_460, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_1118, out a0_504, out a1_1119, out a2_508, out a3_509, out a4_510, out a5_505, out a7_1120, out s2_1121, out s3_1122, out s4_1123, out s5_1124, out s6_1125, out s7_1126, out s8_1127, out s9_1128, out s10_1129, out s11_1130, out t4_1131);
			word32 a5_1132;
			vTaskDelete(a0_504, a2_508, a3_509, a4_510, a5_505, mstatus_42, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a0_527, out a3_530, out a4_531, out a5_1132, out s2_536);
l2307CBDA:
			word32 s1_1133;
			word32 a1_1134;
			word32 a2_1135;
			word32 a5_1136;
			word32 s4_1137;
			vQueueDelete(a0_527, a3_530, a4_531, mstatus_42, dwArg0138, dwArg0178, out s1_1133, out a0_572, out a1_1134, out a2_1135, out a3_575, out a4_576, out a5_1136, out s4_1137);
l2307CB9C:
			word32 s1_1095;
			word32 a1_1096;
			word32 a5_1097;
			word32 s4_1098;
			vQueueDelete(a0_572, a3_575, a4_576, mstatus_42, dwArg0138, dwArg0178, out s1_1095, out a0_615, out a1_1096, out a2_617, out a3_618, out a4_619, out a5_1097, out s4_1098);
l2307CB72:
			word32 a2_1069;
			word32 a4_1070;
			word32 a5_1071;
			word32 s2_1072;
			word32 s3_1073;
			word32 s6_1074;
			aos_close(ra_306, a0_615, a2_617, a3_618, a4_619, s2_536, mstatus_42, dwArg18, out a2_1069, out a4_1070, out a5_1071, out s2_1072, out s3_1073, out s6_1074);
l2307CAAA:
			goto l2307CAAC;
		}
		word32 s1_1099;
		word32 a0_1100;
		word32 a1_1101;
		word32 a2_1102;
		word32 a3_1103;
		word32 a4_1104;
		word32 a5_1105;
		word32 a7_1106;
		word32 s2_1107;
		word32 s3_1108;
		word32 s4_1109;
		word32 s5_1110;
		word32 s6_1111;
		word32 s7_1112;
		word32 s8_1113;
		word32 s9_1114;
		word32 s10_1115;
		word32 s11_1116;
		word32 t4_1117;
		ra_306 = printf(ra_475, &g_t230C484C, a3_460, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_1099, out a0_1100, out a1_1101, out a2_1102, out a3_1103, out a4_1104, out a5_1105, out a7_1106, out s2_1107, out s3_1108, out s4_1109, out s5_1110, out s6_1111, out s7_1112, out s8_1113, out s9_1114, out s10_1115, out s11_1116, out t4_1117);
	}
l2307CAAC:
	mstatusOut = mstatus_42;
	return ra_306;
}

// 2307CC2A: Register Eq_2 at_server_notify_with_ctx(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a3Out)
// Called from:
//      blsync_disconnected
//      blsync_connected
//      at_server_notify
Eq_2 at_server_notify_with_ctx(Eq_2 ra, Eq_2 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a3Out)
{
	word32 t1_137;
	word32 a0_138;
	word32 a1_139;
	word32 a2_140;
	word32 a4_141;
	word32 a5_142;
	ptr32 a3_106;
	Eq_2 ra_27 = memset(ra, fp + -44, 0x00, 0x1C, out t1_137, out a0_138, out a1_139, out a2_140, out a3_106, out a4_141, out a5_142);
	if (a2 <= 0x14)
	{
		Eq_2 a4_37;
		word32 a1_143;
		word32 a2_144;
		word32 a3_145;
		word32 a5_146;
		word32 a6_147;
		word32 a7_148;
		memcpy(fp + -40, a1, a2, out a1_143, out a2_144, out a3_145, out a4_37, out a5_146, out a6_147, out a7_148);
		word32 s1_149;
		word32 a0_150;
		word32 a1_151;
		word32 a2_152;
		word32 a4_153;
		word32 a5_154;
		word32 a7_155;
		word32 s2_156;
		word32 s3_157;
		word32 s4_158;
		word32 s5_159;
		word32 s6_160;
		word32 s8_161;
		xQueueGenericSend(g_t4201BA14, fp + -44, 0x00, a4_37, 0x4201C000, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_149, out a0_150, out a1_151, out a2_152, out a3_106, out a4_153, out a5_154, out a7_155, out s2_156, out s3_157, out s4_158, out s5_159, out s6_160, out s8_161);
	}
	0x00 = (int8) dwArg0128;
	a3Out = a3_106;
	return ra_27;
}

