pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307CC78: void at_server_notify(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void at_server_notify(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	word32 a3_36;
	at_server_notify_with_ctx(ra, 0x00, 0x00, mstatus, dwArg74, dwArgE8, dwArg0128, dwArg0168, out a3_36);
}

// 2307CC80: void cipsta_ip_get(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_665) a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88)
void cipsta_ip_get(Eq_2 ra, Eq_2 s1, struct Eq_665 * a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg88)
{
	wifi_mgmr_sta_ip_get(fp + -0x0088, fp + -0x0084, fp + -0x0080, a4);
	word32 a2_255;
	word32 a3_256;
	word32 a4_257;
	word32 a5_258;
	word32 a4_259;
	word32 a5_260;
	strcpy(fp + -116, ip4addr_ntoa(out a2_255, out a3_256, out a4_257, out a5_258), out a4_259, out a5_260);
	word32 a2_261;
	word32 a3_262;
	word32 a4_263;
	word32 a5_264;
	word32 a4_265;
	word32 a5_266;
	strcpy(fp + -96, ip4addr_ntoa(out a2_261, out a3_262, out a4_263, out a5_264), out a4_265, out a5_266);
	word32 a2_267;
	word32 a3_268;
	word32 a4_269;
	word32 a5_270;
	word32 a4_271;
	word32 a5_272;
	strcpy(fp + -76, ip4addr_ntoa(out a2_267, out a3_268, out a4_269, out a5_270), out a4_271, out a5_272);
	wifi_mgmr_sta_dns_get(fp + -0x007C, fp + -0x0078);
	word32 a2_273;
	word32 a3_274;
	word32 a4_275;
	word32 a5_276;
	word32 a4_277;
	word32 a5_278;
	strcpy(fp + -56, ip4addr_ntoa(out a2_273, out a3_274, out a4_275, out a5_276), out a4_277, out a5_278);
	Eq_2 a2_114;
	Eq_2 a3_115;
	Eq_2 a4_130;
	word32 a4_279;
	word32 a5_280;
	word32 a5_281;
	strcpy(fp + -36, ip4addr_ntoa(out a2_114, out a3_115, out a4_279, out a5_280), out a4_130, out a5_281);
	ptr32 mstatus_145;
	Eq_2 s1_148;
	Eq_2 s3_152;
	Eq_2 a2_175;
	Eq_2 a3_176;
	Eq_2 a4_177;
	ptr32 mstatus_181;
	word32 s0_183;
	Eq_2 s1_184;
	Eq_2 s3_188;
	word32 s0_282;
	word32 a0_283;
	word32 a1_284;
	word32 a2_285;
	word32 a3_286;
	word32 a4_287;
	word32 a5_288;
	word32 s2_289;
	word32 s4_290;
	word32 s5_291;
	word32 s6_292;
	word32 s7_293;
	word32 s8_294;
	word32 s9_295;
	word32 s10_296;
	word32 s11_297;
	word32 a0_298;
	word32 a1_299;
	word32 a5_300;
	word32 s2_301;
	word32 s4_302;
	word32 s5_303;
	word32 s6_304;
	word32 s7_305;
	word32 s8_306;
	word32 s9_307;
	word32 s10_308;
	word32 s11_309;
	word32 s0_310;
	word32 s1_311;
	word32 a0_312;
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a4_316;
	word32 a5_317;
	word32 s2_318;
	word32 s3_319;
	word32 s4_320;
	word32 s5_321;
	word32 s6_322;
	word32 s7_323;
	word32 s8_324;
	word32 s9_325;
	word32 s10_326;
	word32 s11_327;
	word32 mstatus_328;
	at_dump_noend(at_dump_noend(at_dump_noend(ra, s1, 0x230C6900, a2_114, a3_115, a4_130, s3, mstatus, 0x00, dwLoc80, dwLoc7C, dwLoc78, dwLoc34, dwLoc30, dwLoc2C, 0x00, dwArg18, dwArg1C, dwArg48, dwArg58, dwArg88, out s0_282, out s1_148, out a0_283, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288, out s2_289, out s3_152, out s4_290, out s5_291, out s6_292, out s7_293, out s8_294, out s9_295, out s10_296, out s11_297, out mstatus_145), s1_148, 588007044, fp + -96, fp + -76, fp + -56, s3_152, mstatus_145, 0x00, dwLoc80, dwLoc7C, dwLoc78, dwLoc34, dwLoc30, dwLoc2C, 0x00, dwArg18, dwArg1C, dwArg48, dwArg58, dwArg88, out s0_183, out s1_184, out a0_298, out a1_299, out a2_175, out a3_176, out a4_177, out a5_300, out s2_301, out s3_188, out s4_302, out s5_303, out s6_304, out s7_305, out s8_306, out s9_307, out s10_308, out s11_309, out mstatus_181), s1_184, s0_183 + -0x0700, a2_175, a3_176, a4_177, s3_188, mstatus_181, 0x00, dwLoc80, dwLoc7C, dwLoc78, dwLoc34, dwLoc30, dwLoc2C, 0x00, dwArg18, dwArg1C, dwArg48, dwArg58, dwArg88, out s0_310, out s1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out s2_318, out s3_319, out s4_320, out s5_321, out s6_322, out s7_323, out s8_324, out s9_325, out s10_326, out s11_327, out mstatus_328);
}

// 2307CD1C: void version(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108)
void version(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108)
{
	Eq_2 a3_19;
	Eq_2 a4_20;
	ptr32 mstatus_24;
	Eq_2 s1_27;
	Eq_2 s3_31;
	Eq_2 a2_53;
	Eq_2 a3_54;
	Eq_2 a4_55;
	ptr32 mstatus_59;
	word32 s0_61;
	Eq_2 s1_62;
	Eq_2 s3_66;
	Eq_2 a2_83;
	Eq_2 a3_84;
	Eq_2 a4_85;
	ptr32 mstatus_89;
	word32 s0_91;
	Eq_2 s1_92;
	Eq_2 s3_96;
	Eq_2 a2_113;
	Eq_2 a3_114;
	Eq_2 a4_115;
	ptr32 mstatus_119;
	Eq_2 s1_122;
	Eq_2 s3_126;
	Eq_2 a2_144;
	Eq_2 a3_145;
	Eq_2 a4_146;
	ptr32 mstatus_150;
	word32 s0_152;
	Eq_2 s1_153;
	Eq_2 s3_157;
	Eq_2 a2_174;
	Eq_2 a3_175;
	Eq_2 a4_176;
	ptr32 mstatus_180;
	word32 s0_182;
	Eq_2 s1_183;
	Eq_2 s3_187;
	Eq_2 a3_205;
	Eq_2 a4_206;
	ptr32 mstatus_210;
	Eq_2 s1_213;
	Eq_2 s3_217;
	Eq_2 a2_239;
	Eq_2 a3_240;
	Eq_2 a4_241;
	ptr32 mstatus_245;
	word32 s0_247;
	Eq_2 s1_248;
	Eq_2 s3_252;
	word32 s0_315;
	word32 a0_316;
	word32 a1_317;
	word32 a2_318;
	word32 a5_319;
	word32 s2_320;
	word32 s4_321;
	word32 s5_322;
	word32 s6_323;
	word32 s7_324;
	word32 s8_325;
	word32 s9_326;
	word32 s10_327;
	word32 s11_328;
	word32 a0_329;
	word32 a1_330;
	word32 a5_331;
	word32 s2_332;
	word32 s4_333;
	word32 s5_334;
	word32 s6_335;
	word32 s7_336;
	word32 s8_337;
	word32 s9_338;
	word32 s10_339;
	word32 s11_340;
	word32 a0_341;
	word32 a1_342;
	word32 a5_343;
	word32 s2_344;
	word32 s4_345;
	word32 s5_346;
	word32 s6_347;
	word32 s7_348;
	word32 s8_349;
	word32 s9_350;
	word32 s10_351;
	word32 s11_352;
	word32 s0_353;
	word32 a0_354;
	word32 a1_355;
	word32 a5_356;
	word32 s2_357;
	word32 s4_358;
	word32 s5_359;
	word32 s6_360;
	word32 s7_361;
	word32 s8_362;
	word32 s9_363;
	word32 s10_364;
	word32 s11_365;
	word32 a0_366;
	word32 a1_367;
	word32 a5_368;
	word32 s2_369;
	word32 s4_370;
	word32 s5_371;
	word32 s6_372;
	word32 s7_373;
	word32 s8_374;
	word32 s9_375;
	word32 s10_376;
	word32 s11_377;
	word32 a0_378;
	word32 a1_379;
	word32 a5_380;
	word32 s2_381;
	word32 s4_382;
	word32 s5_383;
	word32 s6_384;
	word32 s7_385;
	word32 s8_386;
	word32 s9_387;
	word32 s10_388;
	word32 s11_389;
	word32 s0_390;
	word32 a0_391;
	word32 a1_392;
	word32 a2_393;
	word32 a5_394;
	word32 s2_395;
	word32 s4_396;
	word32 s5_397;
	word32 s6_398;
	word32 s7_399;
	word32 s8_400;
	word32 s9_401;
	word32 s10_402;
	word32 s11_403;
	word32 a0_404;
	word32 a1_405;
	word32 a5_406;
	word32 s2_407;
	word32 s4_408;
	word32 s5_409;
	word32 s6_410;
	word32 s7_411;
	word32 s8_412;
	word32 s9_413;
	word32 s10_414;
	word32 s11_415;
	word32 s0_416;
	word32 s1_417;
	word32 a0_418;
	word32 a1_419;
	word32 a2_420;
	word32 a3_421;
	word32 a4_422;
	word32 a5_423;
	word32 s2_424;
	word32 s3_425;
	word32 s4_426;
	word32 s5_427;
	word32 s6_428;
	word32 s7_429;
	word32 s8_430;
	word32 s9_431;
	word32 s10_432;
	word32 s11_433;
	word32 mstatus_434;
	at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(at_dump_noend(ra, s1, 0x230C6900, a2, a3, a4, s3, mstatus, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_315, out s1_27, out a0_316, out a1_317, out a2_318, out a3_19, out a4_20, out a5_319, out s2_320, out s3_31, out s4_321, out s5_322, out s6_323, out s7_324, out s8_325, out s9_326, out s10_327, out s11_328, out mstatus_24), s1_27, 588008376, 587896904, a3_19, a4_20, s3_31, mstatus_24, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_61, out s1_62, out a0_329, out a1_330, out a2_53, out a3_54, out a4_55, out a5_331, out s2_332, out s3_66, out s4_333, out s5_334, out s6_335, out s7_336, out s8_337, out s9_338, out s10_339, out s11_340, out mstatus_59), s1_62, s0_61 + -0x0700, a2_53, a3_54, a4_55, s3_66, mstatus_59, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_91, out s1_92, out a0_341, out a1_342, out a2_83, out a3_84, out a4_85, out a5_343, out s2_344, out s3_96, out s4_345, out s5_346, out s6_347, out s7_348, out s8_349, out s9_350, out s10_351, out s11_352, out mstatus_89), s1_92, s0_91 + -0x0700, a2_83, a3_84, a4_85, s3_96, mstatus_89, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_353, out s1_122, out a0_354, out a1_355, out a2_113, out a3_114, out a4_115, out a5_356, out s2_357, out s3_126, out s4_358, out s5_359, out s6_360, out s7_361, out s8_362, out s9_363, out s10_364, out s11_365, out mstatus_119), s1_122, 588008392, a2_113, a3_114, a4_115, s3_126, mstatus_119, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_152, out s1_153, out a0_366, out a1_367, out a2_144, out a3_145, out a4_146, out a5_368, out s2_369, out s3_157, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374, out s9_375, out s10_376, out s11_377, out mstatus_150), s1_153, s0_152 + -0x0700, a2_144, a3_145, a4_146, s3_157, mstatus_150, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_182, out s1_183, out a0_378, out a1_379, out a2_174, out a3_175, out a4_176, out a5_380, out s2_381, out s3_187, out s4_382, out s5_383, out s6_384, out s7_385, out s8_386, out s9_387, out s10_388, out s11_389, out mstatus_180), s1_183, s0_182 + -0x0700, a2_174, a3_175, a4_176, s3_187, mstatus_180, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_390, out s1_213, out a0_391, out a1_392, out a2_393, out a3_205, out a4_206, out a5_394, out s2_395, out s3_217, out s4_396, out s5_397, out s6_398, out s7_399, out s8_400, out s9_401, out s10_402, out s11_403, out mstatus_210), s1_213, 588008472, 588008448, a3_205, a4_206, s3_217, mstatus_210, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_247, out s1_248, out a0_404, out a1_405, out a2_239, out a3_240, out a4_241, out a5_406, out s2_407, out s3_252, out s4_408, out s5_409, out s6_410, out s7_411, out s8_412, out s9_413, out s10_414, out s11_415, out mstatus_245), s1_248, s0_247 + -0x0700, a2_239, a3_240, a4_241, s3_252, mstatus_245, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_416, out s1_417, out a0_418, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out s2_424, out s3_425, out s4_426, out s5_427, out s6_428, out s7_429, out s8_430, out s9_431, out s10_432, out s11_433, out mstatus_434);
}

// 2307CDA4: void cipsta_ip(Register Eq_2 ra, Register (ptr32 Eq_665) a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8)
void cipsta_ip(Eq_2 ra, struct Eq_665 * a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8)
{
	wifi_mgmr_sta_ip_get(fp + -56, fp + -48, fp + -52, a4);
	wifi_mgmr_sta_dns_get(fp + -44, fp + -40);
	word32 s8_677;
	word32 s9_678;
	word32 s10_679;
	word32 s11_680;
	word32 s4_673;
	word32 s5_674;
	word32 s6_675;
	word32 s7_676;
	word32 a2_669;
	word32 a4_670;
	word32 a5_671;
	word32 s3_672;
	word32 s0_665;
	word32 s1_666;
	word32 a0_667;
	word32 a1_668;
	word32 s2_142;
	Eq_2 ra_137 = sprintf(ra, fp + -36, &g_t230C4A4C, s2, dwLoc08, dwArg24, dwArg40, 0x00, dwArg68, dwArg8C, out s0_665, out s1_666, out a0_667, out a1_668, out a2_669, out a4_670, out a5_671, out s2_142, out s3_672, out s4_673, out s5_674, out s6_675, out s7_676, out s8_677, out s9_678, out s10_679, out s11_680);
	word32 a0_681;
	word32 s4_682;
	word32 s8_683;
	Eq_2 a3_157;
	ipaddr_addr(fp + -36, out a0_681, out a3_157, out s4_682, out s8_683);
	word32 s8_690;
	word32 a2_686;
	word32 a4_687;
	word32 a5_688;
	word32 s4_689;
	word32 a1_685;
	word32 a0_684;
	puts(587942188, out a0_684, out a1_685, out a2_686, out a4_687, out a5_688, out s4_689, out s8_690);
	word32 a4_694;
	word32 a5_695;
	word32 s4_696;
	word32 s8_697;
	word32 a0_691;
	word32 a1_692;
	word32 a2_693;
	puts(fp + -36, out a0_691, out a1_692, out a2_693, out a4_694, out a5_695, out s4_696, out s8_697);
	word32 a2_698;
	word32 s4_699;
	word32 s8_700;
	word32 a5_115;
	Eq_2 a0_113;
	Eq_2 a1_117;
	Eq_2 a4_118;
	puts(0x230C6900, out a0_113, out a1_117, out a2_698, out a4_118, out a5_115, out s4_699, out s8_700);
	Eq_2 dwArg44_542 = 0x00;
	Eq_2 dwArg48_544 = 0x00;
	if (a5_115 != 0x00)
	{
		word32 s8_713;
		word32 s9_714;
		word32 s10_715;
		word32 s11_716;
		word32 s4_709;
		word32 s5_710;
		word32 s6_711;
		word32 s7_712;
		word32 a2_705;
		word32 a4_706;
		word32 a5_707;
		word32 s3_708;
		word32 s1_702;
		word32 a0_703;
		word32 a1_704;
		word32 s0_701;
		ra_137 = sprintf(ra_137, fp + -36, s2_142 + -0x05B4, s2, dwLoc08, dwArg24, dwArg40, 0x00, dwArg68, dwArg8C, out s0_701, out s1_702, out a0_703, out a1_704, out a2_705, out a4_706, out a5_707, out s2_142, out s3_708, out s4_709, out s5_710, out s6_711, out s7_712, out s8_713, out s9_714, out s10_715, out s11_716);
		Eq_2 a0_154;
		word32 s8_718;
		word32 s4_717;
		ipaddr_addr(fp + -36, out a0_154, out a3_157, out s4_717, out s8_718);
		word32 a5_723;
		word32 s4_724;
		word32 s8_725;
		word32 a0_719;
		word32 a1_720;
		word32 a2_721;
		word32 a4_722;
		puts(0x230B4934, out a0_719, out a1_720, out a2_721, out a4_722, out a5_723, out s4_724, out s8_725);
		word32 s8_735;
		word32 s4_734;
		word32 a2_733;
		word32 s8_732;
		word32 s4_731;
		word32 a5_730;
		word32 a4_729;
		word32 a2_728;
		word32 a1_727;
		word32 a0_726;
		puts((word32) puts(fp + -36, out a0_726, out a1_727, out a2_728, out a4_729, out a5_730, out s4_731, out s8_732) - 0x0700, out a0_113, out a1_117, out a2_733, out a4_118, out a5_115, out s4_734, out s8_735);
		dwArg44_542 = a0_154;
	}
	if (a5_115 != 0x00)
	{
		word32 s6_746;
		word32 s5_745;
		word32 s4_744;
		word32 s3_743;
		word32 a5_742;
		word32 a4_741;
		word32 a2_740;
		word32 a1_739;
		word32 a0_738;
		word32 s1_737;
		word32 s0_736;
		word32 s7_747;
		word32 s8_748;
		word32 s9_749;
		word32 s10_750;
		word32 s11_751;
		ra_137 = sprintf(ra_137, fp + -36, s2_142 + -0x05B4, s2, dwLoc08, dwArg24, dwArg40, dwArg44_542, dwArg68, dwArg8C, out s0_736, out s1_737, out a0_738, out a1_739, out a2_740, out a4_741, out a5_742, out s2_142, out s3_743, out s4_744, out s5_745, out s6_746, out s7_747, out s8_748, out s9_749, out s10_750, out s11_751);
		word32 a0_752;
		word32 s4_753;
		word32 s8_754;
		ipaddr_addr(fp + -36, out a0_752, out a3_157, out s4_753, out s8_754);
		word32 a0_755;
		word32 a1_756;
		word32 a2_757;
		word32 a4_758;
		word32 a5_759;
		word32 s4_760;
		word32 s8_761;
		puts(0x230B493C, out a0_755, out a1_756, out a2_757, out a4_758, out a5_759, out s4_760, out s8_761);
		word32 a0_762;
		word32 a1_763;
		word32 a2_764;
		word32 a4_765;
		word32 a5_766;
		word32 s4_767;
		word32 s8_768;
		word32 a2_769;
		word32 s4_770;
		word32 s8_771;
		puts((word32) puts(fp + -36, out a0_762, out a1_763, out a2_764, out a4_765, out a5_766, out s4_767, out s8_768) - 0x0700, out a0_113, out a1_117, out a2_769, out a4_118, out a5_115, out s4_770, out s8_771);
	}
	if (a5_115 != 0x00)
	{
		word32 s0_772;
		word32 s1_773;
		word32 a0_774;
		word32 a1_775;
		word32 a2_776;
		word32 a4_777;
		word32 a5_778;
		word32 s3_779;
		word32 s4_780;
		word32 s5_781;
		word32 s6_782;
		word32 s7_783;
		word32 s8_784;
		word32 s9_785;
		word32 s10_786;
		word32 s11_787;
		ra_137 = sprintf(ra_137, fp + -36, s2_142 + -0x05B4, s2, dwLoc08, dwArg24, dwArg40, dwArg44_542, dwArg68, dwArg8C, out s0_772, out s1_773, out a0_774, out a1_775, out a2_776, out a4_777, out a5_778, out s2_142, out s3_779, out s4_780, out s5_781, out s6_782, out s7_783, out s8_784, out s9_785, out s10_786, out s11_787);
		Eq_2 a0_332;
		word32 s4_788;
		word32 s8_789;
		ipaddr_addr(fp + -36, out a0_332, out a3_157, out s4_788, out s8_789);
		word32 a0_790;
		word32 a1_791;
		word32 a2_792;
		word32 a4_793;
		word32 a5_794;
		word32 s4_795;
		word32 s8_796;
		puts(588008024, out a0_790, out a1_791, out a2_792, out a4_793, out a5_794, out s4_795, out s8_796);
		word32 a0_797;
		word32 a1_798;
		word32 a2_799;
		word32 a4_800;
		word32 a5_801;
		word32 s4_802;
		word32 s8_803;
		word32 a2_804;
		word32 s4_805;
		word32 s8_806;
		puts((word32) puts(fp + -36, out a0_797, out a1_798, out a2_799, out a4_800, out a5_801, out s4_802, out s8_803) - 0x0700, out a0_113, out a1_117, out a2_804, out a4_118, out a5_115, out s4_805, out s8_806);
		dwArg48_544 = a0_332;
	}
	if (a5_115 != 0x00)
	{
		word32 s0_807;
		word32 s1_808;
		word32 a0_809;
		word32 a1_810;
		word32 a2_811;
		word32 a4_812;
		word32 a5_813;
		word32 s2_814;
		word32 s3_815;
		word32 s4_816;
		word32 s5_817;
		word32 s6_818;
		word32 s7_819;
		word32 s8_820;
		word32 s9_821;
		word32 s10_822;
		word32 s11_823;
		ra_137 = sprintf(ra_137, fp + -36, s2_142 + -0x05B4, s2, dwLoc08, dwArg24, dwArg40, dwArg44_542, dwArg68, dwArg8C, out s0_807, out s1_808, out a0_809, out a1_810, out a2_811, out a4_812, out a5_813, out s2_814, out s3_815, out s4_816, out s5_817, out s6_818, out s7_819, out s8_820, out s9_821, out s10_822, out s11_823);
		word32 a0_824;
		word32 s4_825;
		word32 s8_826;
		ipaddr_addr(fp + -36, out a0_824, out a3_157, out s4_825, out s8_826);
		word32 a0_827;
		word32 a1_828;
		word32 a2_829;
		word32 a4_830;
		word32 a5_831;
		word32 s4_832;
		word32 s8_833;
		puts(588008036, out a0_827, out a1_828, out a2_829, out a4_830, out a5_831, out s4_832, out s8_833);
		word32 a0_834;
		word32 a1_835;
		word32 a2_836;
		word32 a4_837;
		word32 a5_838;
		word32 s4_839;
		word32 s8_840;
		word32 a2_841;
		word32 a5_842;
		word32 s4_843;
		word32 s8_844;
		puts((word32) puts(fp + -36, out a0_834, out a1_835, out a2_836, out a4_837, out a5_838, out s4_839, out s8_840) - 0x0700, out a0_113, out a1_117, out a2_841, out a4_118, out a5_842, out s4_843, out s8_844);
	}
	wifi_mgmr_sta_ip_set(ra_137, a0_113, a1_117, a3_157, a4_118, mstatus, 0x00, 0x00, dwLoc08, dwArg04, dwArg20, dwArg48_544, null, dwArg78, dwArg98, dwArgB8, dwArgD8);
}

