pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307CF36: void http_url_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void http_url_req(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a5_38 = g_t4200F6D0;
	if (a5_38 == 0x00)
	{
		word32 a0_33;
		word32 * s2_42;
		word32 s4_605;
		word32 a2_603;
		word32 s3_604;
		word32 a1_602;
		xQueueGenericCreate(ra, 0x01, 0x00, a3, a4, a5_38, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out s1, out a0_33, out a1_602, out a2_603, out a3, out a4, out a5_38, out s2_42, out s3_604, out s4_605);
		*s2_42 = a0_33;
	}
	Eq_2 a0_58;
	Eq_2 s2_67;
	word32 s1_592;
	word32 a1_593;
	word32 a2_594;
	word32 a3_595;
	word32 a4_596;
	word32 a5_597;
	word32 s3_599;
	word32 a6_598;
	word32 s8_601;
	word32 s4_600;
	Eq_2 s0_65 = pvPortMalloc(ra, s1, 0x0080, a3, a4, a5_38, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_592, out a0_58, out a1_593, out a2_594, out a3_595, out a4_596, out a5_597, out a6_598, out s2_67, out s3_599, out s4_600, out s8_601);
	if (a0_58 != 0x00)
	{
		word32 a3_610;
		word32 a4_611;
		word32 a5_612;
		word32 a1_608;
		word32 a2_609;
		word32 t1_606;
		word32 a0_607;
		Eq_2 ra_85 = memset(ra, 1107410624, 0x00, 0x1C, out t1_606, out a0_607, out a1_608, out a2_609, out a3_610, out a4_611, out a5_612);
		g_b4201BEC7 = (byte) (word32) *((word32) s0_65 + 0x0088);
		g_b4201BECC = (byte) (word32) *((word32) s0_65 + 0x0089);
		int32 a5_96 = *((word32) s0_65 + 0x008C);
		g_b4201BEC6 = 0x00;
		g_dw4201BEC8 = a5_96;
		g_dw4201BED4 = 587714844;
		g_dw4201BED8 = 0x2307D6C6;
		word32 a5_616;
		word32 a1_613;
		word32 a3_614;
		word32 a4_615;
		word32 a0_107 = strstr(ra_85, s0_65 + 0x08, 588016080, out a1_613, out a3_614, out a4_615, out a5_616);
		Eq_2 s3_116 = a0_107;
		if (a0_107 == 0x00)
			s3_116.u0 = 588016080;
		word32 a4_617;
		word32 a5_618;
		strcpy(a0_58, s0_65 + 0x08, out a4_617, out a5_618);
		Mem129[s3_116 - (s0_65 + 0x08) + a0_58:byte] = 0x00;
		word32 a5_622;
		word32 a1_619;
		word32 a3_620;
		word32 a4_621;
		Eq_2 a0_134 = strstr(ra_85, a0_58, 587959580, out a1_619, out a3_620, out a4_621, out a5_622);
		if (a0_134 != 0x00)
		{
			*a0_134 = 0x00;
			word32 a5_628;
			word32 a2_625;
			word32 a3_626;
			word32 a4_627;
			word32 a1_624;
			atoi((word32) a0_134 + 1, out a1_624, out a2_625, out a3_626, out a4_627, out a5_628);
		}
		Eq_2 a2_215;
		Eq_2 a3_221;
		Eq_2 a5_223;
		Eq_2 a4_222;
		ptr32 mstatus_226;
		union Eq_2 * s2_231;
		Eq_2 a0_164;
		Eq_2 s4_173;
		Eq_2 s8_174;
		word32 a3_623;
		Eq_2 s0_172 = ipaddr_addr(a0_58, out a0_164, out a3_623, out s4_173, out s8_174);
		Eq_2 a1_188 = (word32) (word16) s0_172;
		if (a0_164 != ~0x00)
			a2_215 = httpc_get_file(ra_85, s0_172, a0_58, fp + -36, s3_116, 1107410624, 587714710, s2_67, s3_116, s4_173, 0x4201C000, 0x230C7000, s7, s8_174, s9, mstatus, s6, dwLoc08, dwLoc04, dwArg08, dwArg0C, dwArg18, dwArg38, dwArg3C, dwArg48, dwArg4C, a0_164, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a3_221, out a4_222, out a5_223, out s2_231, out mstatus_226);
		else
			a2_215 = httpc_get_file_dns(ra_85, s0_172, a0_58, a1_188, s3_116, 1107410624, 587714710, 0x4200F6D8, s2_67, 0x4201C000, 0x230C7000, s7, s8_174, s9, mstatus, dwLoc2C, s6, s4, dwLoc18, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg4C, s5, s3, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out a3_221, out a4_222, out a5_223, out s2_231, out mstatus_226);
		word32 a0_290;
		Eq_2 a2_292;
		Eq_2 a3_293;
		Eq_2 a4_294;
		Eq_2 s1_298;
		union Eq_2 * s2_299;
		word32 s3_658;
		word32 s4_659;
		word32 s8_660;
		word32 a1_656;
		word32 a5_657;
		xQueueSemaphoreTake(*s2_231, 0x02000710, a2_215, a3_221, a4_222, a5_223, mstatus_226, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_298, out a0_290, out a1_656, out a2_292, out a3_293, out a4_294, out a5_657, out s2_299, out s3_658, out s4_659, out s8_660);
		if (a0_290 != 0x01)
		{
			Eq_2 a2_323;
			Eq_2 a5_326;
			Eq_2 s1_329;
			word32 a4_643;
			word32 s4_644;
			word32 a0_640;
			word32 a1_641;
			word32 a3_642;
			vQueueDelete(*s2_299, a3_293, a4_294, mstatus_226, dwArg0128, dwArg0168, out s1_329, out a0_640, out a1_641, out a2_323, out a3_642, out a4_643, out a5_326, out s4_644);
			*s2_299 = (union Eq_2 *) 0x00;
			word32 t3_655;
			word32 a5_652;
			word32 a6_653;
			word32 s4_654;
			word32 a2_649;
			word32 a3_650;
			word32 a4_651;
			word32 s1_646;
			word32 a0_647;
			word32 a1_648;
			word32 s0_645;
			vPortFree(s1_329, a2_323, a5_326, mstatus_226, dwArg0128, dwArg0168, out s0_645, out s1_646, out a0_647, out a1_648, out a2_649, out a3_650, out a4_651, out a5_652, out a6_653, out s4_654, out t3_655);
		}
		else
		{
			word32 a6_637;
			word32 s4_638;
			word32 t3_639;
			word32 a3_634;
			word32 a4_635;
			word32 a5_636;
			word32 a0_631;
			word32 a1_632;
			word32 a2_633;
			word32 s0_629;
			word32 s1_630;
			vPortFree(s1_298, a2_292, 0x01, mstatus_226, dwArg0128, dwArg0168, out s0_629, out s1_630, out a0_631, out a1_632, out a2_633, out a3_634, out a4_635, out a5_636, out a6_637, out s4_638, out t3_639);
		}
	}
	0x00 = (int8) dwArg0128;
}

// 2307D096: void cb_altcp_recv_fn(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register int32 a1, Register Eq_2 a2, Register (ptr32 Eq_452954) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void cb_altcp_recv_fn(Eq_2 ra, Eq_2 s0, Eq_2 a0, int32 a1, Eq_2 a2, struct Eq_452954 * a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg28, word32 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	Eq_2 a4_100 = a5->t0000;
	a5->t0001 = a4_100;
	Eq_2 s1_16 = a0;
	Eq_2 a3_131 = &a5->t0001;
	Eq_2 a5_21 = a5 & 63;
	Eq_2 s0_124 = a2;
	if ((a5 & 63) == 0x00)
	{
		word32 a0_242;
		word32 s8_244;
		word32 a1_243;
		s1_16 = puts(0x230C6900, out a0_242, out a1_243, out a2, out a4_100, out a5_21, out s4, out s8_244);
	}
	word32 a5_44;
	Eq_2 a0_42 = altcp_recved(a1, a5_21, out a5_44);
	if (s1_16 != 0x00)
	{
		s0_124 = *((word32) a0_42 + 4);
		if (a5_44 == 0x00 && (word32) (*((word32) s0_124 + 8)) != 0x00)
		{
			word32 a0_263;
			word32 s1_262;
			word32 a2_264;
			ra = at_data_output(ra, a0_42, a2, &a5->t0001, a4_100, mstatus, s0, dwArg08, dwArg18, dwArg28, dwArg50, dwArg54, ra, dwArg78, dwArg9C, dwArgE8, dwArg0128, out s1_262, out a0_263, out a2_264, out a3_131, out a4_100, out s4, out mstatus);
		}
		else
		{
			Eq_2 a5_53;
			Eq_2 a1_54;
			word32 a2_261;
			Eq_2 a0_50 = strlen(a0_42, out a1_54, out a2_261, out a3_131, out a4_100, out a5_53);
			if (a5_53 >= a0_50)
			{
				if (a0_50 != 0x00)
				{
					s0_124 = *((word32) a1_54 + 4);
					word32 a5_281;
					strcpy(a0_50, a1_54, out a4_100, out a5_281);
				}
			}
			else
			{
				word32 s1_265;
				word32 a0_266;
				word32 a1_267;
				word32 a5_269;
				word32 a2_268;
				word32 a7_270;
				word32 s2_271;
				word32 s3_272;
				word32 s5_273;
				word32 s6_274;
				word32 s7_275;
				word32 s8_276;
				word32 s9_277;
				word32 s10_278;
				word32 s11_279;
				word32 t4_280;
				ra = printf(ra, &g_r230C49B8, a3_131, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_265, out a0_266, out a1_267, out a2_268, out a3_131, out a4_100, out a5_269, out a7_270, out s2_271, out s3_272, out s4, out s5_273, out s6_274, out s7_275, out s8_276, out s9_277, out s10_278, out s11_279, out t4_280);
			}
		}
	}
	word32 mstatus_260;
	word32 s6_258;
	word32 s8_259;
	word32 s5_257;
	word32 s4_256;
	word32 s3_255;
	word32 s2_254;
	word32 a7_253;
	word32 a5_252;
	word32 a4_251;
	word32 a3_250;
	word32 s0_245;
	word32 s1_246;
	word32 a1_248;
	word32 a0_247;
	word32 a2_249;
	pbuf_free(ra, s0_124, a3_131, a4_100, s4, mstatus, dwArg0118, out s0_245, out s1_246, out a0_247, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252, out a7_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s8_259, out mstatus_260);
	0x00 = dwArg38;
}

// 2307D11C: void cb_httpc_result(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void cb_httpc_result(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a4_17;
	word32 a3_119;
	word32 a2_118;
	word32 a1_117;
	word32 a0_116;
	word32 s1_115;
	word32 a5_120;
	word32 a7_121;
	word32 s2_122;
	word32 s3_123;
	word32 s4_124;
	word32 s5_125;
	word32 s6_126;
	word32 s7_127;
	word32 s8_128;
	word32 s9_129;
	word32 s10_130;
	word32 s11_131;
	word32 t4_132;
	printf(ra, &g_t230C4A10, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_115, out a0_116, out a1_117, out a2_118, out a3_119, out a4_17, out a5_120, out a7_121, out s2_122, out s3_123, out s4_124, out s5_125, out s6_126, out s7_127, out s8_128, out s9_129, out s10_130, out s11_131, out t4_132);
	Eq_2 a0_34 = g_t4200F6D0;
	if (a0_34 == 0x00)
		return;
	word32 s1_133;
	word32 a0_134;
	word32 a1_135;
	word32 a2_136;
	word32 a3_137;
	word32 a4_138;
	word32 a5_139;
	word32 a7_140;
	word32 s2_141;
	word32 s3_142;
	word32 s4_143;
	word32 s5_144;
	word32 s6_145;
	word32 s8_146;
	xQueueGenericSend(a0_34, 0x00, 0x00, a4_17, 0x4200F000, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_133, out a0_134, out a1_135, out a2_136, out a3_137, out a4_138, out a5_139, out a7_140, out s2_141, out s3_142, out s4_143, out s5_144, out s6_145, out s8_146);
}

// 2307D14C: void ap_sta_get(Register Eq_2 ra, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8)
void ap_sta_get(Eq_2 ra, Eq_2 s2, word32 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8)
{
	wifi_mgmr_ap_sta_cnt_get(fp + -61);
	wifi_mgmr_ap_ip_get(fp + -60, fp + -56, fp + -52);
	Eq_2 dwLoc40_332 = (uint32) nLoc40;
	Eq_2 a2_31;
	Eq_2 a3_32;
	Eq_2 a4_33;
	Eq_2 s3_40;
	ptr32 mstatus_61;
	Eq_2 s1_64;
	Eq_2 s3_68;
	Eq_2 a2_112;
	Eq_2 a3_113;
	Eq_2 a4_114;
	ptr32 mstatus_118;
	Eq_2 s1_121;
	Eq_2 s3_125;
	word32 a0_451;
	word32 s4_458;
	word32 s5_459;
	word32 a5_456;
	word32 s2_457;
	word32 a3_454;
	word32 a4_455;
	word32 a2_453;
	word32 a1_452;
	word32 s0_450;
	word32 s6_460;
	word32 s7_461;
	word32 s8_462;
	word32 s9_463;
	word32 s10_464;
	word32 s11_465;
	word32 a2_466;
	word32 a3_467;
	word32 a4_468;
	word32 a5_469;
	word32 s0_470;
	word32 a0_471;
	word32 a1_472;
	word32 a5_473;
	word32 s2_474;
	word32 s4_475;
	word32 s5_476;
	word32 s6_477;
	word32 s7_478;
	word32 s8_479;
	word32 s9_480;
	word32 s10_481;
	word32 s11_482;
	word32 s0_483;
	word32 s1_484;
	word32 a0_485;
	word32 a1_486;
	word32 a2_487;
	word32 a3_488;
	word32 a4_489;
	word32 a5_490;
	word32 s2_491;
	word32 s4_492;
	word32 s5_493;
	word32 s6_494;
	word32 s7_495;
	word32 s8_496;
	word32 s9_497;
	word32 s10_498;
	word32 s11_499;
	Eq_2 s3_155;
	ptr32 mstatus_148;
	Eq_2 ra_149 = at_dump_noend(at_dump_noend(at_dump_noend(wifi_mgmr_ap_mac_get(ra, fp + -48, s2, s3, s4, out a2_31, out a3_32, out a4_33, out s3_40), 0x230C7000, 0x230C6900, a2_31, a3_32, a4_33, s3_40, mstatus, dwLoc4C, dwLoc40_332, dwLoc3C, dwLoc38, dwArg0C, dwArg10, dwArg14, 0x00, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_450, out s1_64, out a0_451, out a1_452, out a2_453, out a3_454, out a4_455, out a5_456, out s2_457, out s3_68, out s4_458, out s5_459, out s6_460, out s7_461, out s8_462, out s9_463, out s10_464, out s11_465, out mstatus_61), s1_64, 588007556, ip4addr_ntoa(out a2_466, out a3_467, out a4_468, out a5_469), (word32) (byte) s2, (word32) SLICE(s2, byte, 8), s3_68, mstatus_61, dwLoc4C, dwLoc40_332, dwLoc3C, dwLoc38, dwArg0C, dwArg10, dwArg14, 0x00, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_470, out s1_121, out a0_471, out a1_472, out a2_112, out a3_113, out a4_114, out a5_473, out s2_474, out s3_125, out s4_475, out s5_476, out s6_477, out s7_478, out s8_479, out s9_480, out s10_481, out s11_482, out mstatus_118), s1_121, (word32) s1_121 - 0x0700, a2_112, a3_113, a4_114, s3_125, mstatus_118, dwLoc4C, dwLoc40_332, dwLoc3C, dwLoc38, dwArg0C, dwArg10, dwArg14, 0x00, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_483, out s1_484, out a0_485, out a1_486, out a2_487, out a3_488, out a4_489, out a5_490, out s2_491, out s3_155, out s4_492, out s5_493, out s6_494, out s7_495, out s8_496, out s9_497, out s10_498, out s11_499, out mstatus_148);
	Eq_2 s0_169 = 0x00;
	while (true)
	{
		Eq_2 dwLoc40_355 = (uint32) nLoc40;
		if (s0_169 >= 0x00)
			break;
		Eq_2 a2_180;
		Eq_2 a3_181;
		Eq_2 a4_182;
		Eq_2 s1_188;
		word32 s4_500;
		word32 s0_187;
		ra_149 = wifi_mgmr_ap_sta_info_get(ra_149, s0_169, out s0_187, out s1_188, out a2_180, out a3_181, out a4_182, out s4_500);
		if ((word32) bLoc27 != 0x00)
		{
			ptr32 mstatus_210;
			Eq_2 s1_213;
			word32 s2_216;
			Eq_2 s3_217;
			Eq_2 a2_243;
			Eq_2 a3_244;
			Eq_2 a4_245;
			ptr32 mstatus_249;
			Eq_2 s1_252;
			Eq_2 s3_256;
			word32 s0_501;
			word32 a0_502;
			word32 a1_503;
			word32 a2_504;
			word32 a3_505;
			word32 a4_506;
			word32 a5_507;
			word32 s4_508;
			word32 s5_509;
			word32 s6_510;
			word32 s7_511;
			word32 s8_512;
			word32 s9_513;
			word32 s10_514;
			word32 s11_515;
			word32 s0_516;
			word32 a0_517;
			word32 a1_518;
			word32 a5_519;
			word32 s2_520;
			word32 s4_521;
			word32 s5_522;
			word32 s6_523;
			word32 s7_524;
			word32 s8_525;
			word32 s9_526;
			word32 s10_527;
			word32 s11_528;
			word32 s1_529;
			word32 a0_530;
			word32 a1_531;
			word32 a2_532;
			word32 a3_533;
			word32 a4_534;
			word32 a5_535;
			word32 s2_536;
			word32 s4_537;
			word32 s5_538;
			word32 s6_539;
			word32 s7_540;
			word32 s8_541;
			word32 s9_542;
			word32 s10_543;
			word32 s11_544;
			ra_149 = at_dump_noend(at_dump_noend(at_dump_noend(ra_149, s1_188, (word32) s1_188 - 0x0700, a2_180, a3_181, a4_182, s3_155, mstatus_148, dwLoc4C, dwLoc40_355, dwLoc3C, dwLoc38, dwArg0C, dwArg10, dwArg14, 0x00, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_501, out s1_213, out a0_502, out a1_503, out a2_504, out a3_505, out a4_506, out a5_507, out s2_216, out s3_217, out s4_508, out s5_509, out s6_510, out s7_511, out s8_512, out s9_513, out s10_514, out s11_515, out mstatus_210), s1_213, s2_216 + -1868, (word32) bLoc26, (word32) bLoc25, (word32) bLoc24, s3_217, mstatus_210, dwLoc4C, dwLoc40_355, dwLoc3C, dwLoc38, dwArg0C, dwArg10, dwArg14, 0x00, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_516, out s1_252, out a0_517, out a1_518, out a2_243, out a3_244, out a4_245, out a5_519, out s2_520, out s3_256, out s4_521, out s5_522, out s6_523, out s7_524, out s8_525, out s9_526, out s10_527, out s11_528, out mstatus_249), s1_252, (word32) s1_252 - 0x0700, a2_243, a3_244, a4_245, s3_256, mstatus_249, dwLoc4C, dwLoc40_355, dwLoc3C, dwLoc38, dwArg0C, dwArg10, dwArg14, 0x00, dwArg58, dwArg5C, dwArg88, dwArg98, dwArgC8, out s0_187, out s1_529, out a0_530, out a1_531, out a2_532, out a3_533, out a4_534, out a5_535, out s2_536, out s3_155, out s4_537, out s5_538, out s6_539, out s7_540, out s8_541, out s9_542, out s10_543, out s11_544, out mstatus_148);
		}
		s0_169 = s0_187 + 0x01 & 0x00FF;
	}
}

// 2307D22C: void cwmode_cur_get(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8)
void cwmode_cur_get(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8)
{
	word32 s1_55;
	word32 a0_56;
	word32 a2_57;
	word32 a3_58;
	word32 a4_59;
	word32 a5_60;
	word32 s2_61;
	word32 s3_62;
	word32 s4_63;
	at_key_value_get(ra, s0, 587897308, a0 + 8, s3, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, dwArg68, dwArg8C, dwArg98, dwArgD8, out s1_55, out a0_56, out a2_57, out a3_58, out a4_59, out a5_60, out s2_61, out s3_62, out s4_63);
}

// 2307D248: void uart_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8)
void uart_get(Eq_2 ra, Eq_2 a0, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8)
{
	Eq_2 s3_28;
	Eq_2 s3_59;
	Eq_2 s3_90;
	Eq_2 s3_121;
	word32 s1_183;
	word32 a0_184;
	word32 a2_185;
	word32 a3_186;
	word32 a4_187;
	word32 a5_188;
	word32 s2_189;
	word32 s4_190;
	word32 s1_191;
	word32 a0_192;
	word32 a2_193;
	word32 a3_194;
	word32 a4_195;
	word32 a5_196;
	word32 s2_197;
	word32 s4_198;
	word32 s1_199;
	word32 a0_200;
	word32 a2_201;
	word32 a3_202;
	word32 a4_203;
	word32 a5_204;
	word32 s2_205;
	word32 s4_206;
	word32 s1_207;
	word32 a0_208;
	word32 a2_209;
	word32 a3_210;
	word32 a4_211;
	word32 a5_212;
	word32 s2_213;
	word32 s4_214;
	word32 s1_215;
	word32 a0_216;
	word32 a2_217;
	word32 a3_218;
	word32 a4_219;
	word32 a5_220;
	word32 s2_221;
	word32 s3_222;
	word32 s4_223;
	at_key_value_get(at_key_value_get(at_key_value_get(at_key_value_get(at_key_value_get(ra, a0, 0x230C4700, (word32) a0 + 0x0C, s3, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, dwArg68, dwArg8C, dwArg98, dwArgD8, out s1_183, out a0_184, out a2_185, out a3_186, out a4_187, out a5_188, out s2_189, out s3_28, out s4_190), a0, 0x230C46E0, (word32) a0 + 16, s3_28, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, dwArg68, dwArg8C, dwArg98, dwArgD8, out s1_191, out a0_192, out a2_193, out a3_194, out a4_195, out a5_196, out s2_197, out s3_59, out s4_198), a0, 588007144, (word32) a0 + 24, s3_59, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, dwArg68, dwArg8C, dwArg98, dwArgD8, out s1_199, out a0_200, out a2_201, out a3_202, out a4_203, out a5_204, out s2_205, out s3_90, out s4_206), a0, 588007152, (word32) a0 + 20, s3_90, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, dwArg68, dwArg8C, dwArg98, dwArgD8, out s1_207, out a0_208, out a2_209, out a3_210, out a4_211, out a5_212, out s2_213, out s3_121, out s4_214), a0, 588007160, (word32) a0 + 28, s3_121, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg58, dwArg68, dwArg8C, dwArg98, dwArgD8, out s1_215, out a0_216, out a2_217, out a3_218, out a4_219, out a5_220, out s2_221, out s3_222, out s4_223);
}

