pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307D2AA: void cwqap(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void cwqap(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a2_10;
	Eq_2 a3_11;
	Eq_2 a4_12;
	Eq_2 a5_13;
	ptr32 mstatus_16;
	Eq_2 ra_17 = wifi_mgmr_sta_disconnect(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a2_10, out a3_11, out a4_12, out a5_13, out mstatus_16);
	Eq_2 s4_48;
	word32 s1_101;
	word32 a0_102;
	word32 a1_103;
	word32 a2_104;
	word32 a3_105;
	word32 a4_106;
	word32 a5_107;
	word32 s2_108;
	word32 s3_109;
	vTaskDelay(1000, a2_10, a3_11, a4_12, a5_13, mstatus_16, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_101, out a0_102, out a1_103, out a2_104, out a3_105, out a4_106, out a5_107, out s2_108, out s3_109, out s4_48);
	word32 s4_110;
	word32 mstatus_111;
	wifi_mgmr_sta_disable(ra_17, s4_48, mstatus_16, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s4_110, out mstatus_111);
}

// 2307D2C8: void cwjap_info(Register Eq_2 ra, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg94, Stack word32 dwArgF4)
void cwjap_info(Eq_2 ra, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg94, word32 dwArgF4)
{
	word32 a5_310;
	word32 a4_309;
	word32 a3_308;
	word32 a2_307;
	word32 a1_306;
	word32 a0_305;
	word32 t1_304;
	Eq_2 ra_17 = memset(ra, fp + -0x00C0, 0x00, 0x00AE, out t1_304, out a0_305, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310);
	up32 a5_28;
	word32 a4_311;
	Eq_2 a3_26 = wifi_mgmr_state_get(fp + -0x00D0, out a4_311, out a5_28);
	if (a5_28 <= ~0x03)
	{
		struct Eq_665 * a4_38;
		ra_17 = wifi_mgmr_sta_connect_ind_stat_get(ra_17, fp + -0x00C0, s2, dwLocF8, dwLocD8, dwLocB0, dwLocAC, dwLoc90, dwLoc8C, dwLoc88, 0x00, 0x00, dwLoc44, out a3_26, out a4_38);
		wifi_mgmr_sta_ip_get(fp + -0x00CC, fp + -200, fp + -0x00C4, a4_38);
	}
	Eq_2 a2_77;
	Eq_2 a3_78;
	Eq_2 a4_79;
	Eq_2 s1_82;
	Eq_2 s3_86;
	ptr32 mstatus_107;
	Eq_2 s1_110;
	Eq_2 s3_114;
	word32 s2_333;
	word32 a5_332;
	word32 a4_331;
	word32 a3_330;
	word32 a2_329;
	word32 a1_328;
	word32 a0_327;
	word32 s0_326;
	word32 t4_325;
	word32 s11_324;
	word32 s10_323;
	word32 s9_322;
	word32 s8_321;
	word32 s7_320;
	word32 s6_319;
	word32 s5_318;
	word32 s4_317;
	word32 s2_316;
	word32 a7_315;
	word32 a5_314;
	word32 a1_313;
	word32 a0_312;
	word32 s4_334;
	word32 s5_335;
	word32 s6_336;
	word32 s7_337;
	word32 s8_338;
	word32 s9_339;
	word32 s10_340;
	word32 s11_341;
	Eq_2 ra_108 = at_dump_noend(printf(ra_17, &g_t230C4A84, a3_26, dwLocF8, dwLocD8, dwLoc90, dwLoc8C, 0x00, dwLoc44, out s1_82, out a0_312, out a1_313, out a2_77, out a3_78, out a4_79, out a5_314, out a7_315, out s2_316, out s3_86, out s4_317, out s5_318, out s6_319, out s7_320, out s8_321, out s9_322, out s10_323, out s11_324, out t4_325), s1_82, 0x230C6900, a2_77, a3_78, a4_79, s3_86, mstatus, dwLocFC, dwLocF0, dwLocEC, dwLocE8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc58, dwLoc54, dwLoc28, dwLoc18, dwArg18, out s0_326, out s1_110, out a0_327, out a1_328, out a2_329, out a3_330, out a4_331, out a5_332, out s2_333, out s3_114, out s4_334, out s5_335, out s6_336, out s7_337, out s8_338, out s9_339, out s10_340, out s11_341, out mstatus_107);
	Eq_2 a3_144;
	Eq_2 a4_145;
	word32 a2_342;
	word32 a5_343;
	ip4addr_ntoa(out a2_342, out a3_144, out a4_145, out a5_343);
	0x00 = dwArgF4;
	Eq_2 a3_129 = (word32) bLoc1B;
	Eq_2 a5_131 = (word32) bLoc19;
	Eq_2 a2_167;
	Eq_2 a3_168;
	Eq_2 a4_169;
	ptr32 mstatus_173;
	word32 s0_175;
	Eq_2 s1_176;
	Eq_2 s3_180;
	word32 a0_344;
	word32 a1_345;
	word32 a5_346;
	word32 s2_347;
	word32 s4_348;
	word32 s5_349;
	word32 s6_350;
	word32 s7_351;
	word32 s8_352;
	word32 s9_353;
	word32 s10_354;
	word32 s11_355;
	word32 s0_356;
	word32 s1_357;
	word32 a0_358;
	word32 a1_359;
	word32 a2_360;
	word32 a3_361;
	word32 a4_362;
	word32 a5_363;
	word32 s2_364;
	word32 s3_365;
	word32 s4_366;
	word32 s5_367;
	word32 s6_368;
	word32 s7_369;
	word32 s8_370;
	word32 s9_371;
	word32 s10_372;
	word32 s11_373;
	word32 mstatus_374;
	at_dump_noend(at_dump_noend(ra_108, s1_110, 588008108, dwArg94, a3_144, a4_145, s3_114, mstatus_107, dwLocFC, a5_131, a3_129, dwLocE8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc58, dwLoc54, dwLoc28, dwLoc18, dwArg18, out s0_175, out s1_176, out a0_344, out a1_345, out a2_167, out a3_168, out a4_169, out a5_346, out s2_347, out s3_180, out s4_348, out s5_349, out s6_350, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355, out mstatus_173), s1_176, s0_175 + -0x0700, a2_167, a3_168, a4_169, s3_180, mstatus_173, dwLocFC, a5_131, a3_129, dwLocE8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc58, dwLoc54, dwLoc28, dwLoc18, dwArg18, out s0_356, out s1_357, out a0_358, out a1_359, out a2_360, out a3_361, out a4_362, out a5_363, out s2_364, out s3_365, out s4_366, out s5_367, out s6_368, out s7_369, out s8_370, out s9_371, out s10_372, out s11_373, out mstatus_374);
}

// 2307D374: void deep_sleep(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_454064) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void deep_sleep(Eq_2 ra, Eq_2 s1, struct Eq_454064 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (((word32) a0->b000C + ~0x06 & 0x00FF) <= 0x01)
	{
		Eq_2 a2_24;
		Eq_2 a3_25;
		Eq_2 a4_26;
		Eq_2 s1_31;
		Eq_2 s3_33;
		Eq_2 a2_54;
		Eq_2 a3_55;
		Eq_2 a4_56;
		ptr32 mstatus_60;
		Eq_2 s1_63;
		Eq_2 s3_67;
		Eq_2 a2_85;
		Eq_2 a3_86;
		Eq_2 a4_87;
		ptr32 mstatus_91;
		word32 s0_93;
		Eq_2 s1_94;
		Eq_2 s3_98;
		Eq_2 a2_115;
		Eq_2 a3_116;
		Eq_2 a4_117;
		Eq_2 a5_118;
		ptr32 mstatus_121;
		word32 s0_340;
		word32 a0_341;
		word32 a1_342;
		word32 a5_343;
		word32 s2_344;
		word32 s4_345;
		word32 s5_346;
		word32 s6_347;
		word32 s7_348;
		word32 s8_349;
		word32 s9_350;
		word32 s10_351;
		word32 s11_352;
		word32 a0_353;
		word32 a1_354;
		word32 a5_355;
		word32 s2_356;
		word32 s4_357;
		word32 s5_358;
		word32 s6_359;
		word32 s7_360;
		word32 s8_361;
		word32 s9_362;
		word32 s10_363;
		word32 s11_364;
		word32 s0_365;
		word32 s1_366;
		word32 a0_367;
		word32 a1_368;
		word32 s2_369;
		word32 s3_370;
		word32 s4_371;
		word32 s5_372;
		word32 s6_373;
		word32 s7_374;
		word32 s8_375;
		word32 s9_376;
		word32 s10_377;
		word32 s11_378;
		Eq_2 ra_122 = at_dump_noend(at_dump_noend(at_dump_noend(hal_hbn_init(ra, s1, 0x01, a3, 0x01, mstatus, dwLoc18, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0138, out s1_31, out a2_24, out a3_25, out a4_26, out s3_33), s1_31, 0x230C6900, a2_24, a3_25, a4_26, s3_33, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_340, out s1_63, out a0_341, out a1_342, out a2_54, out a3_55, out a4_56, out a5_343, out s2_344, out s3_67, out s4_345, out s5_346, out s6_347, out s7_348, out s8_349, out s9_350, out s10_351, out s11_352, out mstatus_60), s1_63, 0x230B3304, a2_54, a3_55, a4_56, s3_67, mstatus_60, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_93, out s1_94, out a0_353, out a1_354, out a2_85, out a3_86, out a4_87, out a5_355, out s2_356, out s3_98, out s4_357, out s5_358, out s6_359, out s7_360, out s8_361, out s9_362, out s10_363, out s11_364, out mstatus_91), s1_94, s0_93 + -0x0700, a2_85, a3_86, a4_87, s3_98, mstatus_91, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_365, out s1_366, out a0_367, out a1_368, out a2_115, out a3_116, out a4_117, out a5_118, out s2_369, out s3_370, out s4_371, out s5_372, out s6_373, out s7_374, out s8_375, out s9_376, out s10_377, out s11_378, out mstatus_121);
		Eq_2 a3_146;
		Eq_2 a4_147;
		Eq_2 s3_153;
		word32 s1_379;
		word32 a0_380;
		word32 a1_381;
		word32 a2_382;
		word32 a5_383;
		word32 s2_384;
		word32 s4_385;
		Eq_2 s0_150 = vTaskDelay(100, a2_115, a3_116, a4_117, a5_118, mstatus_121, dwArg04, dwArg08, dwArg0118, dwArg0158, out s1_379, out a0_380, out a1_381, out a2_382, out a3_146, out a4_147, out a5_383, out s2_384, out s3_153, out s4_385);
		Eq_2 a2_162;
		Eq_2 s1_165;
		Eq_2 a2_171;
		Eq_2 a3_172;
		Eq_2 a4_173;
		ptr32 mstatus_177;
		Eq_2 s1_180;
		Eq_2 s3_184;
		Eq_2 a2_202;
		Eq_2 a3_203;
		Eq_2 a4_204;
		ptr32 mstatus_208;
		word32 s0_210;
		Eq_2 s1_211;
		Eq_2 s3_215;
		word32 s0_386;
		word32 a0_387;
		word32 a1_388;
		word32 a5_389;
		word32 s2_390;
		word32 s4_391;
		word32 s5_392;
		word32 s6_393;
		word32 s7_394;
		word32 s8_395;
		word32 s9_396;
		word32 s10_397;
		word32 s11_398;
		word32 a0_399;
		word32 a1_400;
		word32 a5_401;
		word32 s2_402;
		word32 s4_403;
		word32 s5_404;
		word32 s6_405;
		word32 s7_406;
		word32 s8_407;
		word32 s9_408;
		word32 s10_409;
		word32 s11_410;
		word32 s0_411;
		word32 s1_412;
		word32 a0_413;
		word32 a1_414;
		word32 a2_415;
		word32 a3_416;
		word32 a4_417;
		word32 a5_418;
		word32 s2_419;
		word32 s3_420;
		word32 s4_421;
		word32 s5_422;
		word32 s6_423;
		word32 s7_424;
		word32 s8_425;
		word32 s9_426;
		word32 s10_427;
		word32 s11_428;
		word32 mstatus_429;
		at_dump_noend(at_dump_noend(at_dump_noend(hal_hbn_enter(ra_122, s0_150, out s1_165, out a2_162), s1_165, (word32) s0_150 - 0x0700, a2_162, a3_146, a4_147, s3_153, mstatus_121, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_386, out s1_180, out a0_387, out a1_388, out a2_171, out a3_172, out a4_173, out a5_389, out s2_390, out s3_184, out s4_391, out s5_392, out s6_393, out s7_394, out s8_395, out s9_396, out s10_397, out s11_398, out mstatus_177), s1_180, 588008152, a2_171, a3_172, a4_173, s3_184, mstatus_177, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_210, out s1_211, out a0_399, out a1_400, out a2_202, out a3_203, out a4_204, out a5_401, out s2_402, out s3_215, out s4_403, out s5_404, out s6_405, out s7_406, out s8_407, out s9_408, out s10_409, out s11_410, out mstatus_208), s1_211, s0_210 + -0x0700, a2_202, a3_203, a4_204, s3_215, mstatus_208, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_411, out s1_412, out a0_413, out a1_414, out a2_415, out a3_416, out a4_417, out a5_418, out s2_419, out s3_420, out s4_421, out s5_422, out s6_423, out s7_424, out s8_425, out s9_426, out s10_427, out s11_428, out mstatus_429);
	}
}

