pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307D3FA: void restory(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138)
void restory(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0138)
{
	word32 a2_59;
	word32 a3_60;
	word32 a4_61;
	ef_env_set_default(ra, s0, a2, a3, a4, s2, s4, s5, mstatus, dwLoc08, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg2C, dwArg48, dwArg5C, dwArg78, dwArgB8, dwArgF8, dwArg0138, out a2_59, out a3_60, out a4_61);
}

// 2307D40A: void scan(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void scan(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 a0_36;
	Eq_2 a3_39;
	Eq_2 a4_40;
	Eq_2 s1_45;
	Eq_2 s3_49;
	word32 a2_1489;
	word32 s2_1490;
	word32 s4_1491;
	Eq_2 a5_41;
	Eq_2 ra_44 = at_key_value_get(ra, s0, 588008168, fp + -73, s3, mstatus, dwLoc58, dwLoc28, dwLoc10, dwLoc0C, dwArg08, dwArg18, s7, s1, dwArg88, out s1_45, out a0_36, out a2_1489, out a3_39, out a4_40, out a5_41, out s2_1490, out s3_49, out s4_1491);
	Eq_2 dwLoc4C_919 = (uint32) nLoc4C;
	if (a0_36 != 0x00)
	{
		a5_41.u0 = ~0x00;
		dwLoc4C_919 = SEQ(~0x00, nLoc4C);
	}
	word32 a0_77;
	Eq_2 a3_80;
	ptr32 mstatus_346;
	Eq_2 ra_86 = wifi_mgmr_all_ap_scan(ra_44, s1_45, fp + -0x0044, fp + -72, a3_39, a4_40, a5_41, s3_49, mstatus, dwLoc50, dwLoc4C_919, dwLoc28, dwLoc20, dwLoc1C, dwArg08, dwArg14, dwArg28, 0x00, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, out a0_77, out a3_80, out mstatus_346);
	if (a0_77 != 0x00)
	{
		word32 s6_1520;
		word32 s4_1518;
		word32 s2_1516;
		word32 a5_1514;
		word32 a1_1510;
		word32 s1_1508;
		word32 a3_1512;
		word32 a2_1511;
		word32 s8_1522;
		word32 s7_1521;
		word32 s10_1524;
		word32 s11_1525;
		word32 t4_1526;
		word32 s9_1523;
		word32 s5_1519;
		word32 s3_1517;
		word32 a7_1515;
		word32 a4_1513;
		word32 a0_1509;
		printf(ra_86, &g_t230C4AF4, a3_80, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1508, out a0_1509, out a1_1510, out a2_1511, out a3_1512, out a4_1513, out a5_1514, out a7_1515, out s2_1516, out s3_1517, out s4_1518, out s5_1519, out s6_1520, out s7_1521, out s8_1522, out s9_1523, out s10_1524, out s11_1525, out t4_1526);
	}
	else
	{
		Eq_2 a2_772;
		Eq_2 a5_775;
		Eq_2 a0_770;
		Eq_2 a5_111;
		Eq_2 a3_115;
		Eq_2 a4_116;
		Eq_2 s1_119;
		Eq_2 s7_127;
		word32 s3_1497;
		word32 a7_1495;
		word32 a1_1493;
		word32 t4_1505;
		word32 s2_1496;
		word32 a2_1494;
		word32 s4_1498;
		word32 s9_1502;
		word32 a0_1492;
		word32 s10_1503;
		word32 s5_1499;
		word32 s6_1500;
		word32 s8_1501;
		word32 s11_1504;
		Eq_2 ra_118 = printf(ra_86, &g_t230C4B10, a3_80, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_119, out a0_1492, out a1_1493, out a2_1494, out a3_115, out a4_116, out a5_111, out a7_1495, out s2_1496, out s3_1497, out s4_1498, out s5_1499, out s6_1500, out s7_127, out s8_1501, out s9_1502, out s10_1503, out s11_1504, out t4_1505);
		int32 a0_136[];
		Eq_2 s1_144;
		uint32 s2_145;
		word32 a5_1506;
		word32 s3_1507;
		Eq_2 a4_140;
		Eq_2 a3_139;
		Eq_2 a2_138;
		int32 s0_143 = malloc(ra_118, s1_119, s7_127 << 0x02, a3_115, a4_116, a5_111, mstatus_346, dwLoc20, dwLoc1C, 0x00, dwArgD8, dwArg0118, out s1_144, out a0_136, out a2_138, out a3_139, out a4_140, out a5_1506, out s2_145, out s3_1507);
		Eq_2 a5_152 = 0x00;
		if (a0_136 == null)
		{
			word32 s10_1540;
			word32 s11_1541;
			word32 t4_1542;
			word32 s9_1539;
			word32 s3_1533;
			word32 s8_1538;
			word32 s4_1534;
			word32 s5_1535;
			word32 s6_1536;
			word32 s7_1537;
			word32 s1_1527;
			word32 a1_1528;
			word32 a3_1529;
			word32 a4_1530;
			word32 a7_1531;
			word32 s2_1532;
			printf(ra_118, &g_t230C46CC, a3_139, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_1527, out a0_770, out a1_1528, out a2_772, out a3_1529, out a4_1530, out a5_775, out a7_1531, out s2_1532, out s3_1533, out s4_1534, out s5_1535, out s6_1536, out s7_1537, out s8_1538, out s9_1539, out s10_1540, out s11_1541, out t4_1542);
		}
		else
		{
			while (a5_152 < s7_127)
			{
				a4_140 = a0_136 + (a5_152 << 0x02) / 4;
				*a5_152 = a4_140;
				a5_152 = (word32) a5_152 + 1;
			}
			if ((s2_145 >> 0x05 & 0x01) != 0x00)
			{
				a4_140 = a0_136 + 1;
				a3_139.u0 = 0x01;
				while (a3_139 < s7_127)
				{
					int32 a7_171 = *a4_140;
					a2_138 = a7_171 + 52 + s0_143;
					if ((int32) ((word32) *((word32) a4_140 - 4) + 52 + s0_143)->b0030 < (int32) (*((word32) a2_138 + 48)))
					{
						word32 a5_181 = (word32) a3_139 - 1;
						Eq_2 a1_182 = a4_140;
						do
						{
							Eq_454967 t1_185 = *((word32) a1_182 - 4);
							if ((int32) ((word32) t1_185 + 52 + s0_143)->b0030 >= (int32) (*((word32) a2_138 + 48)))
								break;
							*a1_182 = t1_185;
							a5_181 += ~0x00;
							a1_182 = (word32) a1_182 - 4;
						} while (a5_181 != ~0x00);
						a0_136[a5_181 + 0x01] = a7_171;
					}
					a3_139 = (byte) a3_139.u0 + 1;
					a4_140 = (word32) a4_140 + 4;
				}
			}
			Eq_2 a2_253;
			Eq_2 a3_254;
			Eq_2 a4_255;
			Eq_2 s1_258;
			Eq_2 s3_260;
			Eq_2 a2_279;
			Eq_2 a3_280;
			Eq_2 a4_281;
			ptr32 mstatus_285;
			Eq_2 s1_288;
			Eq_2 s3_292;
			Eq_2 a2_310;
			Eq_2 a3_311;
			Eq_2 a4_312;
			ptr32 mstatus_316;
			Eq_2 s1_319;
			Eq_2 s3_323;
			word32 s6_326;
			uint32 s2_352;
			word32 s9_1588;
			word32 s10_1589;
			word32 s11_1590;
			word32 s2_1572;
			word32 s8_1587;
			word32 s4_1573;
			word32 s5_1574;
			word32 a1_1581;
			word32 s6_1586;
			word32 a2_1582;
			word32 a3_1583;
			word32 a5_1584;
			word32 s5_1585;
			word32 s7_1575;
			word32 s8_1576;
			word32 s9_1577;
			word32 s10_1578;
			word32 s11_1579;
			word32 s1_1580;
			word32 a0_1556;
			word32 a5_1571;
			word32 a1_1557;
			word32 a5_1558;
			word32 s9_1565;
			word32 a1_1570;
			word32 s10_1566;
			word32 s11_1567;
			word32 s0_1568;
			word32 a0_1569;
			word32 s2_1559;
			word32 s4_1560;
			word32 s5_1561;
			word32 s6_1562;
			word32 s7_1563;
			word32 s8_1564;
			word32 s0_1555;
			word32 s2_1554;
			int32 s4_354;
			Eq_2 a4_342;
			int32 s7_357;
			Eq_2 a0_338;
			Eq_2 s0_348;
			Eq_2 s3_353;
			Eq_2 ra_347 = at_dump_noend(at_dump_noend(at_dump_noend(at_serial_lock(ra_118, s1_144, a2_138, a3_139, a4_140, mstatus_346, dwLoc5C, s10, s2, dwArg00, dwArg04, dwArg24, dwArg28, ra, dwArg98, dwArgD8, out s1_258, out a2_253, out a3_254, out a4_255, out s2_1554, out s3_260), s1_258, 0x230C6900, a2_253, a3_254, a4_255, s3_260, mstatus_346, dwLoc5C, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_1555, out s1_288, out a0_1556, out a1_1557, out a2_279, out a3_280, out a4_281, out a5_1558, out s2_1559, out s3_292, out s4_1560, out s5_1561, out s6_1562, out s7_1563, out s8_1564, out s9_1565, out s10_1566, out s11_1567, out mstatus_285), s1_288, 588008236, a2_279, a3_280, a4_281, s3_292, mstatus_285, dwLoc5C, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_1568, out s1_319, out a0_1569, out a1_1570, out a2_310, out a3_311, out a4_312, out a5_1571, out s2_1572, out s3_323, out s4_1573, out s5_1574, out s6_326, out s7_1575, out s8_1576, out s9_1577, out s10_1578, out s11_1579, out mstatus_316), s1_319, s6_326 + -0x0700, a2_310, a3_311, a4_312, s3_323, mstatus_316, dwLoc5C, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_348, out s1_1580, out a0_338, out a1_1581, out a2_1582, out a3_1583, out a4_342, out a5_1584, out s2_352, out s3_353, out s4_354, out s5_1585, out s6_1586, out s7_357, out s8_1587, out s9_1588, out s10_1589, out s11_1590, out mstatus_346);
			Eq_2 a5_374 = s2_352 >> 0x04 & 0x01;
			Eq_2 a5_377 = s2_352 >> 0x02 & 0x01;
			int32 s5_380 = 52;
			word32 s10_381 = 0x230C5000;
			for (; s4_354 < s7_357; ++s4_354)
			{
				Eq_2 s1_390 = *a0_338;
				Eq_2 a3_396;
				Eq_2 a2_400;
				word32 a1_1591;
				word32 a5_1592;
				a0_338 = strlen((word32) s0_348 + ((word32) a0_338 + s5_380), out a1_1591, out a2_400, out a3_396, out a4_342, out a5_1592);
				if (a0_338 != 0x00)
				{
					word32 a0_1597;
					word32 s4_1598;
					word32 s7_1599;
					word32 s10_1600;
					union Eq_2 * a1_409;
					word32 s11_421;
					word32 s0_418;
					Eq_2 a2_410;
					word32 s9_429;
					word32 s2_422;
					union Eq_2 * a5_413;
					int32 s5_425;
					word32 s8_428;
					word32 s6_426;
					Eq_2 s3_423;
					Eq_2 s1_419;
					Eq_2 a3_411;
					Eq_2 a4_412;
					ptr32 mstatus_416;
					Eq_2 ra_417 = at_dump_noend(ra_347, s1_390, s10_381 + -0x04CC, a2_400, a3_396, a4_342, s3_353, mstatus_346, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_418, out s1_419, out a0_1597, out a1_409, out a2_410, out a3_411, out a4_412, out a5_413, out s2_422, out s3_423, out s4_1598, out s5_425, out s6_426, out s7_1599, out s8_428, out s9_429, out s10_1600, out s11_421, out mstatus_416);
					0x00 = (int8) dwArg84;
					if (a5_413 != null)
					{
						word32 s10_1604;
						word32 s7_1603;
						word32 s4_1602;
						word32 a0_1601;
						ra_417 = at_dump_noend(ra_417, *a1_409, s8_428 + -0x04C4, a2_410, a3_411, a4_412, s3_423, mstatus_416, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_418, out s1_419, out a0_1601, out a1_409, out a2_410, out a3_411, out a4_412, out a5_413, out s2_422, out s3_423, out s4_1602, out s5_425, out s6_426, out s7_1603, out s8_428, out s9_429, out s10_1604, out s11_421, out mstatus_416);
					}
					if (a5_413 != null)
					{
						struct Eq_455076 * a1_481 = (char *) a1_409 + s5_425 + s0_418;
						word32 s0_1605;
						word32 a0_1606;
						word32 a1_1607;
						word32 s4_1608;
						word32 s7_1609;
						word32 s10_1610;
						word32 s11_1611;
						ra_417 = at_dump_noend(ra_417, *a1_409, s11_421 + -1216, (word32) a1_481->b0029, (word32) a1_481->b002A, (word32) a1_481->b002B, s3_423, mstatus_416, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_1605, out s1_419, out a0_1606, out a1_1607, out a2_410, out a3_411, out a4_412, out a5_413, out s2_422, out s3_423, out s4_1608, out s5_425, out s6_426, out s7_1609, out s8_428, out s9_429, out s10_1610, out s11_1611, out mstatus_416);
					}
					Eq_2 s0_522 = dwArg84;
					if (a5_413 != null)
					{
						word32 a1_1613;
						word32 s11_1618;
						word32 a2_1614;
						word32 s4_1615;
						word32 s7_1616;
						word32 s10_1617;
						word32 a0_1612;
						ra_417 = at_dump_noend(ra_417, *a5_413, s9_429 + -1184, a2_410, a3_411, a4_412, s3_423, mstatus_416, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_522, out s1_419, out a0_1612, out a1_1613, out a2_1614, out a3_411, out a4_412, out a5_413, out s2_422, out s3_423, out s4_1615, out s5_425, out s6_426, out s7_1616, out s8_428, out s9_429, out s10_1617, out s11_1618, out mstatus_416);
					}
					Eq_2 a2_572 = dwArg84;
					if (a5_413 != null)
					{
						word32 a1_1620;
						word32 s4_1621;
						word32 s7_1622;
						word32 s9_1623;
						word32 s10_1624;
						word32 s11_1625;
						word32 a0_1619;
						ra_417 = at_dump_noend(ra_417, *a5_413, s9_429 + -1184, dwArg84, a3_411, a4_412, s3_423, mstatus_416, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_522, out s1_419, out a0_1619, out a1_1620, out a2_572, out a3_411, out a4_412, out a5_413, out s2_422, out s3_423, out s4_1621, out s5_425, out s6_426, out s7_1622, out s8_428, out s9_1623, out s10_1624, out s11_1625, out mstatus_416);
					}
					if (s2_422 != 0x00)
					{
						Eq_2 s1_622 = *a5_413;
						wifi_mgmr_auth_to_str(CONVERT(Mem378[a5_413 + s5_425 + s0_522 + 47:byte], byte, word32));
						word32 s9_1652;
						word32 s10_1653;
						word32 s11_1654;
						word32 s8_1651;
						word32 s7_1650;
						word32 a0_1644;
						word32 s5_1649;
						word32 a1_1645;
						word32 a5_1646;
						word32 s2_1647;
						word32 s4_1648;
						word32 s0_1643;
						ra_417 = at_dump_noend(ra_417, s1_622, s8_428 + -0x04C4, a2_572, a3_411, a4_412, s3_423, mstatus_416, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_1643, out s1_419, out a0_1644, out a1_1645, out a2_572, out a3_411, out a4_412, out a5_1646, out s2_1647, out s3_423, out s4_1648, out s5_1649, out s6_426, out s7_1650, out s8_1651, out s9_1652, out s10_1653, out s11_1654, out mstatus_416);
					}
					Eq_2 a2_693;
					Eq_2 a3_694;
					Eq_2 a4_695;
					Eq_2 a5_696;
					word32 s9_1635;
					word32 s11_1636;
					word32 a1_1629;
					word32 s8_1634;
					word32 s2_1630;
					word32 s3_1631;
					word32 s4_1632;
					word32 s6_1633;
					word32 s0_1626;
					word32 s1_1627;
					word32 a0_1628;
					ra_347 = at_dump_noend(ra_417, s1_419, s6_426 + -0x0700, a2_572, a3_411, a4_412, s3_423, mstatus_416, a5_374, dwLoc50, dwLoc4C_919, s10, dwLoc04, dwArg00, dwArg04, dwArg28, s1, ra, dwArg78, dwArg88, dwArgB8, out s0_1626, out s1_1627, out a0_1628, out a1_1629, out a2_693, out a3_694, out a4_695, out a5_696, out s2_1630, out s3_1631, out s4_1632, out s5_380, out s6_1633, out s7_357, out s8_1634, out s9_1635, out s10_381, out s11_1636, out mstatus_346);
					word32 s1_1637;
					word32 a1_1638;
					word32 a2_1639;
					word32 a3_1640;
					word32 a5_1641;
					word32 s2_1642;
					s0_348 = vTaskDelay(0x05, a2_693, a3_694, a4_695, a5_696, mstatus_346, s4, s2, dwArgD8, dwArg0118, out s1_1637, out a0_338, out a1_1638, out a2_1639, out a3_1640, out a4_342, out a5_1641, out s2_1642, out s3_353, out s4_354);
				}
			}
			Eq_2 a2_744;
			Eq_2 a5_747;
			Eq_2 s3_752;
			word32 a0_1593;
			word32 a3_1594;
			word32 a4_1595;
			word32 s4_1596;
			at_serial_unlock(ra_347, a4_342, mstatus_346, a5_374, s10, s2, dwArg00, dwArg04, a5_377, dwArg28, ra, dwArg98, dwArgD8, dwArg0118, out a0_1593, out a2_744, out a3_1594, out a4_1595, out a5_747, out s3_752, out s4_1596);
			free(s3_752, a2_744, a5_747, mstatus_346, dwArgF8, dwArg0138, out a0_770, out a2_772, out a5_775);
		}
		if (a0_770 != 0x00)
		{
			word32 a4_1549;
			word32 a5_1550;
			word32 a6_1551;
			word32 s4_1552;
			word32 t3_1553;
			word32 s0_1543;
			word32 s1_1544;
			word32 a0_1545;
			word32 a1_1546;
			word32 a2_1547;
			word32 a3_1548;
			vPortFree(a0_770, a2_772, a5_775, mstatus_346, dwArgF8, dwArg0138, out s0_1543, out s1_1544, out a0_1545, out a1_1546, out a2_1547, out a3_1548, out a4_1549, out a5_1550, out a6_1551, out s4_1552, out t3_1553);
		}
	}
}

// 2307D65E: void reset(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void reset(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a2_18;
	Eq_2 a3_19;
	Eq_2 a4_20;
	ptr32 mstatus_24;
	Eq_2 s1_27;
	Eq_2 s3_31;
	Eq_2 a2_49;
	Eq_2 a3_50;
	Eq_2 a4_51;
	ptr32 mstatus_55;
	word32 s0_57;
	Eq_2 s1_58;
	Eq_2 s3_62;
	Eq_2 a2_79;
	Eq_2 a3_80;
	Eq_2 a4_81;
	Eq_2 a5_82;
	ptr32 mstatus_85;
	word32 s0_140;
	word32 a0_141;
	word32 a1_142;
	word32 a5_143;
	word32 s2_144;
	word32 s4_145;
	word32 s5_146;
	word32 s6_147;
	word32 s7_148;
	word32 s8_149;
	word32 s9_150;
	word32 s10_151;
	word32 s11_152;
	word32 a0_153;
	word32 a1_154;
	word32 a5_155;
	word32 s2_156;
	word32 s4_157;
	word32 s5_158;
	word32 s6_159;
	word32 s7_160;
	word32 s8_161;
	word32 s9_162;
	word32 s10_163;
	word32 s11_164;
	word32 s0_165;
	word32 s1_166;
	word32 a0_167;
	word32 a1_168;
	word32 s2_169;
	word32 s3_170;
	word32 s4_171;
	word32 s5_172;
	word32 s6_173;
	word32 s7_174;
	word32 s8_175;
	word32 s9_176;
	word32 s10_177;
	word32 s11_178;
	at_dump_noend(at_dump_noend(at_dump_noend(ra, s1, 0x230C6900, a2, a3, a4, s3, mstatus, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_140, out s1_27, out a0_141, out a1_142, out a2_18, out a3_19, out a4_20, out a5_143, out s2_144, out s3_31, out s4_145, out s5_146, out s6_147, out s7_148, out s8_149, out s9_150, out s10_151, out s11_152, out mstatus_24), s1_27, 0x230B3304, a2_18, a3_19, a4_20, s3_31, mstatus_24, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_57, out s1_58, out a0_153, out a1_154, out a2_49, out a3_50, out a4_51, out a5_155, out s2_156, out s3_62, out s4_157, out s5_158, out s6_159, out s7_160, out s8_161, out s9_162, out s10_163, out s11_164, out mstatus_55), s1_58, s0_57 + -0x0700, a2_49, a3_50, a4_51, s3_62, mstatus_55, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_165, out s1_166, out a0_167, out a1_168, out a2_79, out a3_80, out a4_81, out a5_82, out s2_169, out s3_170, out s4_171, out s5_172, out s6_173, out s7_174, out s8_175, out s9_176, out s10_177, out s11_178, out mstatus_85);
	word32 s1_179;
	word32 a0_180;
	word32 a1_181;
	word32 a2_182;
	word32 a3_183;
	word32 a4_184;
	word32 a5_185;
	word32 s2_186;
	word32 s3_187;
	word32 s4_188;
	vTaskDelay(0x02, a2_79, a3_80, a4_81, a5_82, mstatus_85, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_179, out a0_180, out a1_181, out a2_182, out a3_183, out a4_184, out a5_185, out s2_186, out s3_187, out s4_188);
	hal_reboot(mstatus_85);
}

