pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307D698: void ble_sync(Register Eq_2 ra, Register (ptr32 Eq_446) a4, Register word32 a5, Stack Eq_2 dwArg14)
void ble_sync(Eq_2 ra, struct Eq_446 * a4, word32 a5, Eq_2 dwArg14)
{
	if (a5 != 0x00)
	{
		a4 = (struct Eq_446 *) 0x01;
		if (a5 != 0x01)
		{
			a4 = (struct Eq_446 *) 0x02;
			if (a5 != 0x02)
				return;
		}
	}
	word32 s0_61;
	word32 a0_62;
	word32 a3_63;
	aos_post_event(ra, 0x05, a4, dwArg14, out s0_61, out a0_62, out a3_63);
}

// 2307D6C6: void cb_httpc_headers_done_fn(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108)
void cb_httpc_headers_done_fn(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108)
{
	Eq_2 a3_28;
	struct Eq_455517 * s2_35;
	struct Eq_455518 * a5_47;
	Eq_2 a2_50;
	Eq_2 a3_51;
	Eq_2 a4_52;
	word32 s1_55;
	Eq_2 s3_59;
	word32 s1_198;
	word32 a0_199;
	word32 a1_200;
	word32 a2_201;
	word32 a4_202;
	word32 a5_203;
	word32 a7_204;
	word32 s3_205;
	word32 s4_206;
	word32 s5_207;
	word32 s6_208;
	word32 s7_209;
	word32 s8_210;
	word32 s9_211;
	word32 s10_212;
	word32 s11_213;
	word32 t4_214;
	word32 a0_215;
	word32 a1_216;
	word32 a7_217;
	word32 s2_218;
	word32 s4_219;
	word32 s5_220;
	word32 s6_221;
	word32 s7_222;
	word32 s8_223;
	word32 s9_224;
	word32 s10_225;
	word32 s11_226;
	word32 t4_227;
	Eq_2 ra_54 = printf(printf(ra, &g_t230C49D8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_198, out a0_199, out a1_200, out a2_201, out a3_28, out a4_202, out a5_203, out a7_204, out s2_35, out s3_205, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_212, out s11_213, out t4_214), s2_35->ptr0004, a3_28, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_55, out a0_215, out a1_216, out a2_50, out a3_51, out a4_52, out a5_47, out a7_217, out s2_218, out s3_59, out s4_219, out s5_220, out s6_221, out s7_222, out s8_223, out s9_224, out s10_225, out s11_226, out t4_227);
	if (s1_55 != 0x00)
	{
		Eq_2 s1_68 = a5_47->t0008;
		if (a5_47 == null)
		{
			Eq_2 a2_74;
			Eq_2 a3_75;
			Eq_2 a4_76;
			ptr32 mstatus_80;
			Eq_2 s1_83;
			Eq_2 s3_87;
			word32 s0_228;
			word32 a0_229;
			word32 a1_230;
			word32 a5_231;
			word32 s2_232;
			word32 s4_233;
			word32 s5_234;
			word32 s6_235;
			word32 s7_236;
			word32 s8_237;
			word32 s9_238;
			word32 s10_239;
			word32 s11_240;
			word32 s0_241;
			word32 s1_242;
			word32 a0_243;
			word32 a1_244;
			word32 a2_245;
			word32 a3_246;
			word32 a4_247;
			word32 a5_248;
			word32 s2_249;
			word32 s3_250;
			word32 s4_251;
			word32 s5_252;
			word32 s6_253;
			word32 s7_254;
			word32 s8_255;
			word32 s9_256;
			word32 s10_257;
			word32 s11_258;
			word32 mstatus_259;
			at_dump_noend(at_dump_noend(ra_54, s1_68, 0x230C6900, a2_50, a3_51, a4_52, s3_59, mstatus, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_228, out s1_83, out a0_229, out a1_230, out a2_74, out a3_75, out a4_76, out a5_231, out s2_232, out s3_87, out s4_233, out s5_234, out s6_235, out s7_236, out s8_237, out s9_238, out s10_239, out s11_240, out mstatus_80), s1_83, 0x230C4A04, a2_74, a3_75, a4_76, s3_87, mstatus_80, s0, dwArg00, dwArg04, dwArg08, dwArg4C, dwArg50, dwArg54, dwArg78, dwArg98, dwArg9C, dwArgC8, dwArgD8, dwArg0108, out s0_241, out s1_242, out a0_243, out a1_244, out a2_245, out a3_246, out a4_247, out a5_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6_253, out s7_254, out s8_255, out s9_256, out s10_257, out s11_258, out mstatus_259);
		}
	}
	0x00 = dwArg38;
}

// 2307D71C: Register Eq_2 __wifimode_set(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_455695) a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 mstatusOut)
// Called from:
//      set_apcfg
//      cwjap_cur
//      cwmode_cur
Eq_2 __wifimode_set(Eq_2 ra, Eq_2 s0, struct Eq_455695 * a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & mstatusOut)
{
	Eq_2 ra_163;
	Eq_2 a3_17;
	word32 t1_507;
	word32 a0_508;
	word32 a1_509;
	word32 a2_510;
	word32 a4_511;
	word32 a5_512;
	Eq_2 ra_20 = memset(ra, 1107410556, 0x00, 65, out t1_507, out a0_508, out a1_509, out a2_510, out a3_17, out a4_511, out a5_512);
	if (a0 == null)
	{
		Eq_2 a2_273;
		Eq_2 a3_274;
		Eq_2 a4_275;
		Eq_2 a5_276;
		ptr32 mstatus_279;
		Eq_2 ra_280 = wifi_mgmr_sta_disconnect(ra_20, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a2_273, out a3_274, out a4_275, out a5_276, out mstatus_279);
		Eq_2 s4_311;
		word32 s1_513;
		word32 a0_514;
		word32 a1_515;
		word32 a2_516;
		word32 a3_517;
		word32 a4_518;
		word32 a5_519;
		word32 s2_520;
		word32 s3_521;
		vTaskDelay(1000, a2_273, a3_274, a4_275, a5_276, mstatus_279, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_513, out a0_514, out a1_515, out a2_516, out a3_517, out a4_518, out a5_519, out s2_520, out s3_521, out s4_311);
		ptr32 mstatus_324;
		Eq_2 s4_331;
		word32 s1_522;
		word32 a3_523;
		word32 s2_524;
		ra_163 = wifi_mgmr_ap_stop(wifi_mgmr_sta_disable(ra_280, s4_311, mstatus_279, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s4_331, out mstatus_324), s4_331, mstatus_324, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s1_522, out a3_523, out s2_524, out mstatus);
	}
	else
	{
		word32 a0_154;
		if (a0 == (struct Eq_455695 *) 0x01)
		{
			ptr32 mstatus_190;
			Eq_2 s4_197;
			Eq_2 a3_214;
			ptr32 mstatus_219;
			Eq_2 s1_221;
			Eq_2 s2_224;
			word32 a1_525;
			word32 s2_526;
			word32 s3_527;
			ra_163 = wifi_mgmr_sta_enable(wifi_mgmr_ap_stop(wifi_mgmr_sta_disable(ra_20, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s4_197, out mstatus_190), s4_197, mstatus_190, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s1_221, out a3_214, out s2_224, out mstatus_219), s1_221, a3_214, s2_224, mstatus_219, s0, dwLoc08, dwArg28, dwArg38, dwArg40, dwArg44, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0158, out a0_154, out a1_525, out s2_526, out s3_527, out mstatus);
		}
		else
		{
			if (a0 != (struct Eq_455695 *) 0x02)
			{
				word32 s1_528;
				word32 a0_529;
				word32 a1_530;
				word32 a2_531;
				word32 a3_532;
				word32 a4_533;
				word32 a5_534;
				word32 a7_535;
				word32 s2_536;
				word32 s3_537;
				word32 s4_538;
				word32 s5_539;
				word32 s6_540;
				word32 s7_541;
				word32 s8_542;
				word32 s9_543;
				word32 s10_544;
				word32 s11_545;
				word32 t4_546;
				ra_163 = printf(ra_20, &g_t230C4868, a3_17, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_528, out a0_529, out a1_530, out a2_531, out a3_532, out a4_533, out a5_534, out a7_535, out s2_536, out s3_537, out s4_538, out s5_539, out s6_540, out s7_541, out s8_542, out s9_543, out s10_544, out s11_545, out t4_546);
l2307D752:
				mstatusOut = mstatus;
				return ra_163;
			}
			Eq_2 a2_54;
			Eq_2 a3_55;
			Eq_2 a4_56;
			Eq_2 a5_57;
			ptr32 mstatus_60;
			Eq_2 ra_61 = wifi_mgmr_sta_disconnect(ra_20, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a2_54, out a3_55, out a4_56, out a5_57, out mstatus_60);
			Eq_2 s4_92;
			word32 s1_547;
			word32 a0_548;
			word32 a1_549;
			word32 a2_550;
			word32 a3_551;
			word32 a4_552;
			word32 a5_553;
			word32 s2_554;
			word32 s3_555;
			vTaskDelay(1000, a2_54, a3_55, a4_56, a5_57, mstatus_60, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_547, out a0_548, out a1_549, out a2_550, out a3_551, out a4_552, out a5_553, out s2_554, out s3_555, out s4_92);
			ptr32 mstatus_105;
			Eq_2 s4_112;
			ptr32 mstatus_134;
			Eq_2 s1_136;
			Eq_2 s2_139;
			word32 a3_556;
			word32 s0_557;
			word32 s2_558;
			ra_163 = wifi_mgmr_ap_enable(wifi_mgmr_ap_stop(wifi_mgmr_sta_disable(ra_61, s4_92, mstatus_60, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s4_112, out mstatus_105), s4_112, mstatus_105, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s1_136, out a3_556, out s2_139, out mstatus_134), s1_136, s2_139, mstatus_134, s0, dwArg28, dwArg38, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0158, out s0_557, out a0_154, out s2_558, out mstatus);
		}
		g_dw4200F6D4 = a0_154;
	}
	goto l2307D752;
}

// 2307D7AE: void set_apcfg(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void set_apcfg(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	struct Eq_455695 * a0_19;
	Eq_2 s4_33;
	word32 a3_258;
	word32 s1_256;
	word32 a2_257;
	word32 a4_259;
	word32 a5_260;
	word32 s2_261;
	word32 s3_262;
	Eq_2 ra_27 = at_key_value_get(ra, a0, 587897308, fp + ~0x13, s3, mstatus, s2, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_256, out a0_19, out a2_257, out a3_258, out a4_259, out a5_260, out s2_261, out s3_262, out s4_33);
	if (a0_19 <= (struct Eq_455695 *) ~0x02)
	{
		ptr32 mstatus_75;
		Eq_2 ra_58 = __wifimode_set(ra_27, a0, a0_19, s4_33, mstatus, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg58, dwArg60, dwArg64, s1, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0138, dwArg0148, out mstatus_75);
		Eq_2 a3_82;
		word32 a1_263;
		word32 a2_264;
		word32 a4_265;
		word32 a5_266;
		strlen((word32) a0 + 72, out a1_263, out a2_264, out a3_82, out a4_265, out a5_266);
		Eq_2 s1_102;
		int32 s2_105;
		word32 a0_267;
		word32 a1_268;
		word32 a2_269;
		word32 a3_270;
		word32 a4_271;
		word32 a5_272;
		word32 a7_273;
		word32 s3_274;
		word32 s4_275;
		word32 s5_276;
		word32 s6_277;
		word32 s7_278;
		word32 s8_279;
		word32 s9_280;
		word32 s10_281;
		word32 s11_282;
		word32 t4_283;
		Eq_2 ra_101 = printf(ra_58, &g_t230C4B68, a3_82, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_102, out a0_267, out a1_268, out a2_269, out a3_270, out a4_271, out a5_272, out a7_273, out s2_105, out s3_274, out s4_275, out s5_276, out s6_277, out s7_278, out s8_279, out s9_280, out s10_281, out s11_282, out t4_283);
		Eq_2 a3_118 = s1_102;
		if (s2_105 <= 0x00)
			a3_118.u0 = 0x00;
		word32 a4_284;
		word32 a5_285;
		strcpy(1107410556, wifi_mgmr_ap_start(ra_101, (word32) a0 + 8, a3_118, 0x01, mstatus_75, dwLoc20, dwLoc1C, dwArg08, dwArg38, dwArg58, dwArg78, dwArg98), out a4_284, out a5_285);
	}
}

// 2307D832: void cwjap_cur(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void cwjap_cur(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	struct Eq_455695 * a0_21;
	Eq_2 s4_35;
	word32 s1_496;
	word32 a2_497;
	word32 a3_498;
	word32 a4_499;
	word32 a5_500;
	word32 s2_501;
	word32 s3_502;
	Eq_2 ra_29 = at_key_value_get(ra, a0, 587897308, fp + -40, s3, mstatus, dwLoc28, dwArg08, dwArg20, dwArg24, dwArg38, dwArg48, dwArg6C, dwArg78, dwArgB8, out s1_496, out a0_21, out a2_497, out a3_498, out a4_499, out a5_500, out s2_501, out s3_502, out s4_35);
	if ((a0_21 & -3) == 0x01)
	{
		ptr32 mstatus_77;
		word32 t1_503;
		word32 a0_504;
		word32 a1_505;
		word32 a2_506;
		word32 a3_507;
		word32 a4_508;
		word32 a5_509;
		word32 t1_510;
		word32 a0_511;
		word32 a1_512;
		word32 a2_513;
		word32 a3_514;
		word32 a4_515;
		word32 a5_516;
		Eq_2 ra_104 = memset(memset(__wifimode_set(ra_29, dwArg14, a0_21, s4_35, mstatus, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg48, dwArg50, 0x00, dwArg58, s3, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0128, dwArg0138, out mstatus_77), 1107410524, 0x00, 32, out t1_503, out a0_504, out a1_505, out a2_506, out a3_507, out a4_508, out a5_509), 1107410456, 0x00, 65, out t1_510, out a0_511, out a1_512, out a2_513, out a3_514, out a4_515, out a5_516);
		word32 a1_517;
		word32 a2_518;
		word32 a3_519;
		word32 a4_520;
		word32 a5_521;
		word32 a1_522;
		word32 a2_523;
		word32 a3_524;
		word32 a4_525;
		word32 a5_526;
		word32 a6_527;
		word32 a7_528;
		memcpy(1107410524, (word32) dwArg14 + 8, strlen((word32) dwArg14 + 8, out a1_517, out a2_518, out a3_519, out a4_520, out a5_521), out a1_522, out a2_523, out a3_524, out a4_525, out a5_526, out a6_527, out a7_528);
		Eq_2 a3_147;
		word32 a1_529;
		word32 a2_530;
		word32 a3_531;
		word32 a4_532;
		word32 a5_533;
		word32 a1_534;
		word32 a2_535;
		word32 a4_536;
		word32 a5_537;
		word32 a6_538;
		word32 a7_539;
		memcpy(1107410456, (word32) dwArg14 + 41, strlen((word32) dwArg14 + 41, out a1_529, out a2_530, out a3_531, out a4_532, out a5_533), out a1_534, out a2_535, out a3_147, out a4_536, out a5_537, out a6_538, out a7_539);
		if (dwArg14 == 0x08)
		{
			word32 s1_547;
			word32 a0_548;
			word32 a1_549;
			word32 a2_550;
			word32 a3_551;
			word32 a4_552;
			word32 a5_553;
			word32 a7_554;
			word32 s2_555;
			word32 s3_556;
			word32 s4_557;
			word32 s5_558;
			word32 s6_559;
			word32 s7_560;
			word32 s8_561;
			word32 s9_562;
			word32 s10_563;
			word32 s11_564;
			word32 t4_565;
			printf(ra_104, &g_t230C4A70, a3_147, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_547, out a0_548, out a1_549, out a2_550, out a3_551, out a4_552, out a5_553, out a7_554, out s2_555, out s3_556, out s4_557, out s5_558, out s6_559, out s7_560, out s8_561, out s9_562, out s10_563, out s11_564, out t4_565);
		}
		else
		{
			ptr32 mstatus_234;
			Eq_2 ra_235;
			Eq_2 s1_236;
			ptr32 mstatus_172;
			Eq_2 s0_174;
			Eq_2 s3_179;
			word32 a5_202;
			Eq_2 s4_211;
			word32 s1_540;
			word32 a0_541;
			word32 a2_542;
			word32 a3_543;
			word32 a4_544;
			word32 s2_545;
			word32 s3_546;
			Eq_2 ra_205 = at_key_value_get(wifi_mgmr_sta_connect(ra_104, (word32) dwArg14 + 8, (word32) dwArg14 + 41, 0x00, 0x4201C000, mstatus_77, dwLoc18, dwArg08, dwArg28, dwArg48, 0x00, dwArg94, out s0_174, out s3_179, out mstatus_172), s0_174, 587897320, fp + -36, s3_179, mstatus_172, dwLoc28, dwArg08, dwArg20, dwArg24, dwArg38, dwArg48, dwArg6C, dwArg78, dwArgB8, out s1_540, out a0_541, out a2_542, out a3_543, out a4_544, out a5_202, out s2_545, out s3_546, out s4_211);
			if (a5_202 != 0x00)
			{
				word32 s2_571;
				word32 s3_572;
				word32 s4_573;
				word32 s5_574;
				word32 s6_575;
				ra_235 = wifi_mgmr_sta_autoconnect_enable(ra_205, s4_211, mstatus_172, dwLoc28, dwArg00, dwArg04, dwArg28, dwArg34, dwArg4C, dwArg50, 0x00, dwArg78, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s1_236, out s2_571, out s3_572, out s4_573, out s5_574, out s6_575, out mstatus_234);
			}
			else
			{
				word32 s2_566;
				word32 s3_567;
				word32 s4_568;
				word32 s5_569;
				word32 s6_570;
				ra_235 = wifi_mgmr_sta_autoconnect_disable(ra_205, s4_211, mstatus_172, dwLoc28, dwArg00, dwArg04, dwArg28, dwArg34, dwArg4C, dwArg50, 0x00, dwArg78, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s1_236, out s2_566, out s3_567, out s4_568, out s5_569, out s6_570, out mstatus_234);
			}
			Eq_2 s0_299;
			Eq_2 s1_300;
			ptr32 mstatus_319;
			word32 a0_576;
			word32 s4_577;
			word32 s0_578;
			word32 s1_579;
			word32 a0_580;
			word32 s4_581;
			word32 mstatus_582;
			at_key_value_set(at_key_value_set(ra_235, s1_236, 587897332, s1_236, mstatus_234, dwLoc2C, dwLoc28, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc04, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgD8, out s0_299, out s1_300, out a0_576, out s4_577, out mstatus_319), s1_300, 0x230A9A00, s0_299, mstatus_319, dwLoc2C, dwLoc28, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc04, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgD8, out s0_578, out s1_579, out a0_580, out s4_581, out mstatus_582);
		}
	}
	0x00 = (int8) dwArg0128;
}

