pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307D926: void cwmode_cur(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register (ptr32 Eq_456420) a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void cwmode_cur(Eq_2 ra, Eq_2 s1, Eq_2 a3, struct Eq_456420 * a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 a0_11 = a4->t0008;
	if (a4 > (struct Eq_456420 *) 0x02)
	{
		word32 s1_228;
		word32 a0_229;
		word32 a1_230;
		word32 a2_231;
		word32 a3_232;
		word32 a4_233;
		word32 a5_234;
		word32 a7_235;
		word32 s2_236;
		word32 s3_237;
		word32 s4_238;
		word32 s5_239;
		word32 s6_240;
		word32 s7_241;
		word32 s8_242;
		word32 s9_243;
		word32 s10_244;
		word32 s11_245;
		word32 t4_246;
		printf(ra, &g_t230C4868, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_228, out a0_229, out a1_230, out a2_231, out a3_232, out a4_233, out a5_234, out a7_235, out s2_236, out s3_237, out s4_238, out s5_239, out s6_240, out s7_241, out s8_242, out s9_243, out s10_244, out s11_245, out t4_246);
	}
	else
	{
		struct Eq_456463 * a4_23;
		struct Eq_456463 * a5_24;
		Eq_2 s1_28;
		word32 a0_222;
		word32 a2_223;
		word32 a3_224;
		word32 s2_225;
		word32 s3_226;
		word32 s4_227;
		Eq_2 ra_27 = at_key_value_get(ra, a0_11, 587897308, fp + ~0x13, s3, mstatus, dwLoc18, dwArg18, dwArg30, dwArg34, dwArg48, dwArg58, dwArg7C, dwArg88, dwArgC8, out s1_28, out a0_222, out a2_223, out a3_224, out a4_23, out a5_24, out s2_225, out s3_226, out s4_227);
		word32 s0_47 = a4_23->dw0008;
		if (a4_23 != a5_24)
		{
			struct Eq_455695 * a0_52;
			Eq_2 s4_67;
			ptr32 mstatus_81;
			word32 s0_247;
			word32 s1_248;
			word32 mstatus_249;
			__wifimode_set(at_key_value_set(ra_27, s1_28, (word32) s1_28 - 0x0624, s0_47 + 8, mstatus, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg0C, dwArg38, dwArg48, dwArg4C, dwArg58, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgE8, out s0_247, out s1_248, out a0_52, out s4_67, out mstatus_81), a0_52->t0008, a0_52, s4_67, mstatus_81, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg50, dwArg58, dwArg60, dwArg64, s1, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0138, dwArg0148, out mstatus_249);
		}
	}
}

// 2307D97C: void uart_set(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_456564) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void uart_set(Eq_2 ra, Eq_2 s0, struct Eq_456564 * a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	struct Eq_456589 * a0_9 = a1->ptr000C;
	word32 s1_288;
	word32 a0_289;
	word32 a1_290;
	word32 a2_291;
	word32 a3_292;
	word32 a4_293;
	word32 a5_294;
	word32 a7_295;
	word32 s2_296;
	word32 s3_297;
	word32 s4_298;
	word32 s5_299;
	word32 s6_300;
	word32 s7_301;
	word32 s8_302;
	word32 s9_303;
	word32 s10_304;
	word32 s11_305;
	word32 t4_306;
	Eq_2 ra_22 = printf(ra, &g_t230C4BA0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_288, out a0_289, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a7_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302, out s9_303, out s10_304, out s11_305, out t4_306);
	word32 a0_41;
	Eq_2 s1_50;
	word32 a3_307;
	word32 a4_308;
	word32 a5_309;
	word32 s0_49 = at_serial_cfg_set((word32) a0_9->b0010, dwArg84, dwArg0118, out s1_50, out a0_41, out a3_307, out a4_308, out a5_309);
	if (a0_41 == 0x00)
	{
		word32 s0_73;
		Eq_2 s1_74;
		ptr32 mstatus_93;
		word32 s0_106;
		Eq_2 s1_107;
		ptr32 mstatus_126;
		word32 s0_139;
		Eq_2 s1_140;
		ptr32 mstatus_159;
		word32 s0_172;
		Eq_2 s1_173;
		ptr32 mstatus_192;
		word32 a0_310;
		word32 s4_311;
		word32 a0_312;
		word32 s4_313;
		word32 a0_314;
		word32 s4_315;
		word32 a0_316;
		word32 s4_317;
		word32 s0_318;
		word32 s1_319;
		word32 a0_320;
		word32 s4_321;
		word32 mstatus_322;
		at_key_value_set(at_key_value_set(at_key_value_set(at_key_value_set(at_key_value_set(ra_22, s1_50, 0x230C4700, s0_49 + 0x0C, mstatus, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgF8, out s0_73, out s1_74, out a0_310, out s4_311, out mstatus_93), s1_74, 0x230C46E0, s0_73 + 16, mstatus_93, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgF8, out s0_106, out s1_107, out a0_312, out s4_313, out mstatus_126), s1_107, 588007144, s0_106 + 24, mstatus_126, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgF8, out s0_139, out s1_140, out a0_314, out s4_315, out mstatus_159), s1_140, 588007152, s0_139 + 20, mstatus_159, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgF8, out s0_172, out s1_173, out a0_316, out s4_317, out mstatus_192), s1_173, 588007160, s0_172 + 28, mstatus_192, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgF8, out s0_318, out s1_319, out a0_320, out s4_321, out mstatus_322);
	}
}

// 2307DA08: void at_get_errorcode()
// Called from:
//      join_ap_handler
void at_get_errorcode()
{
}

// 2307DA0C: Register ptr32 at_cmd_impl_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s3Out)
// Called from:
//      at_cmd_init
ptr32 at_cmd_impl_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s3Out)
{
	ptr32 s1_104;
	Eq_2 a3_18;
	Eq_2 a4_19;
	Eq_2 a5_20;
	Eq_2 a0_29;
	word32 s2_167;
	word32 s3_168;
	word32 a1_166;
	xQueueCreateMutex(ra, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_29, out a1_166, out a3_18, out a4_19, out a5_20, out s2_167, out s3_168);
	g_t420280E8 = a0_29;
	ptr32 s3_48;
	Eq_2 a0_53;
	word32 a5_171;
	word32 s2_172;
	word32 a1_169;
	word32 a4_170;
	Eq_2 a3_131;
	xQueueCreateMutex(ra, a3_18, a4_19, a5_20, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_53, out a1_169, out a3_131, out a4_170, out a5_171, out s2_172, out s3_48);
	Eq_2 a4_62 = g_t420280E8;
	g_t420280EC = a0_53;
	struct Eq_123468 * s0_65 = &g_t42028000;
	if (a4_62 != 0x00)
	{
		s1_104 = 0x00;
		if (a0_53 != 0x00)
		{
l2307DA4E:
			a0Out = s1_104;
			a3Out = a3_131;
			s3Out = s3_48;
			return s1_104;
		}
		word32 a5_177;
		word32 s4_178;
		word32 a1_175;
		word32 a2_176;
		word32 s1_173;
		word32 a0_174;
		s0_65 = vQueueDelete(a4_62, a3_131, a4_62, mstatus, dwArg0148, dwArg0188, out s1_173, out a0_174, out a1_175, out a2_176, out a3_131, out a4_62, out a5_177, out s4_178);
	}
	Eq_2 a0_82 = s0_65->t00EC;
	s1_104 = ~0x00;
	if (a0_82 != 0x00)
	{
		word32 a5_183;
		word32 s4_184;
		word32 a2_181;
		word32 a4_182;
		word32 a0_179;
		word32 a1_180;
		vQueueDelete(a0_82, a3_131, a4_62, mstatus, dwArg0148, dwArg0188, out s1_104, out a0_179, out a1_180, out a2_181, out a3_131, out a4_182, out a5_183, out s4_184);
	}
	goto l2307DA4E;
}

// 2307DA5A: void callback(Register word32 a0, Register word32 a1, Register word32 a2)
void callback(word32 a0, word32 a1, word32 a2)
{
	ui32 a5_14;
	for (a5_14 = 0x00; a5_14 != 0x1B; ++a5_14)
	{
		if (a0 == a1)
		{
			<anonymous> * t1_22 = g_a230C48E4[a5_14];
			if (t1_22 == null)
				return;
			else
			{
				word32 t1_38;
				t1_22();
				return;
			}
		}
	}
}

// 2307DA94: void wifi_supports(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Stack ptr32 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgC4, Stack word32 dwArgE0, Stack ptr32 dwArgE4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void wifi_supports(Eq_2 ra, Eq_2 a0, Eq_4455 a5, ptr32 dwArg94, Eq_2 dwArg98, word32 dwArgC4, word32 dwArgE0, ptr32 dwArgE4, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a0_11;
	word32 s5_75;
	word32 s4_74;
	word32 s3_73;
	word32 s2_72;
	word32 a5_71;
	word32 a4_70;
	word32 a3_69;
	word32 a2_68;
	word32 s1_67;
	word32 s0_66;
	at_get_parameters(ra, a0, null, 0x00, null, a5, dwArg94, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s0_66, out s1_67, out a0_11, out a2_68, out a3_69, out a4_70, out a5_71, out s2_72, out s3_73, out s4_74, out s5_75);
}

// 2307DAAC: void attention_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Stack ptr32 dwArgA4, Stack Eq_2 dwArgA8, Stack word32 dwArgD4, Stack word32 dwArgF0, Stack ptr32 dwArgF4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198)
void attention_handler(Eq_2 ra, Eq_2 a0, Eq_4455 a5, ptr32 dwArgA4, Eq_2 dwArgA8, word32 dwArgD4, word32 dwArgF0, ptr32 dwArgF4, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198)
{
	word32 s0_39;
	word32 s1_40;
	word32 a0_41;
	word32 a2_42;
	word32 a3_43;
	word32 a4_44;
	word32 a5_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	at_get_parameters(ra, a0, null, 0x00, null, a5, dwArgA4, dwArgA8, dwArgD4, dwArgF0, dwArgF4, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0198, out s0_39, out s1_40, out a0_41, out a2_42, out a3_43, out a4_44, out a5_45, out s2_46, out s3_47, out s4_48, out s5_49);
}

