pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307DAB6: void wifi_mode_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack ptr32 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack word32 dwArgA4, Stack word32 dwArgC0, Stack ptr32 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void wifi_mode_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, ptr32 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, word32 dwArgA4, word32 dwArgC0, ptr32 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_13 = *(union Eq_2 *) 0x00FFFC04;
	Eq_2 a3_16 = (word32) *(union Eq_2 *) 0x00FFFC04;
	if (a3_16 != 63)
	{
		if (a3_16 != 61)
			return;
		*(union Eq_2 *) 0x00FFFC05 = a0_13;
		word32 a0_23;
		int32 a5_27;
		Eq_2 a3_40;
		word32 s5_238;
		word32 s4_237;
		word32 s3_236;
		word32 s2_235;
		word32 a4_234;
		word32 a2_233;
		word32 s1_232;
		word32 s0_231;
		Eq_2 ra_41 = at_get_parameters(ra, a0_13, fp + -28, 0x01, fp + -32, 0x00FFFC05, dwArg74, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_231, out s1_232, out a0_23, out a2_233, out a3_40, out a4_234, out a5_27, out s2_235, out s3_236, out s4_237, out s5_238);
		if (a0_23 != 0x00 || a5_27 <= 0x00)
			return;
		word32 a0_46;
		Eq_2 a3_51;
		word32 a1_240;
		word32 s1_239;
		word32 a2_241;
		word32 a4_242;
		word32 a5_243;
		word32 a7_244;
		word32 s2_245;
		word32 s3_246;
		word32 s4_247;
		word32 s5_248;
		word32 s6_249;
		word32 s7_250;
		word32 s8_251;
		word32 s9_252;
		word32 s10_253;
		word32 s11_254;
		word32 t4_255;
		at_wifi_mode(printf(ra_41, &g_t230C55B8, a3_40, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_239, out a0_46, out a1_240, out a2_241, out a3_51, out a4_242, out a5_243, out a7_244, out s2_245, out s3_246, out s4_247, out s5_248, out s6_249, out s7_250, out s8_251, out s9_252, out s10_253, out s11_254, out t4_255), a0_46, a3_51);
	}
	else
	{
		*(union Eq_2 *) 0x00FFFC05 = a0_13;
		at_wifi_mode_get(ra, a3_16, mstatus);
	}
}

// 2307DB22: void http_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 s3, Register ptr32 mstatus, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg64, Stack word32 dwArg74, Stack word32 dwArg90, Stack ptr32 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void http_req(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 s3, ptr32 mstatus, Eq_2 dwArg2C, Eq_2 dwArg64, word32 dwArg74, word32 dwArg90, ptr32 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 a0_25;
	Eq_2 s3_35;
	word32 s2_267;
	word32 a5_266;
	word32 a4_265;
	word32 a3_264;
	word32 a2_263;
	word32 s1_262;
	malloc(ra, s1, 0x0202, a3, a4, a5, mstatus, dwLoc20, dwLoc1C, dwArg2C, dwArgD8, dwArg0118, out s1_262, out a0_25, out a2_263, out a3_264, out a4_265, out a5_266, out s2_267, out s3_35);
	if (a0_25 == 0x00)
		return;
	byte * a5_48 = *s3_35;
	if ((word32) *a5_48 != 61)
		return;
	*s3_35 = a5_48 + 1;
	word32 a0_72;
	int32 a4_75;
	Eq_2 s0_78;
	Eq_2 s4_79;
	up32 s5_83;
	Eq_2 s2_85;
	word32 s3_270;
	word32 a3_269;
	word32 s1_268;
	Eq_2 a5_76;
	Eq_2 a2_74;
	Eq_2 ra_90 = at_get_parameters(ra, s3_35, fp + -80, 0x04, fp + -84, a5_48 + 1, s3, s1, dwArg74, dwArg90, dwArg94, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_78, out s1_268, out a0_72, out a2_74, out a3_269, out a4_75, out a5_76, out s2_85, out s3_270, out s4_79, out s5_83);
	if (a0_72 == 0x00)
	{
		a2_74 = dwArg64;
		a5_76.u0 = 0x02;
		if (a4_75 > 0x02 && s5_83 >= (word32) (*((word32) s0_78 + 0x0100)))
		{
			a2_74 = (word32) *((word32) s0_78 + 0x0101);
			if (s2_85 >= a2_74)
			{
				g_b4201C2E4 = 0x00;
				g_dw4201C2EC = 0x00;
				g_dw4201C2F0 = 0x00;
				Eq_2 a2_125;
				Eq_2 a5_128;
				word32 s5_274;
				word32 s6_275;
				word32 s7_276;
				word32 s9_277;
				word32 s11_278;
				at_http_request(ra_90, s4_79, out a2_125, out a5_128, out s5_274, out s6_275, out s7_276, out s9_277, out s11_278);
				word32 a0_279;
				word32 a2_280;
				word32 a5_281;
				free(s0_78, a2_125, a5_128, mstatus, dwArgF8, dwArg0138, out a0_279, out a2_280, out a5_281);
				return;
			}
		}
	}
	word32 a0_271;
	word32 a2_272;
	word32 a5_273;
	free(s0_78, a2_74, a5_76, mstatus, dwArgF8, dwArg0138, out a0_271, out a2_272, out a5_273);
}

// 2307DC00: void domain_name_resolution(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58)
void domain_name_resolution(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58)
{
	word32 a1_566;
	word32 a2_567;
	word32 a3_568;
	word32 a4_569;
	word32 a5_570;
	word32 a7_571;
	word32 s3_573;
	word32 s2_572;
	word32 s4_574;
	word32 s5_575;
	word32 a0_565;
	word32 s1_564;
	word32 s6_576;
	word32 s7_577;
	word32 s8_578;
	word32 s9_579;
	word32 s10_580;
	word32 s11_581;
	word32 t4_582;
	word32 t1_583;
	word32 a0_584;
	word32 a1_585;
	word32 a2_586;
	word32 a3_587;
	word32 a4_588;
	word32 a5_589;
	Eq_2 ra_57 = memset(printf(ra, &g_t230C4ED4, a3, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_564, out a0_565, out a1_566, out a2_567, out a3_568, out a4_569, out a5_570, out a7_571, out s2_572, out s3_573, out s4_574, out s5_575, out s6_576, out s7_577, out s8_578, out s9_579, out s10_580, out s11_581, out t4_582), fp + -288, 0x00, 0x0100, out t1_583, out a0_584, out a1_585, out a2_586, out a3_587, out a4_588, out a5_589);
	Eq_2 s1_63 = *(union Eq_2 *) 0x00FFFD00;
	Eq_2 dwLoc012C_453 = SEQ(nLoc012B, 0x00);
	if ((word32) *(union Eq_2 *) 0x00FFFD00 != 61)
		return;
	*(union Eq_2 *) 0x00FFFD01 = s1_63;
	word32 a0_74;
	int32 a5_78;
	Eq_2 s0_80;
	Eq_2 a3_91;
	word32 s1_590;
	word32 a2_591;
	word32 a4_592;
	word32 s2_593;
	word32 s3_594;
	word32 s4_595;
	word32 s5_596;
	Eq_2 ra_92 = at_get_parameters(ra_57, s1_63, fp + -300, 0x01, fp + -304, 0x00FFFD01, dwLoc9C, dwLoc98, dwLoc6C, dwLoc50, dwLoc4C, dwLoc28, s0, dwArg18, dwArg38, dwArg58, out s0_80, out s1_590, out a0_74, out a2_591, out a3_91, out a4_592, out a5_78, out s2_593, out s3_594, out s4_595, out s5_596);
	if (a0_74 != 0x00 || a5_78 <= 0x00)
		return;
	Eq_2 a3_103;
	word32 s1_597;
	word32 a0_598;
	word32 a1_599;
	word32 a2_600;
	word32 a4_601;
	word32 a5_602;
	word32 a7_603;
	word32 s2_604;
	word32 s3_605;
	word32 s4_606;
	word32 s5_607;
	word32 s6_608;
	word32 s7_609;
	word32 s8_610;
	word32 s9_611;
	word32 s10_612;
	word32 s11_613;
	word32 t4_614;
	Eq_2 ra_106 = printf(ra_92, &g_t230C4EEC, a3_91, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_597, out a0_598, out a1_599, out a2_600, out a3_103, out a4_601, out a5_602, out a7_603, out s2_604, out s3_605, out s4_606, out s5_607, out s6_608, out s7_609, out s8_610, out s9_611, out s10_612, out s11_613, out t4_614);
	Eq_2 a0_122;
	Eq_2 a2_124;
	Eq_2 a3_125;
	Eq_2 a4_126;
	Eq_2 s1_131 = lwip_gethostbyname(ra_106, s0_80, s0_80, a3_103, mstatus, dwLocC8, dwLoc88, dwLoc48, dwLoc38, s0, dwArg08, out a0_122, out a2_124, out a3_125, out a4_126);
	if (a0_122 != 0x00)
	{
		ui32 a1_148 = 0x00;
		while (*((word32) a4_126 + a1_148 * 0x04) != 0x00)
			++a1_148;
		Eq_2 a3_169;
		Eq_2 a4_170;
		ptr32 mstatus_174;
		Eq_2 s1_177;
		Eq_2 s3_181;
		Eq_2 a2_200;
		Eq_2 a3_201;
		Eq_2 a4_202;
		ptr32 mstatus_206;
		word32 s0_208;
		Eq_2 s1_209;
		Eq_2 s3_213;
		word32 s0_615;
		word32 a0_616;
		word32 a1_617;
		word32 a2_618;
		word32 a5_619;
		word32 s2_620;
		word32 s4_621;
		word32 s5_622;
		word32 s6_623;
		word32 s7_624;
		word32 s8_625;
		word32 s9_626;
		word32 s10_627;
		word32 s11_628;
		word32 a0_629;
		word32 a1_630;
		word32 a5_631;
		word32 s2_632;
		word32 s4_633;
		word32 s5_634;
		word32 s6_635;
		word32 s7_636;
		word32 s8_637;
		word32 s9_638;
		word32 s10_639;
		word32 s11_640;
		word32 a0_641;
		word32 a1_642;
		word32 a5_643;
		word32 s2_644;
		word32 s4_645;
		word32 s5_646;
		word32 s6_647;
		word32 s7_648;
		word32 s8_649;
		word32 s9_650;
		word32 s10_651;
		word32 s11_652;
		Eq_2 s3_243;
		word32 s0_238;
		Eq_2 s1_239;
		Eq_2 a2_230;
		Eq_2 a3_231;
		Eq_2 a4_232;
		ptr32 mstatus_236;
		Eq_2 ra_237 = at_dump_noend(at_dump_noend(at_dump_noend(ra_106, s1_131, 0x230C6900, a2_124, a3_125, a4_126, a0_122, mstatus, dwLoc013C, dwLoc0130, dwLoc012C_453, dwLoc0128, dwLocE4, dwLocE0, dwLocDC, dwLocB8, dwLoc98, dwLoc94, dwLoc68, dwLoc58, dwLoc28, out s0_615, out s1_177, out a0_616, out a1_617, out a2_618, out a3_169, out a4_170, out a5_619, out s2_620, out s3_181, out s4_621, out s5_622, out s6_623, out s7_624, out s8_625, out s9_626, out s10_627, out s11_628, out mstatus_174), s1_177, 0x230C4F14, dwLocDC, a3_169, a4_170, s3_181, mstatus_174, dwLoc013C, dwLoc0130, dwLoc012C_453, dwLoc0128, dwLocE4, dwLocE0, dwLocDC, dwLocB8, dwLoc98, dwLoc94, dwLoc68, dwLoc58, dwLoc28, out s0_208, out s1_209, out a0_629, out a1_630, out a2_200, out a3_201, out a4_202, out a5_631, out s2_632, out s3_213, out s4_633, out s5_634, out s6_635, out s7_636, out s8_637, out s9_638, out s10_639, out s11_640, out mstatus_206), s1_209, s0_208 + -0x0700, a2_200, a3_201, a4_202, s3_213, mstatus_206, dwLoc013C, dwLoc0130, dwLoc012C_453, dwLoc0128, dwLocE4, dwLocE0, dwLocDC, dwLocB8, dwLoc98, dwLoc94, dwLoc68, dwLoc58, dwLoc28, out s0_238, out s1_239, out a0_641, out a1_642, out a2_230, out a3_231, out a4_232, out a5_643, out s2_644, out s3_243, out s4_645, out s5_646, out s6_647, out s7_648, out s8_649, out s9_650, out s10_651, out s11_652, out mstatus_236);
		int32 s2_257 = 0x00;
		while (*((word32) *((word32) s3_243 + 16) + s2_257) != 0x00)
		{
			ptr32 mstatus_283;
			Eq_2 s1_286;
			Eq_2 s3_290;
			word32 s5_292;
			word32 s0_653;
			word32 a0_654;
			word32 a1_655;
			word32 a2_656;
			word32 a3_657;
			word32 a4_658;
			word32 a5_659;
			word32 s2_660;
			word32 s4_661;
			word32 s6_662;
			word32 s7_663;
			word32 s8_664;
			word32 s9_665;
			word32 s10_666;
			word32 s11_667;
			Eq_2 ra_284 = at_dump_noend(ra_237, s1_239, s0_238 + -0x0700, a2_230, a3_231, a4_232, s3_243, mstatus_236, dwLoc013C, dwLoc0130, dwLoc012C_453, dwLoc0128, dwLocE4, dwLocE0, dwLocDC, dwLocB8, dwLoc98, dwLoc94, dwLoc68, dwLoc58, dwLoc28, out s0_653, out s1_286, out a0_654, out a1_655, out a2_656, out a3_657, out a4_658, out a5_659, out s2_660, out s3_290, out s4_661, out s5_292, out s6_662, out s7_663, out s8_664, out s9_665, out s10_666, out s11_667, out mstatus_283);
			Eq_2 a2_310;
			Eq_2 a3_311;
			Eq_2 a4_312;
			word32 a5_668;
			ip4addr_ntoa(out a2_310, out a3_311, out a4_312, out a5_668);
			Eq_2 a2_327;
			Eq_2 a3_328;
			Eq_2 a4_329;
			ptr32 mstatus_333;
			word32 s0_335;
			Eq_2 s1_336;
			Eq_2 s3_340;
			word32 a0_669;
			word32 a1_670;
			word32 a5_671;
			word32 s2_672;
			word32 s4_673;
			word32 s5_674;
			word32 s6_675;
			word32 s7_676;
			word32 s8_677;
			word32 s9_678;
			word32 s10_679;
			word32 s11_680;
			word32 a0_681;
			word32 a1_682;
			word32 a5_683;
			word32 s4_684;
			word32 s5_685;
			word32 s6_686;
			word32 s7_687;
			word32 s8_688;
			word32 s9_689;
			word32 s10_690;
			word32 s11_691;
			ra_237 = at_dump_noend(at_dump_noend(ra_284, s1_286, s5_292 + -0x0688, a2_310, a3_311, a4_312, s3_290, mstatus_283, dwLoc013C, dwLoc0130, dwLoc012C_453, dwLoc0128, dwLocE4, dwLocE0, dwLocDC, dwLocB8, dwLoc98, dwLoc94, dwLoc68, dwLoc58, dwLoc28, out s0_335, out s1_336, out a0_669, out a1_670, out a2_327, out a3_328, out a4_329, out a5_671, out s2_672, out s3_340, out s4_673, out s5_674, out s6_675, out s7_676, out s8_677, out s9_678, out s10_679, out s11_680, out mstatus_333), s1_336, s0_335 + -0x0700, a2_327, a3_328, a4_329, s3_340, mstatus_333, dwLoc013C, dwLoc0130, dwLoc012C_453, dwLoc0128, dwLocE4, dwLocE0, dwLocDC, dwLocB8, dwLoc98, dwLoc94, dwLoc68, dwLoc58, dwLoc28, out s0_238, out s1_239, out a0_681, out a1_682, out a2_230, out a3_231, out a4_232, out a5_683, out s2_257, out s3_243, out s4_684, out s5_685, out s6_686, out s7_687, out s8_688, out s9_689, out s10_690, out s11_691, out mstatus_236);
		}
	}
}

// 2307DD2E: void base_station_info(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack ptr32 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack word32 dwArgB0, Stack ptr32 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void base_station_info(Eq_2 ra, Eq_2 a0, Eq_4455 a5, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, ptr32 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, word32 dwArgB0, ptr32 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 a0_23;
	Eq_2 a4_26;
	Eq_2 a5_27;
	Eq_2 s1_35;
	Eq_2 a3_40;
	word32 a2_480;
	word32 s2_481;
	word32 s0_479;
	word32 s5_484;
	word32 s3_482;
	word32 s4_483;
	Eq_2 ra_41 = at_get_parameters(ra, a0, null, 0x00, null, a5, dwArg64, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_479, out s1_35, out a0_23, out a2_480, out a3_40, out a4_26, out a5_27, out s2_481, out s3_482, out s4_483, out s5_484);
	if (a0_23 == 0x00)
	{
		word32 s2_491;
		word32 s3_492;
		word32 a3_488;
		word32 a4_489;
		word32 a5_490;
		word32 a2_487;
		word32 s1_485;
		word32 a0_486;
		malloc(ra_41, s1_35, 0x0080, a3_40, a4_26, a5_27, mstatus, dwArg00, dwArg04, 0x00, dwArgF8, dwArg0138, out s1_485, out a0_486, out a2_487, out a3_488, out a4_489, out a5_490, out s2_491, out s3_492);
		Eq_2 s11_78;
		Eq_337418 s5_81;
		Eq_337419 s6_82;
		Eq_337420 s7_83;
		ptr32 s9_85;
		word32 a5_494;
		word32 a2_493;
		Eq_2 a0_69 = at_http_request(ra_41, 0x00, out a2_493, out a5_494, out s5_81, out s6_82, out s7_83, out s9_85, out s11_78);
		if (a0_69 == 0x00)
		{
			word32 a0_96;
			struct Eq_341367 * s0_107;
			Eq_2 ra_106 = cJSON_Parse(ra_41, a0_69, a0_69, s5_81, s6_82, s7_83, dwArg04, s9_85, s11_78, fflags, frm, ra, dwArg6C, dwArgAC, dwArgE8, dwArg0108, out s0_107, out a0_96);
			if (a0_96 != 0x00)
			{
				Eq_2 a0_131;
				word32 a4_497;
				word32 a2_495;
				word32 a3_496;
				cJSON_GetObjectItem(s0_107, &g_b230C45D8, out a0_131, out a2_495, out a3_496, out a4_497);
				Eq_2 a0_145;
				word32 a4_500;
				word32 a2_498;
				word32 a3_499;
				cJSON_GetObjectItem(s0_107, &g_b230BF504, out a0_145, out a2_498, out a3_499, out a4_500);
				Eq_2 a0_159;
				Eq_2 a2_160;
				Eq_2 a3_164;
				Eq_2 a4_165;
				Eq_2 a4_176;
				ptr32 mstatus_180;
				Eq_2 s1_183;
				word32 s2_506;
				word32 s4_507;
				word32 s5_508;
				word32 a1_503;
				word32 a2_504;
				word32 a5_505;
				word32 s0_501;
				word32 a0_502;
				word32 s6_509;
				word32 s7_510;
				word32 s8_511;
				word32 s9_512;
				word32 s10_513;
				word32 s11_514;
				Eq_2 s3_187;
				Eq_2 a3_175;
				Eq_2 ra_181 = at_dump_noend(ra_106, cJSON_GetObjectItem(s0_107, &g_b230C4E68, out a0_159, out a2_160, out a3_164, out a4_165), 0x230C6900, a2_160, a3_164, a4_165, a0_131, mstatus, a0_159, dwLoc30, dwLoc2C, s2, dwArg1C, dwArg20, dwArg24, 0x00, dwArg68, dwArg6C, dwArg98, dwArgA8, dwArgD8, out s0_501, out s1_183, out a0_502, out a1_503, out a2_504, out a3_175, out a4_176, out a5_505, out s2_506, out s3_187, out s4_507, out s5_508, out s6_509, out s7_510, out s8_511, out s9_512, out s10_513, out s11_514, out mstatus_180);
				Eq_2 a2_202 = a0_145;
				if (s3_187 != 0x00)
					s3_187 = *((word32) s3_187 + 16);
				if (a0_145 != 0x00)
					a2_202 = *((word32) a0_145 + 16);
				if (a3_175 != 0x00)
					a3_175 = *((word32) a3_175 + 16);
				Eq_2 a2_238;
				Eq_2 a3_239;
				Eq_2 a4_240;
				ptr32 mstatus_244;
				Eq_2 s1_247;
				word32 s2_250;
				Eq_2 s3_251;
				Eq_2 a0_266;
				Eq_2 a2_268;
				Eq_2 a5_271;
				ptr32 mstatus_274;
				struct Eq_341140 * a5_301;
				word32 s0_515;
				word32 a0_516;
				word32 a1_517;
				word32 a5_518;
				word32 s4_519;
				word32 s5_520;
				word32 s6_521;
				word32 s7_522;
				word32 s8_523;
				word32 s9_524;
				word32 s10_525;
				word32 s11_526;
				word32 s0_527;
				word32 s1_528;
				word32 a1_529;
				word32 a3_530;
				word32 a4_531;
				word32 s2_532;
				word32 s3_533;
				word32 s4_534;
				word32 s5_535;
				word32 s6_536;
				word32 s7_537;
				word32 s8_538;
				word32 s9_539;
				word32 s10_540;
				word32 s11_541;
				word32 a0_542;
				word32 a2_543;
				word32 s1_544;
				word32 a0_545;
				word32 a5_546;
				word32 s2_547;
				word32 s3_548;
				cJSON_Delete(at_dump_noend(at_dump_noend(ra_181, s1_183, 588009076, a2_202, a3_175, a4_176, s3_187, mstatus_180, a0_159, dwLoc30, dwLoc2C, s2, dwArg1C, dwArg20, dwArg24, 0x00, dwArg68, dwArg6C, dwArg98, dwArgA8, dwArgD8, out s0_515, out s1_247, out a0_516, out a1_517, out a2_238, out a3_239, out a4_240, out a5_518, out s2_250, out s3_251, out s4_519, out s5_520, out s6_521, out s7_522, out s8_523, out s9_524, out s10_525, out s11_526, out mstatus_244), s1_247, s2_250 + -0x0700, a2_238, a3_239, a4_240, s3_251, mstatus_244, a0_159, dwLoc30, dwLoc2C, s2, dwArg1C, dwArg20, dwArg24, 0x00, dwArg68, dwArg6C, dwArg98, dwArgA8, dwArgD8, out s0_527, out s1_528, out a0_266, out a1_529, out a2_268, out a3_530, out a4_531, out a5_271, out s2_532, out s3_533, out s4_534, out s5_535, out s6_536, out s7_537, out s8_538, out s9_539, out s10_540, out s11_541, out mstatus_274), free(a0_266, a2_268, a5_271, mstatus_274, dwArg0118, dwArg0158, out a0_542, out a2_543, out a5_301), a5_301, out s1_544, out a0_545, out a5_546, out s2_547, out s3_548);
			}
		}
	}
}

// 2307DE06: void deep_sleep_handler(Register Eq_2 ra, Register Eq_4455 a5, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack ptr32 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack word32 dwArg94, Stack word32 dwArgB0, Stack ptr32 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void deep_sleep_handler(Eq_2 ra, Eq_4455 a5, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, ptr32 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, word32 dwArg94, word32 dwArgB0, ptr32 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a0_13 = *(union Eq_2 *) 0x00FFFC04;
	if ((word32) *(union Eq_2 *) 0x00FFFC04 != 61)
		return;
	*(union Eq_2 *) 0x00FFFC05 = a0_13;
	word32 a0_28;
	int32 a5_32;
	Eq_2 a3_45;
	word32 s3_204;
	word32 s2_203;
	word32 a4_202;
	word32 a2_201;
	word32 s1_200;
	word32 s0_199;
	word32 s4_205;
	word32 s5_206;
	Eq_2 ra_46 = at_get_parameters(ra, a0_13, fp + -40, 0x02, fp + -52, a5, dwArg64, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_199, out s1_200, out a0_28, out a2_201, out a3_45, out a4_202, out a5_32, out s2_203, out s3_204, out s4_205, out s5_206);
	if (a0_28 != 0x00 || a5_32 <= 0x00)
		return;
	word32 a1_55;
	Eq_2 a3_57;
	word32 s1_207;
	word32 a0_208;
	word32 a2_209;
	word32 a4_210;
	word32 a5_211;
	word32 a7_212;
	word32 s2_213;
	word32 s3_214;
	word32 s4_215;
	word32 s5_216;
	word32 s6_217;
	word32 s7_218;
	word32 s8_219;
	word32 s9_220;
	word32 s10_221;
	word32 s11_222;
	word32 t4_223;
	at_deep_sleep_mode(printf(ra_46, &g_t230C4E98, a3_45, 0x00, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_207, out a0_208, out a1_55, out a2_209, out a3_57, out a4_210, out a5_211, out a7_212, out s2_213, out s3_214, out s4_215, out s5_216, out s6_217, out s7_218, out s8_219, out s9_220, out s10_221, out s11_222, out t4_223), a1_55, a3_57);
}

