pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307DE70: void setautoconnect_handler(Register Eq_2 ra, Register word32 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack ptr32 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack word32 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgC0, Stack ptr32 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void setautoconnect_handler(Eq_2 ra, word32 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, ptr32 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, word32 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgC0, ptr32 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 s3_28;
	word32 a3_452;
	word32 a2_451;
	word32 a1_450;
	word32 a0_449;
	word32 s1_448;
	word32 a4_453;
	word32 a5_454;
	word32 a7_455;
	word32 s2_456;
	word32 s4_457;
	word32 s5_458;
	word32 s6_459;
	word32 s7_460;
	word32 s8_461;
	word32 s9_462;
	word32 s10_463;
	word32 s11_464;
	word32 t4_465;
	Eq_2 ra_23 = printf(ra, &g_t230C4ED4, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_448, out a0_449, out a1_450, out a2_451, out a3_452, out a4_453, out a5_454, out a7_455, out s2_456, out s3_28, out s4_457, out s5_458, out s6_459, out s7_460, out s8_461, out s9_462, out s10_463, out s11_464, out t4_465);
	Eq_2 s0_44 = *(union Eq_2 *) 0x00FFFC04;
	int32 a4_47 = (word32) *(union Eq_2 *) 0x00FFFC04;
	Eq_2 dwLoc1C_329 = SEQ(SLICE(s0, word24, 8), 0x03);
	if (a4_47 != 63)
	{
		if (a4_47 != 61)
			return;
		*(union Eq_2 *) 0x00FFFC05 = s0_44;
		Eq_2 a0_56;
		Eq_2 a3_73;
		word32 s0_514;
		word32 s1_515;
		word32 a2_516;
		word32 a4_517;
		word32 a5_518;
		word32 s2_519;
		word32 s3_520;
		word32 s4_521;
		word32 s5_522;
		Eq_2 ra_74 = at_get_parameters(ra_23, s0_44, fp + -28, 0x01, fp + -36, 0x00FFFC05, dwArg74, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_514, out s1_515, out a0_56, out a2_516, out a3_73, out a4_517, out a5_518, out s2_519, out s3_520, out s4_521, out s5_522);
		if (a0_56 != 0x00)
			return;
		if (true)
			return;
		Eq_2 dwLoc28_309;
		Eq_2 a5_82;
		Eq_2 s1_90;
		word32 a0_523;
		word32 a1_524;
		word32 a2_525;
		word32 a3_526;
		word32 a4_527;
		word32 a7_528;
		word32 s2_529;
		word32 s3_530;
		word32 s4_531;
		word32 s5_532;
		word32 s6_533;
		word32 s7_534;
		word32 s8_535;
		word32 s9_536;
		word32 s10_537;
		word32 s11_538;
		word32 t4_539;
		Eq_2 ra_89 = printf(ra_74, &g_t230C4F88, a3_73, a0_56, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_90, out a0_523, out a1_524, out a2_525, out a3_526, out a4_527, out a5_82, out a7_528, out s2_529, out s3_530, out s4_531, out s5_532, out s6_533, out s7_534, out s8_535, out s9_536, out s10_537, out s11_538, out t4_539);
		if (a5_82 == 0x01)
			dwLoc28_309 = a5_82;
		else
		{
			if (a5_82 != 0x00)
				return;
			dwLoc28_309.u0 = 0x00;
		}
		word32 s0_540;
		word32 s1_541;
		word32 a0_542;
		word32 s4_543;
		word32 mstatus_544;
		at_key_value_set(ra_89, s1_90, 587897320, fp + -32, mstatus, 0x00, dwLoc28_309, dwLoc1C_329, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc04, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgD8, out s0_540, out s1_541, out a0_542, out s4_543, out mstatus_544);
	}
	else
	{
		Eq_2 a2_152;
		Eq_2 a3_153;
		Eq_2 a4_154;
		Eq_2 s1_159;
		Eq_2 s3_163;
		Eq_2 a2_182;
		Eq_2 a3_183;
		Eq_2 a4_184;
		ptr32 mstatus_188;
		Eq_2 s1_191;
		Eq_2 s3_195;
		Eq_2 a2_214;
		Eq_2 a3_215;
		Eq_2 a4_216;
		ptr32 mstatus_220;
		word32 s0_222;
		Eq_2 s1_223;
		Eq_2 s3_227;
		word32 a0_466;
		word32 a5_467;
		word32 s2_468;
		word32 s4_469;
		word32 s0_470;
		word32 a0_471;
		word32 a1_472;
		word32 a5_473;
		word32 s2_474;
		word32 s4_475;
		word32 s5_476;
		word32 s6_477;
		word32 s7_478;
		word32 s8_479;
		word32 s9_480;
		word32 s10_481;
		word32 s11_482;
		word32 a0_483;
		word32 a1_484;
		word32 a5_485;
		word32 s2_486;
		word32 s4_487;
		word32 s5_488;
		word32 s6_489;
		word32 s7_490;
		word32 s8_491;
		word32 s9_492;
		word32 s10_493;
		word32 s11_494;
		word32 s0_495;
		word32 s1_496;
		word32 a0_497;
		word32 a1_498;
		word32 a2_499;
		word32 a3_500;
		word32 a4_501;
		word32 a5_502;
		word32 s2_503;
		word32 s3_504;
		word32 s4_505;
		word32 s5_506;
		word32 s6_507;
		word32 s7_508;
		word32 s8_509;
		word32 s9_510;
		word32 s10_511;
		word32 s11_512;
		word32 mstatus_513;
		at_dump_noend(at_dump_noend(at_dump_noend(at_key_value_get(ra_23, s0_44, 587897320, fp + -32, s3_28, mstatus, 0x00, dwArg08, dwArg20, dwArg24, dwArg38, dwArg48, dwArg6C, dwArg78, dwArgB8, out s1_159, out a0_466, out a2_152, out a3_153, out a4_154, out a5_467, out s2_468, out s3_163, out s4_469), s1_159, 0x230C6900, a2_152, a3_153, a4_154, s3_163, mstatus, 0x00, dwLoc20, dwLoc1C_329, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_470, out s1_191, out a0_471, out a1_472, out a2_182, out a3_183, out a4_184, out a5_473, out s2_474, out s3_195, out s4_475, out s5_476, out s6_477, out s7_478, out s8_479, out s9_480, out s10_481, out s11_482, out mstatus_188), s1_191, 588009336, a2_182, a3_183, a4_184, s3_195, mstatus_188, 0x00, dwLoc20, dwLoc1C_329, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_222, out s1_223, out a0_483, out a1_484, out a2_214, out a3_215, out a4_216, out a5_485, out s2_486, out s3_227, out s4_487, out s5_488, out s6_489, out s7_490, out s8_491, out s9_492, out s10_493, out s11_494, out mstatus_220), s1_223, s0_222 + -0x0700, a2_214, a3_215, a4_216, s3_227, mstatus_220, 0x00, dwLoc20, dwLoc1C_329, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_495, out s1_496, out a0_497, out a1_498, out a2_499, out a3_500, out a4_501, out a5_502, out s2_503, out s3_504, out s4_505, out s5_506, out s6_507, out s7_508, out s8_509, out s9_510, out s10_511, out s11_512, out mstatus_513);
	}
}

