pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307DF42: void scan_handler_opt(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack ptr32 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack word32 dwArgB0, Stack ptr32 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void scan_handler_opt(Eq_2 ra, Eq_2 s0, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, ptr32 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, word32 dwArgB0, ptr32 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a0_17 = *(union Eq_2 *) 0x00FFF801;
	byte bLoc31_248 = 0x00;
	int32 a3_23 = (word32) *(union Eq_2 *) 0x00FFF801;
	Eq_2 dwLoc1C_268 = SEQ(nLoc1B, 0x03);
	Eq_2 dwLoc28_278 = SEQ(nLoc27, 0x03);
	if (a3_23 != 63)
	{
		if (a3_23 != 61)
			return;
		*(union Eq_2 *) 0x00FFF802 = a0_17;
		word32 a0_31;
		int32 a4_34;
		Eq_2 s1_43;
		word32 s0_438;
		word32 a2_439;
		word32 a3_440;
		word32 a5_441;
		word32 s2_442;
		word32 s3_443;
		word32 s4_444;
		word32 s5_445;
		Eq_2 ra_49 = at_get_parameters(ra, a0_17, fp + -40, 0x02, fp + -44, 0x00FFF802, dwArg64, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_438, out s1_43, out a0_31, out a2_439, out a3_440, out a4_34, out a5_441, out s2_442, out s3_443, out s4_444, out s5_445);
		if (a0_31 != 0x00 || a4_34 <= 0x01)
			return;
		word32 s0_446;
		word32 s1_447;
		word32 a0_448;
		word32 s4_449;
		word32 mstatus_450;
		at_key_value_set(ra_49, s1_43, 588008168, fp + -49, mstatus, dwLoc3C, dwLoc38, fp + -47, dwLoc28_278, s0, dwLoc20, dwLoc1C_268, dwLoc14, dwArg18, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgC8, out s0_446, out s1_447, out a0_448, out s4_449, out mstatus_450);
	}
	else
	{
		word32 a0_98;
		Eq_2 a2_100;
		Eq_2 a3_101;
		Eq_2 a4_102;
		Eq_2 s1_107;
		Eq_2 s3_111;
		word32 s4_392;
		word32 s2_391;
		word32 a5_390;
		Eq_2 ra_106 = at_key_value_get(ra, s0, 588008168, fp + -49, s3, mstatus, dwLoc38, dwLoc08, dwArg10, dwArg14, dwArg28, dwArg38, ra, dwArg68, dwArgA8, out s1_107, out a0_98, out a2_100, out a3_101, out a4_102, out a5_390, out s2_391, out s3_111, out s4_392);
		if (a0_98 != 0x00)
			bLoc31_248 = ~0x00;
		Eq_2 a3_142;
		Eq_2 a4_143;
		ptr32 mstatus_147;
		Eq_2 s1_150;
		Eq_2 s3_154;
		Eq_2 a2_176;
		Eq_2 a3_177;
		Eq_2 a4_178;
		ptr32 mstatus_182;
		word32 s0_184;
		Eq_2 s1_185;
		Eq_2 s3_189;
		word32 s6_401;
		word32 s5_400;
		word32 s4_399;
		word32 s2_398;
		word32 a5_397;
		word32 a2_396;
		word32 a1_395;
		word32 a0_394;
		word32 s0_393;
		word32 s7_402;
		word32 s8_403;
		word32 s9_404;
		word32 s10_405;
		word32 s11_406;
		word32 a0_407;
		word32 a1_408;
		word32 a5_409;
		word32 s2_410;
		word32 s4_411;
		word32 s5_412;
		word32 s6_413;
		word32 s7_414;
		word32 s8_415;
		word32 s9_416;
		word32 s10_417;
		word32 s11_418;
		word32 s0_419;
		word32 s1_420;
		word32 a0_421;
		word32 a1_422;
		word32 a2_423;
		word32 a3_424;
		word32 a4_425;
		word32 a5_426;
		word32 s2_427;
		word32 s3_428;
		word32 s4_429;
		word32 s5_430;
		word32 s6_431;
		word32 s7_432;
		word32 s8_433;
		word32 s9_434;
		word32 s10_435;
		word32 s11_436;
		word32 mstatus_437;
		at_dump_noend(at_dump_noend(at_dump_noend(ra_106, s1_107, 0x230C6900, a2_100, a3_101, a4_102, s3_111, mstatus, dwLoc3C, 0x0401, fp + -47, dwLoc28_278, dwArg1C, dwArg20, dwArg24, dwArg48, dwArg68, dwArg6C, dwArg98, dwArgA8, dwArgD8, out s0_393, out s1_150, out a0_394, out a1_395, out a2_396, out a3_142, out a4_143, out a5_397, out s2_398, out s3_154, out s4_399, out s5_400, out s6_401, out s7_402, out s8_403, out s9_404, out s10_405, out s11_406, out mstatus_147), s1_150, 588009320, (word32) bLoc31_248 & 0x1F, a3_142, a4_143, s3_154, mstatus_147, dwLoc3C, 0x0401, fp + -47, dwLoc28_278, dwArg1C, dwArg20, dwArg24, dwArg48, dwArg68, dwArg6C, dwArg98, dwArgA8, dwArgD8, out s0_184, out s1_185, out a0_407, out a1_408, out a2_176, out a3_177, out a4_178, out a5_409, out s2_410, out s3_189, out s4_411, out s5_412, out s6_413, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out mstatus_182), s1_185, s0_184 + -0x0700, a2_176, a3_177, a4_178, s3_189, mstatus_182, dwLoc3C, 0x0401, fp + -47, dwLoc28_278, dwArg1C, dwArg20, dwArg24, dwArg48, dwArg68, dwArg6C, dwArg98, dwArgA8, dwArgD8, out s0_419, out s1_420, out a0_421, out a1_422, out a2_423, out a3_424, out a4_425, out a5_426, out s2_427, out s3_428, out s4_429, out s5_430, out s6_431, out s7_432, out s8_433, out s9_434, out s10_435, out s11_436, out mstatus_437);
	}
}

// 2307E01A: void scan_handler(Register Eq_2 ra, Stack ptr32 dwArg74, Stack Eq_2 dwArg78, Stack word32 dwArgA4, Stack word32 dwArgC0, Stack ptr32 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void scan_handler(Eq_2 ra, ptr32 dwArg74, Eq_2 dwArg78, word32 dwArgA4, word32 dwArgC0, ptr32 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_116;
	Eq_2 a1_110;
	Eq_2 s1_103;
	Eq_2 ra_109;
	Eq_2 a0_13 = *(union Eq_2 *) 0x00FFF802;
	if ((word32) *(union Eq_2 *) 0x00FFF802 != 61)
	{
		word32 a3_238;
		word32 a2_237;
		word32 s0_236;
		word32 a4_239;
		word32 a5_240;
		word32 s2_241;
		word32 s3_242;
		word32 s4_243;
		word32 s5_244;
		ra_109 = at_get_parameters(ra, a0_13, null, 0x00, null, 0x00FFF802, dwArg74, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_236, out s1_103, out a0_116, out a2_237, out a3_238, out a4_239, out a5_240, out s2_241, out s3_242, out s4_243, out s5_244);
		if (a0_116 != 0x00)
			return;
		a1_110.u0 = 0x00;
	}
	else
	{
		*(union Eq_2 *) 0x00FFF803 = a0_13;
		word32 a0_27;
		int32 a4_30;
		Eq_2 s0_33;
		word32 s5_235;
		word32 s4_234;
		word32 s3_233;
		word32 s2_232;
		word32 a5_231;
		word32 a3_230;
		word32 a2_229;
		ra_109 = at_get_parameters(ra, a0_13, fp + -40, 0x02, fp + -44, 0x00FFF803, dwArg74, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_33, out s1_103, out a0_27, out a2_229, out a3_230, out a4_30, out a5_231, out s2_232, out s3_233, out s4_234, out s5_235);
		if (a0_27 != 0x00 || a4_30 <= 0x01)
			return;
		word32 a1_245;
		word32 a2_246;
		word32 a3_247;
		word32 a4_248;
		word32 a5_249;
		if (strcmp(fp + -48, 588005304, out a1_245, out a2_246, out a3_247, out a4_248, out a5_249) != 0x00)
		{
			word32 a1_250;
			word32 a2_251;
			word32 a3_252;
			word32 a4_253;
			word32 a5_254;
			if (strcmp(fp + -48, 588010700, out a1_250, out a2_251, out a3_252, out a4_253, out a5_254) != 0x00)
				return;
		}
		word32 a1_255;
		word32 a2_256;
		word32 a3_257;
		word32 a4_258;
		word32 a5_259;
		if (strcmp(s0_33, 0x230C9664, out a1_255, out a2_256, out a3_257, out a4_258, out a5_259) != 0x00)
			return;
		a1_110 = s0_33;
		a0_116 = fp + -48;
	}
	at_scan(ra_109, s1_103, a0_116, a1_110);
}

// 2307E0BC: void uart_config_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg4C, Stack word32 dwArg64, Stack int32 dwArg74, Stack word32 dwArg80, Stack ptr32 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack word32 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack word32 dwArg0184)
void uart_config_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg4C, word32 dwArg64, int32 dwArg74, word32 dwArg80, ptr32 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, word32 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, word32 dwArg0184)
{
	word32 t1_451;
	word32 a0_452;
	word32 a1_453;
	word32 a2_454;
	word32 a3_455;
	word32 a4_456;
	word32 a5_457;
	word32 t4_450;
	word32 s11_449;
	word32 s10_448;
	word32 s9_447;
	word32 s8_446;
	word32 s7_445;
	word32 s6_444;
	word32 s5_443;
	word32 s4_442;
	word32 s3_441;
	word32 s2_440;
	word32 a7_439;
	word32 a5_438;
	word32 a4_437;
	word32 a3_436;
	word32 a2_435;
	word32 a1_434;
	word32 a0_433;
	word32 s1_432;
	Eq_2 ra_48 = memset(printf(ra, &g_t230C4ED4, a3, dwLoc68, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_432, out a0_433, out a1_434, out a2_435, out a3_436, out a4_437, out a5_438, out a7_439, out s2_440, out s3_441, out s4_442, out s5_443, out s6_444, out s7_445, out s8_446, out s9_447, out s10_448, out s11_449, out t4_450), fp + -100, 0x00, 0x18, out t1_451, out a0_452, out a1_453, out a2_454, out a3_455, out a4_456, out a5_457);
	Eq_2 s1_65 = *(union Eq_2 *) 0x00FFFC04;
	int32 a4_75 = (word32) *(union Eq_2 *) 0x00FFFC04;
	if (a4_75 != 63)
	{
		if (a4_75 != 61)
			return;
		*(union Eq_2 *) 0x00FFFC05 = s1_65;
		word32 a0_85;
		int32 a5_89;
		word32 s0_458;
		word32 s1_459;
		word32 a2_460;
		word32 a4_461;
		word32 s2_462;
		word32 s3_463;
		word32 s4_464;
		word32 s5_465;
		Eq_2 a3_102;
		Eq_2 ra_103 = at_get_parameters(ra_48, s1_65, fp + -76, 0x05, fp + -0x0068, 0x00FFFC05, fp + -84, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_458, out s1_459, out a0_85, out a2_460, out a3_102, out a4_461, out a5_89, out s2_462, out s3_463, out s4_464, out s5_465);
		if (a0_85 != 0x00)
			return;
		if (a5_89 <= 0x04 && (a5_89 != 0x04 && a5_89 != dwArg74))
		{
			a3_102.u0 = 0x02;
			if (a5_89 != 0x02)
			{
				a3_102.u0 = 0x08;
				if (a5_89 != 0x01)
					return;
			}
		}
		Eq_2 a3_125;
		Eq_2 a3_150;
		Eq_2 a3_175;
		Eq_2 a3_200;
		word32 s1_466;
		word32 a0_467;
		word32 a1_468;
		word32 a2_469;
		word32 a4_470;
		word32 a5_471;
		word32 a7_472;
		word32 s2_473;
		word32 s3_474;
		word32 s4_475;
		word32 s5_476;
		word32 s6_477;
		word32 s7_478;
		word32 s8_479;
		word32 s9_480;
		word32 s10_481;
		word32 s11_482;
		word32 t4_483;
		word32 s1_484;
		word32 a0_485;
		word32 a1_486;
		word32 a2_487;
		word32 a4_488;
		word32 a5_489;
		word32 a7_490;
		word32 s2_491;
		word32 s3_492;
		word32 s4_493;
		word32 s5_494;
		word32 s6_495;
		word32 s7_496;
		word32 s8_497;
		word32 s9_498;
		word32 s10_499;
		word32 s11_500;
		word32 t4_501;
		word32 s1_502;
		word32 a0_503;
		word32 a1_504;
		word32 a2_505;
		word32 a4_506;
		word32 a5_507;
		word32 a7_508;
		word32 s2_509;
		word32 s3_510;
		word32 s4_511;
		word32 s5_512;
		word32 s6_513;
		word32 s7_514;
		word32 s8_515;
		word32 s9_516;
		word32 s10_517;
		word32 s11_518;
		word32 t4_519;
		word32 s1_520;
		word32 a0_521;
		word32 a1_522;
		word32 a2_523;
		word32 a4_524;
		word32 a5_525;
		word32 a7_526;
		word32 s2_527;
		word32 s3_528;
		word32 s4_529;
		word32 s5_530;
		word32 s6_531;
		word32 s7_532;
		word32 s8_533;
		word32 s9_534;
		word32 s10_535;
		word32 s11_536;
		word32 t4_537;
		Eq_2 ra_203 = printf(printf(printf(printf(ra_103, &g_t230C5500, a3_102, dwLoc68, 0x00FFFC04, dwArg00, dwArg04, fp + -92, dwArg4C, out s1_466, out a0_467, out a1_468, out a2_469, out a3_125, out a4_470, out a5_471, out a7_472, out s2_473, out s3_474, out s4_475, out s5_476, out s6_477, out s7_478, out s8_479, out s9_480, out s10_481, out s11_482, out t4_483), &g_t230C5524, a3_125, dwLoc68, 0x00FFFC04, dwArg00, dwArg04, fp + -92, dwArg4C, out s1_484, out a0_485, out a1_486, out a2_487, out a3_150, out a4_488, out a5_489, out a7_490, out s2_491, out s3_492, out s4_493, out s5_494, out s6_495, out s7_496, out s8_497, out s9_498, out s10_499, out s11_500, out t4_501), &g_t230C554C, a3_150, dwLoc68, 0x00FFFC04, dwArg00, dwArg04, fp + -92, dwArg4C, out s1_502, out a0_503, out a1_504, out a2_505, out a3_175, out a4_506, out a5_507, out a7_508, out s2_509, out s3_510, out s4_511, out s5_512, out s6_513, out s7_514, out s8_515, out s9_516, out s10_517, out s11_518, out t4_519), &g_t230C5570, a3_175, dwLoc68, 0x00FFFC04, dwArg00, dwArg04, fp + -92, dwArg4C, out s1_520, out a0_521, out a1_522, out a2_523, out a3_200, out a4_524, out a5_525, out a7_526, out s2_527, out s3_528, out s4_529, out s5_530, out s6_531, out s7_532, out s8_533, out s9_534, out s10_535, out s11_536, out t4_537);
		0x00 = dwArg0104;
		Eq_2 a3_224;
		word32 s1_538;
		word32 a0_539;
		word32 a1_540;
		word32 a2_541;
		word32 a4_542;
		word32 a5_543;
		word32 a7_544;
		word32 s2_545;
		word32 s3_546;
		word32 s4_547;
		word32 s5_548;
		word32 s6_549;
		word32 s7_550;
		word32 s8_551;
		word32 s9_552;
		word32 s10_553;
		word32 s11_554;
		word32 t4_555;
		Eq_2 ra_227 = printf(ra_203, &g_t230C5598, a3_200, dwLoc68, 0x00FFFC04, dwArg00, dwArg04, fp + -92, dwArg4C, out s1_538, out a0_539, out a1_540, out a2_541, out a3_224, out a4_542, out a5_543, out a7_544, out s2_545, out s3_546, out s4_547, out s5_548, out s6_549, out s7_550, out s8_551, out s9_552, out s10_553, out s11_554, out t4_555);
		0x00 = dwArg0184;
		at_uart_config(ra_227, a3_224);
	}
	else
		at_uart_config_get(ra_48, 63, mstatus);
}

// 2307E1DA: void reset_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Stack ptr32 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgC4, Stack word32 dwArgE0, Stack ptr32 dwArgE4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void reset_handler(Eq_2 ra, Eq_2 a0, Eq_4455 a5, ptr32 dwArg94, Eq_2 dwArg98, word32 dwArgC4, word32 dwArgE0, ptr32 dwArgE4, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a0_11;
	word32 s5_81;
	word32 s4_80;
	word32 s3_79;
	word32 s2_78;
	word32 a5_77;
	word32 a4_76;
	word32 a3_75;
	word32 a2_74;
	word32 s1_73;
	word32 s0_72;
	Eq_2 ra_29 = at_get_parameters(ra, a0, null, 0x00, null, a5, dwArg94, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s0_72, out s1_73, out a0_11, out a2_74, out a3_75, out a4_76, out a5_77, out s2_78, out s3_79, out s4_80, out s5_81);
	if (a0_11 != 0x00)
		return;
	at_reset(ra_29);
}

// 2307E1FA: void echo_on_handler(Register Eq_2 ra, Register word32 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack ptr32 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack word32 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgC0, Stack ptr32 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void echo_on_handler(Eq_2 ra, word32 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, ptr32 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, word32 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgC0, ptr32 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 s3_30;
	word32 s5_379;
	word32 s4_378;
	word32 s2_377;
	word32 a7_376;
	word32 a5_375;
	word32 a4_374;
	word32 a3_373;
	word32 a2_372;
	word32 a1_371;
	word32 a0_370;
	word32 s1_369;
	word32 s6_380;
	word32 s7_381;
	word32 s8_382;
	word32 s9_383;
	word32 s10_384;
	word32 s11_385;
	word32 t4_386;
	Eq_2 ra_25 = printf(ra, &g_t230C4ED4, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_369, out a0_370, out a1_371, out a2_372, out a3_373, out a4_374, out a5_375, out a7_376, out s2_377, out s3_30, out s4_378, out s5_379, out s6_380, out s7_381, out s8_382, out s9_383, out s10_384, out s11_385, out t4_386);
	Eq_2 s0_44 = *(union Eq_2 *) 0x00FFFC04;
	int32 a4_48 = (word32) *(union Eq_2 *) 0x00FFFC04;
	Eq_2 dwLoc1C_285 = SEQ(SLICE(s0, word24, 8), 0x03);
	if (a4_48 != 63)
	{
		if (a4_48 != 61)
			return;
		*(union Eq_2 *) 0x00FFFC05 = s0_44;
		word32 a0_57;
		int32 a5_61;
		Eq_2 s1_69;
		word32 s0_435;
		word32 a2_436;
		word32 a3_437;
		word32 a4_438;
		word32 s2_439;
		word32 s3_440;
		word32 s4_441;
		word32 s5_442;
		Eq_2 ra_75 = at_get_parameters(ra_25, s0_44, fp + -28, 0x01, fp + -32, 0x00FFFC05, dwArg74, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_435, out s1_69, out a0_57, out a2_436, out a3_437, out a4_438, out a5_61, out s2_439, out s3_440, out s4_441, out s5_442);
		if (a0_57 != 0x00 || (a5_61 <= 0x00 || a5_61 > 0x01))
			return;
		*(int32 *) 0x42028F44 = a5_61;
		word32 s0_443;
		word32 s1_444;
		word32 a0_445;
		word32 s4_446;
		word32 mstatus_447;
		at_key_value_set(ra_75, s1_69, 588007332, s1_69, mstatus, dwLoc2C, dwLoc28, dwLoc1C_285, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc04, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgD8, out s0_443, out s1_444, out a0_445, out s4_446, out mstatus_447);
	}
	else
	{
		Eq_2 a2_122;
		Eq_2 a3_123;
		Eq_2 a4_124;
		Eq_2 s1_129;
		Eq_2 s3_133;
		Eq_2 a2_152;
		Eq_2 a3_153;
		Eq_2 a4_154;
		ptr32 mstatus_158;
		Eq_2 s1_161;
		Eq_2 s3_165;
		Eq_2 a2_184;
		Eq_2 a3_185;
		Eq_2 a4_186;
		ptr32 mstatus_190;
		word32 s0_192;
		Eq_2 s1_193;
		Eq_2 s3_197;
		word32 a0_387;
		word32 a5_388;
		word32 s2_389;
		word32 s4_390;
		word32 s0_391;
		word32 a0_392;
		word32 a1_393;
		word32 a5_394;
		word32 s2_395;
		word32 s4_396;
		word32 s5_397;
		word32 s6_398;
		word32 s7_399;
		word32 s8_400;
		word32 s9_401;
		word32 s10_402;
		word32 s11_403;
		word32 a0_404;
		word32 a1_405;
		word32 a5_406;
		word32 s2_407;
		word32 s4_408;
		word32 s5_409;
		word32 s6_410;
		word32 s7_411;
		word32 s8_412;
		word32 s9_413;
		word32 s10_414;
		word32 s11_415;
		word32 s0_416;
		word32 s1_417;
		word32 a0_418;
		word32 a1_419;
		word32 a2_420;
		word32 a3_421;
		word32 a4_422;
		word32 a5_423;
		word32 s2_424;
		word32 s3_425;
		word32 s4_426;
		word32 s5_427;
		word32 s6_428;
		word32 s7_429;
		word32 s8_430;
		word32 s9_431;
		word32 s10_432;
		word32 s11_433;
		word32 mstatus_434;
		at_dump_noend(at_dump_noend(at_dump_noend(at_key_value_get(ra_25, s0_44, 588007332, fp + -32, s3_30, mstatus, dwLoc28, dwArg08, dwArg20, dwArg24, dwArg38, dwArg48, dwArg6C, dwArg78, dwArgB8, out s1_129, out a0_387, out a2_122, out a3_123, out a4_124, out a5_388, out s2_389, out s3_133, out s4_390), s1_129, 0x230C6900, a2_122, a3_123, a4_124, s3_133, mstatus, dwLoc2C, dwLoc20, dwLoc1C_285, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_391, out s1_161, out a0_392, out a1_393, out a2_152, out a3_153, out a4_154, out a5_394, out s2_395, out s3_165, out s4_396, out s5_397, out s6_398, out s7_399, out s8_400, out s9_401, out s10_402, out s11_403, out mstatus_158), s1_161, 588009248, a2_152, a3_153, a4_154, s3_165, mstatus_158, dwLoc2C, dwLoc20, dwLoc1C_285, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_192, out s1_193, out a0_404, out a1_405, out a2_184, out a3_185, out a4_186, out a5_406, out s2_407, out s3_197, out s4_408, out s5_409, out s6_410, out s7_411, out s8_412, out s9_413, out s10_414, out s11_415, out mstatus_190), s1_193, s0_192 + -0x0700, a2_184, a3_185, a4_186, s3_197, mstatus_190, dwLoc2C, dwLoc20, dwLoc1C_285, dwLoc18, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgE8, out s0_416, out s1_417, out a0_418, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out s2_424, out s3_425, out s4_426, out s5_427, out s6_428, out s7_429, out s8_430, out s9_431, out s10_432, out s11_433, out mstatus_434);
	}
}

// 2307E2BE: void disconnect_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void disconnect_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	byte * a5_16;
	Eq_2 a3_20;
	word32 s1_123;
	word32 a0_124;
	word32 a1_125;
	word32 a2_126;
	word32 a4_127;
	word32 a7_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s5_132;
	word32 s6_133;
	word32 s7_134;
	word32 s8_135;
	word32 s9_136;
	word32 s10_137;
	word32 s11_138;
	word32 t4_139;
	Eq_2 ra_23 = printf(ra, &g_t230C4ED4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_123, out a0_124, out a1_125, out a2_126, out a3_20, out a4_127, out a5_16, out a7_128, out s2_129, out s3_130, out s4_131, out s5_132, out s6_133, out s7_134, out s8_135, out s9_136, out s10_137, out s11_138, out t4_139);
	if ((word32) *a5_16 != 61)
	{
		Eq_2 a3_44;
		Eq_2 a4_45;
		Eq_2 a5_46;
		word32 s1_140;
		word32 a0_141;
		word32 a1_142;
		word32 a2_143;
		word32 a3_144;
		word32 a4_145;
		word32 a5_146;
		word32 s2_147;
		word32 s3_148;
		word32 s4_149;
		vTaskDelay(200, at_disconnect(ra_23, a3_20, out a3_44, out a4_45, out a5_46), a3_44, a4_45, a5_46, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_140, out a0_141, out a1_142, out a2_143, out a3_144, out a4_145, out a5_146, out s2_147, out s3_148, out s4_149);
	}
}

// 2307E300: void restore_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Stack ptr32 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgC4, Stack word32 dwArgE0, Stack ptr32 dwArgE4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void restore_handler(Eq_2 ra, Eq_2 a0, Eq_4455 a5, ptr32 dwArg94, Eq_2 dwArg98, word32 dwArgC4, word32 dwArgE0, ptr32 dwArgE4, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a0_11;
	Eq_2 a3_28;
	word32 a4_103;
	word32 a2_102;
	word32 s1_101;
	word32 s0_100;
	word32 a5_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	Eq_2 ra_29 = at_get_parameters(ra, a0, null, 0x00, null, a5, dwArg94, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s0_100, out s1_101, out a0_11, out a2_102, out a3_28, out a4_103, out a5_104, out s2_105, out s3_106, out s4_107, out s5_108);
	if (a0_11 != 0x00)
		return;
	at_restore(ra_29, a3_28);
}

