pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307E320: void version_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Stack ptr32 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgC4, Stack word32 dwArgE0, Stack ptr32 dwArgE4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void version_handler(Eq_2 ra, Eq_2 a0, Eq_4455 a5, ptr32 dwArg94, Eq_2 dwArg98, word32 dwArgC4, word32 dwArgE0, ptr32 dwArgE4, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a0_11;
	Eq_2 a3_28;
	word32 a4_103;
	word32 a2_102;
	word32 s1_101;
	word32 s0_100;
	word32 a5_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	Eq_2 ra_29 = at_get_parameters(ra, a0, null, 0x00, null, a5, dwArg94, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s0_100, out s1_101, out a0_11, out a2_102, out a3_28, out a4_103, out a5_104, out s2_105, out s3_106, out s4_107, out s5_108);
	if (a0_11 != 0x00)
		return;
	at_version(ra_29, a3_28);
}

// 2307E340: void at_help(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      help_handler
void at_help(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 s1_12 = 0x230C7000;
	Eq_2 s3_13 = 0x230C5000;
	do
	{
		Eq_2 a2_37;
		Eq_2 a3_38;
		Eq_2 a4_39;
		ptr32 mstatus_43;
		Eq_2 s1_46;
		Eq_2 s3_50;
		Eq_2 a2_70;
		Eq_2 a3_71;
		Eq_2 a4_72;
		ptr32 mstatus_76;
		Eq_2 s1_79;
		Eq_2 s3_83;
		Eq_2 a2_100;
		Eq_2 a3_101;
		Eq_2 a4_102;
		Eq_2 a5_103;
		Eq_2 s5_115;
		word32 s6_381;
		word32 s5_380;
		word32 s4_379;
		word32 s2_378;
		word32 a5_377;
		word32 a1_376;
		word32 a0_375;
		word32 s0_374;
		word32 s11_373;
		word32 s10_372;
		word32 s9_371;
		word32 s8_370;
		word32 s7_369;
		word32 s6_368;
		word32 s5_367;
		word32 s4_366;
		word32 s2_365;
		word32 a5_364;
		word32 a1_363;
		word32 a0_362;
		word32 s0_361;
		word32 s11_386;
		word32 s0_387;
		word32 s9_384;
		word32 s10_385;
		word32 s7_382;
		word32 s8_383;
		word32 s1_388;
		word32 a0_389;
		word32 a1_390;
		word32 s2_391;
		word32 s3_392;
		word32 s4_393;
		word32 s6_394;
		word32 s7_395;
		word32 s8_396;
		word32 s9_397;
		word32 s10_398;
		word32 s11_399;
		ra = at_dump_noend(at_dump_noend(at_dump_noend(ra, s1_12, (word32) s1_12 - 0x0700, a2, a3, a4, s3_13, mstatus, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_361, out s1_46, out a0_362, out a1_363, out a2_37, out a3_38, out a4_39, out a5_364, out s2_365, out s3_50, out s4_366, out s5_367, out s6_368, out s7_369, out s8_370, out s9_371, out s10_372, out s11_373, out mstatus_43), s1_46, (word32) s3_50 - 504, a2_37, a3_38, a4_39, s3_50, mstatus_43, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_374, out s1_79, out a0_375, out a1_376, out a2_70, out a3_71, out a4_72, out a5_377, out s2_378, out s3_83, out s4_379, out s5_380, out s6_381, out s7_382, out s8_383, out s9_384, out s10_385, out s11_386, out mstatus_76), s1_79, (word32) s1_79 - 0x0700, a2_70, a3_71, a4_72, s3_83, mstatus_76, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_387, out s1_388, out a0_389, out a1_390, out a2_100, out a3_101, out a4_102, out a5_103, out s2_391, out s3_392, out s4_393, out s5_115, out s6_394, out s7_395, out s8_396, out s9_397, out s10_398, out s11_399, out mstatus);
		word32 a0_400;
		word32 a1_401;
		word32 a5_402;
		word32 s4_403;
		word32 s2_137;
	} while (vTaskDelay(0x0A, a2_100, a3_101, a4_102, a5_103, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158, out s1_12, out a0_400, out a1_401, out a2, out a3, out a4, out a5_402, out s2_137, out s3_13, out s4_403) != s5_115);
	Eq_2 s0_143 = 0x00;
	Eq_2 s1_144 = 0x4200F000;
	Eq_2 s3_145 = 0x4200F000;
	while (s0_143 < *((word32) s1_144 + 0x06E0))
	{
		Eq_2 a2_162;
		Eq_2 a3_163;
		ptr32 mstatus_168;
		word32 s0_170;
		Eq_2 s1_171;
		Eq_2 s3_175;
		word32 s4_176;
		word32 s5_177;
		Eq_2 a2_197;
		Eq_2 a3_198;
		Eq_2 a4_199;
		ptr32 mstatus_203;
		Eq_2 s1_206;
		word32 s2_209;
		Eq_2 s3_210;
		Eq_2 a2_227;
		Eq_2 a3_228;
		Eq_2 a4_229;
		Eq_2 a5_230;
		word32 a0_404;
		word32 a1_405;
		word32 a4_406;
		word32 a5_407;
		word32 s2_408;
		word32 s6_409;
		word32 s7_410;
		word32 s8_411;
		word32 s9_412;
		word32 s10_413;
		word32 s11_414;
		word32 s0_415;
		word32 a0_416;
		word32 a1_417;
		word32 a5_418;
		word32 s4_419;
		word32 s5_420;
		word32 s6_421;
		word32 s7_422;
		word32 s8_423;
		word32 s9_424;
		word32 s10_425;
		word32 s11_426;
		word32 s0_427;
		word32 s1_428;
		word32 a0_429;
		word32 a1_430;
		word32 s2_431;
		word32 s3_432;
		word32 s4_433;
		word32 s5_434;
		word32 s6_435;
		word32 s7_436;
		word32 s8_437;
		word32 s9_438;
		word32 s10_439;
		word32 s11_440;
		ra = at_dump_noend(at_dump_noend(at_dump_noend(ra, s1_144, s2_137 + -0x0700, a2, a3, a4, s3_145, mstatus, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_170, out s1_171, out a0_404, out a1_405, out a2_162, out a3_163, out a4_406, out a5_407, out s2_408, out s3_175, out s4_176, out s5_177, out s6_409, out s7_410, out s8_411, out s9_412, out s10_413, out s11_414, out mstatus_168), s1_171, s4_176 + -504, a2_162, a3_163, s0_170 + s5_177, s3_175, mstatus_168, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_415, out s1_206, out a0_416, out a1_417, out a2_197, out a3_198, out a4_199, out a5_418, out s2_209, out s3_210, out s4_419, out s5_420, out s6_421, out s7_422, out s8_423, out s9_424, out s10_425, out s11_426, out mstatus_203), s1_206, s2_209 + -0x0700, a2_197, a3_198, a4_199, s3_210, mstatus_203, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_427, out s1_428, out a0_429, out a1_430, out a2_227, out a3_228, out a4_229, out a5_230, out s2_431, out s3_432, out s4_433, out s5_434, out s6_435, out s7_436, out s8_437, out s9_438, out s10_439, out s11_440, out mstatus);
		word32 a0_441;
		word32 a1_442;
		word32 a5_443;
		word32 s4_444;
		s0_143 = vTaskDelay(0x0A, a2_227, a3_228, a4_229, a5_230, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158, out s1_144, out a0_441, out a1_442, out a2, out a3, out a4, out a5_443, out s2_137, out s3_145, out s4_444);
	}
}

