pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307E3E8: void help_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_4455 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack ptr32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack word32 dwArgC4, Stack Eq_2 dwArgC8, Stack word32 dwArgE0, Stack ptr32 dwArgE4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void help_handler(Eq_2 ra, Eq_2 a0, Eq_4455 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg88, Eq_2 dwArg8C, ptr32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB8, word32 dwArgC4, Eq_2 dwArgC8, word32 dwArgE0, ptr32 dwArgE4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	word32 a0_11;
	Eq_2 a4_14;
	Eq_2 s4_18;
	Eq_2 s1_23;
	Eq_2 a3_28;
	word32 s0_128;
	word32 a2_129;
	word32 a5_130;
	word32 s2_131;
	word32 s3_132;
	word32 s5_133;
	Eq_2 ra_29 = at_get_parameters(ra, a0, null, 0x00, null, a5, dwArg94, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s0_128, out s1_23, out a0_11, out a2_129, out a3_28, out a4_14, out a5_130, out s2_131, out s3_132, out s4_18, out s5_133);
	if (a0_11 != 0x00)
		return;
	at_help(ra_29, s1_23, dwArg10, a3_28, a4_14, s4_18, mstatus, dwArg04, dwArg08, dwArg3C, dwArg40, dwArg44, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, dwArg0118, dwArg0158);
}

// 2307E408: Register Eq_2 at_init(Register Eq_2 ra, Register ptr32 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_450433) a5Out)
// Called from:
//      at_cmd_init
Eq_2 at_init(Eq_2 ra, ptr32 a0, ptr32 & a3Out, ptr32 & a4Out, struct Eq_450433 & a5Out)
{
	word32 t1_71;
	word32 a0_72;
	word32 a1_73;
	word32 a2_74;
	ptr32 a3_19;
	ptr32 a4_20;
	struct Eq_450433 * a5_21;
	Eq_2 ra_22 = memset(ra, 0x42027944, 0x00, 0x08, out t1_71, out a0_72, out a1_73, out a2_74, out a3_19, out a4_20, out a5_21);
	if (a0 != 0x00)
	{
		a5_21->t0000.u0 = 0x42027944;
		a5_21->dw0004 = 0x42027944;
		word32 t1_75;
		word32 a0_76;
		word32 a1_77;
		word32 a2_78;
		ra_22 = memset(ra_22, 1107410652, 0x00, 0x0408, out t1_75, out a0_76, out a1_77, out a2_78, out a3_19, out a4_20, out a5_21);
	}
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	return ra_22;
}

// 2307E450: void at_command_register(Register word32 a0, Register int32 a1)
// Called from:
//      usr_at_cmd_register
void at_command_register(word32 a0, int32 a1)
{
	if (a0 == 0x00)
		return;
	g_dw4200F6DC = a0;
	g_dw4200F6E0 = a1;
}

// 2307E46A: void at_parse(Register Eq_2 ra, Register ptr32 mstatus)
// Called from:
//      at_cmd_exec
void at_parse(Eq_2 ra, ptr32 mstatus)
{
	struct Eq_460206 * sp_134 = fp + -0x0080;
	word32 a2_767;
	word32 a1_766;
	word32 a5_763;
	word32 a3_761;
	word32 a2_760;
	word32 a0_758;
	word32 t1_757;
	word32 a3_768;
	word32 a5_769;
	word32 t1_764;
	word32 a0_765;
	word32 a4_762;
	word32 a1_759;
	struct Eq_460223 * a4_167;
	Eq_2 ra_104 = memset(memset(ra, 0x4202794C, 0x00, 0x0518, out t1_757, out a0_758, out a1_759, out a2_760, out a3_761, out a4_762, out a5_763), 1107410652, 0x00, 0x0408, out t1_764, out a0_765, out a1_766, out a2_767, out a3_768, out a4_167, out a5_769);
	while (true)
	{
l2307E4C8:
		word32 a0_69;
		word32 s11_81;
		word32 a5_782;
		Eq_2 a3_117;
		Eq_2 s3_107;
		word32 s2_106;
		struct Eq_460463 * s7_111;
		word32 s8_112;
		word32 s4_108;
		struct Eq_460253 * s5_109;
		Eq_2 s6_110;
		Eq_2 s10_113;
		int32 s9_129;
		Eq_2 s1_100;
		Eq_2 s0_105;
		ra_104 = at_queue_get(ra_104, sp_134 + 23, a4_167, out s0_105, out s1_100, out a0_69, out a3_117, out a4_167, out a5_782, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s7_111, out s8_112, out s9_129, out s10_113, out s11_81);
		if (a0_69 != 0x00)
			break;
		struct Eq_460252 * a5_116 = s5_109[224];
		if (a5_116 != null)
		{
			<anonymous> * a5_96 = g_ptr42027948;
			a5_96();
		}
		struct Eq_460259 * s11_127 = (word32) s1_100 - 1716;
		s9_129 = s11_127->dw0000;
		if (s9_129 == 0x00)
		{
			struct Eq_460223 * a4_187 = (word32) sp_134[23];
			s0_105 = a5_116->dw0000;
			if (a4_187 == (struct Eq_460223 *) 0x0A)
			{
				a3_117.u0 = 0x03FF;
				if (a5_116 > (struct Eq_460252 *) 0x03FF)
					goto l2307E670;
				a3_117 = a5_116 + 1;
				*a3_117 = s0_105;
				a5_116 += s0_105;
				goto l2307E510;
			}
			a3_117.u0 = 0x0D;
			if (a4_187 != (struct Eq_460223 *) 0x0D)
				goto l2307E516;
			a5_116[1] = (struct Eq_460252) s0_105;
			Mem196[a5_116 + s0_105 + 4:byte] = SLICE(a4_187, byte, 0);
			word32 a0_197;
			struct Eq_460223 * a4_205;
			struct Eq_460252 * s11_209;
			ra_104 = at_queue_peek(ra_104, sp_134 + 23, a4_187, out s1_100, out a0_197, out a3_117, out a4_205, out a5_116, out s2_106, out s4_108, out s5_109, out s6_110, out s7_111, out s8_112, out s9_129, out s10_113, out s11_209);
			if (a0_197 == 0x00)
			{
				a5_116 = (word32) sp_134[23];
				if (a5_116 != s11_209)
					goto l2307E514;
				struct Eq_461038 * a5_226;
				word32 s11_836;
				word32 a4_834;
				word32 s3_835;
				word32 s0_832;
				word32 a0_833;
				ra_104 = at_queue_get(ra_104, sp_134 + 23, a4_205, out s0_832, out s1_100, out a0_833, out a3_117, out a4_834, out a5_226, out s2_106, out s3_835, out s4_108, out s5_109, out s6_110, out s7_111, out s8_112, out s9_129, out s10_113, out s11_836);
				s0_105 = a5_226->t0000;
				if (a5_226 > (struct Eq_461038 *) 0x03FF)
					goto l2307E670;
				a5_226->t0001 = s0_105;
				a5_116 = a5_226 + s0_105;
				a4_187 = (word32) sp_134[23];
l2307E510:
				a5_116[4] = (struct Eq_460252) (byte) a4_187;
			}
l2307E514:
			s3_107.u0 = 0x01;
		}
		else
		{
			a5_116 = (struct Eq_460252 *) 0x01;
			if (s9_129 == 0x01)
			{
				word32 a5_818;
				Eq_2 a0_131 = xTaskGetTickCount(out a5_818);
				Eq_460912 a5_133 = s11_127->t0004;
				word32 a2_135 = (word32) sp_134[23];
				s11_127->t0004 = (word32) a5_133 + 1;
				Mem140[a5_133 + s11_127 + 0x0112:byte] = SLICE(a2_135, byte, 0);
				s6_110 = a0_131;
				a3_117 = (word32) a5_133 + 1;
				a5_116 = s11_127->ptr000C;
				s4_108 = 0x01;
				if ((word32) a5_133 + 1 >= a5_116)
				{
					if (a5_133 > -1022)
						s11_127->t0004.u0 = 0x00;
					word32 a5_825;
					word32 a2_822;
					word32 a3_823;
					word32 a4_824;
					word32 t1_819;
					word32 a0_820;
					word32 a1_821;
					ra_104 = memset(ra_104, s2_106 + -292, 0x00, 0x0408, out t1_819, out a0_820, out a1_821, out a2_822, out a3_823, out a4_824, out a5_825);
					word32 a7_831;
					word32 a3_828;
					word32 a5_829;
					word32 a6_830;
					word32 a1_826;
					word32 a2_827;
					memcpy(s10_113, 588009008, 0x15, out a1_826, out a2_827, out a3_828, out a4_167, out a5_829, out a6_830, out a7_831);
					*(union Eq_2 *) 0x15 = s0_105;
					continue;
				}
			}
		}
l2307E516:
		s0_105 = a5_116->dw0000;
		if (a5_116 <= (struct Eq_460252 *) 0x03FF)
		{
			a5_116[1] = (struct Eq_460252) s0_105;
			a4_167 = (word32) sp_134[23];
			Mem310[a5_116 + s0_105 + 4:byte] = SLICE(a4_167, byte, 0);
			break;
		}
l2307E670:
		*s0_105 = 0x00;
		word32 s11_816;
		word32 t4_817;
		word32 s10_815;
		word32 s7_812;
		word32 s8_813;
		word32 s9_814;
		word32 s4_809;
		word32 s5_810;
		word32 s6_811;
		word32 s3_808;
		word32 s2_807;
		word32 a7_806;
		word32 a3_804;
		word32 a5_805;
		word32 a0_801;
		word32 a1_802;
		word32 a2_803;
		word32 s1_800;
		ra_104 = printf(ra_104, &g_t230C4E10, a3_117, sp_134[8], sp_134[40], sp_134[112], sp_134[116], sp_134[0x0098], sp_134[188], out s1_800, out a0_801, out a1_802, out a2_803, out a3_804, out a4_167, out a5_805, out a7_806, out s2_807, out s3_808, out s4_809, out s5_810, out s6_811, out s7_812, out s8_813, out s9_814, out s10_815, out s11_816, out t4_817);
	}
	if (s4_108 != 0x00)
	{
		word32 a5_770;
		if (xTaskGetTickCount(out a5_770) - s6_110 > 0x02000710)
		{
			Eq_2 a2_352;
			Eq_2 a3_353;
			Eq_2 a4_354;
			word32 t1_778;
			word32 a3_775;
			word32 a2_774;
			word32 a0_779;
			word32 t1_771;
			word32 a0_772;
			word32 a4_776;
			word32 a1_780;
			word32 a5_781;
			word32 a5_777;
			word32 a1_773;
			ra_104 = at_response(memset(memset(ra_104, (word32) s1_100 - 1716, 0x00, 0x0518, out t1_771, out a0_772, out a1_773, out a2_774, out a3_775, out a4_776, out a5_777), s2_106 + -292, 0x00, 0x0408, out t1_778, out a0_779, out a1_780, out a2_352, out a3_353, out a4_354, out a5_781), s1_100, 0x18, a2_352, a3_353, a4_354, s3_107, mstatus, sp_134[4], sp_134[8], sp_134[16], sp_134[20], sp_134[24], sp_134[40], sp_134[60], sp_134[64], sp_134[0x0044], sp_134[92], sp_134[96], sp_134[100], sp_134[0x0068], sp_134[112], sp_134[116], sp_134[0x0088], sp_134[0x008C], sp_134[0x0098], sp_134[0x00A8], sp_134[0x00AC], sp_134[0x00B8], sp_134[188], sp_134[200], sp_134[0x00D8], sp_134[232], sp_134[0x00F8], sp_134[0x0118], out s0_105, out s1_100, out a4_167, out s2_106, out s3_107, out s5_109, out s6_110, out s7_111, out s8_112, out s9_129, out s10_113, out mstatus);
			s4_108 = 0x00;
		}
	}
	if (s3_107 != 0x00)
	{
		union Eq_2 * s3_403 = s2_106 + -292;
		Eq_2 a3_405 = *s3_403;
		Eq_2 a5_406 = 0x00;
		Eq_2 s3_407 = (char *) s3_403 + 4;
		Eq_2 a2_408 = 61;
		Eq_2 a1_409 = 0x0A;
		while (true)
		{
			Eq_2 s11_433;
			ptr32 mstatus_617;
			if (a5_406 >= a3_405)
				break;
			ui32 a4_416 = (word32) *s3_407;
			if ((a4_416 & 0x00FD) == 61 || (a4_416 == 0x0A || a4_416 == 0x0D))
				break;
			if (a5_406 == 32)
				goto l2307E69A;
			Mem426[sp_134 + 28 + a5_406:byte] = SLICE(a4_416, byte, 0);
			s3_407 = (word32) s3_407 + 1;
			a5_406 = (word32) a5_406 + 1;
		}
		Mem432[sp_134 + 64 + a5_406 + 4060:byte] = 0x00;
		s11_433.u0 = 0x01;
		if (a5_406 != 0x00)
		{
			<anonymous> * a5_473;
			Eq_2 a5_442[] = s7_111[0x06DC];
			int32 a2_444 = g_dw4200F6E0;
			int32 s11_445 = 0x00;
			if (a5_442 != null)
			{
				for (; s11_445 < a2_444; ++s11_445)
				{
					sp_134[0x0080] = (struct Eq_460206) a5_442;
					sp_134[0x0084] = (struct Eq_460206) a2_444;
					int32 a4_450 = s11_445 + 0x0C;
					Eq_2 a1_457 = a5_442[a4_450 / 4];
					sp_134[4] = (struct Eq_460206) a4_450;
					struct Eq_460756 * a4_463;
					word32 a3_798;
					word32 a5_799;
					Eq_2 a0_459 = strcmp(sp_134 + 28, a1_457, out a1_409, out a2_408, out a3_798, out a4_463, out a5_799);
					a5_442 = &g_t4200F000;
					s0_105 = sp_134[0x00C4];
					if (a0_459 == 0x00)
					{
						a3_405 = g_t4200F000;
						a5_473 = a4_463->ptr4200F004;
l2307E71A:
						if (a5_473 == null)
							goto l2307E69A;
						sp_134[0x0C] = (struct Eq_460206) s3_407;
						Eq_2 a0_592;
						a5_473();
						s11_433 = a0_592;
						mstatus = mstatus_617;
						goto l2307E69C;
					}
					a2_444 = (int32) sp_134[0x0084];
				}
			}
			word32 s11_489;
			for (s11_489 = 0x0C; s11_489 != 0x10; ++s11_489)
			{
				sp_134[0x0080] = (struct Eq_460206) *a1_409;
				word32 a5_784;
				word32 a4_783;
				if (strcmp(sp_134 + 28, a1_409, out a1_409, out a2_408, out a3_405, out a4_783, out a5_784) == 0x00)
				{
					struct Eq_460576 * s11_507 = s11_489 + 0x00;
					s11_445 = (char *) s11_507 + 588008632;
					a5_473 = s11_507->ptr230C4CBC;
					goto l2307E71A;
				}
			}
l2307E69A:
			s11_433.u0 = 0x03;
		}
l2307E69C:
		Eq_2 a4_630 = *((word32) s1_100 - 1716);
		if (a4_630 == 0x01 && s11_433 != 0x17)
		{
			word32 a5_797;
			word32 a1_796;
			word32 a0_795;
			word32 t1_794;
			ra_104 = memset(ra_104, (word32) s1_100 - 1716, 0x00, 0x0518, out t1_794, out a0_795, out a1_796, out a2_408, out a3_405, out a4_630, out a5_797);
		}
		word32 s6_789;
		word32 s5_788;
		word32 s3_787;
		word32 s2_786;
		word32 s1_785;
		word32 * s0_704;
		word32 s10_793;
		word32 s9_792;
		word32 s8_791;
		word32 s7_790;
		ra_104 = at_response(ra_104, s1_100, s11_433, a2_408, a3_405, a4_630, s3_407, mstatus, sp_134[4], sp_134[8], sp_134[16], sp_134[20], sp_134[24], sp_134[40], sp_134[60], sp_134[64], sp_134[0x0044], sp_134[92], sp_134[96], sp_134[100], sp_134[0x0068], sp_134[112], sp_134[116], sp_134[0x0088], sp_134[0x008C], sp_134[0x0098], sp_134[0x00A8], sp_134[0x00AC], sp_134[0x00B8], sp_134[188], sp_134[200], sp_134[0x00D8], sp_134[232], sp_134[0x00F8], sp_134[0x0118], out s0_704, out s1_785, out a4_167, out s2_786, out s3_787, out s5_788, out s6_789, out s7_790, out s8_791, out s9_792, out s10_793, out mstatus);
		*s0_704 = 0x00;
	}
	goto l2307E4C8;
}

// 2307E72E: void at_callback_do(Register ptr32 a1)
// Called from:
//      ble_sync_mode
//      set_ip_handler
//      create_tcp_udp_handler
//      close_network_handler
//      send_data_handler
//      ap_server_handler
//      client_ssl_config_path
//      client_ssl_set_sni
//      client_ssl_set_alpn
void at_callback_do(ptr32 a1)
{
	g_ptr42027E64 = a1;
	<anonymous> * t1_8 = g_ptr42027944;
	if (t1_8 == null)
		return;
	t1_8();
}

// 2307E74C: void ble_sync_mode(Register Eq_2 ra, Register ptr32 mstatus)
void ble_sync_mode(Eq_2 ra, ptr32 mstatus)
{
	Eq_2 a2_24;
	word32 a5_401;
	word32 a4_400;
	word32 a1_398;
	word32 a3_399;
	word32 t1_396;
	word32 a0_397;
	Eq_2 ra_28 = memset(ra, fp + -572, 0x00, 0x0100, out t1_396, out a0_397, out a1_398, out a2_24, out a3_399, out a4_400, out a5_401);
	Eq_2 s1_43 = g_t230C4FB0;
	Eq_2 a4_46 = (word32) g_t230C4FB0;
	if (a4_46 != 63)
	{
		if (a4_46 != 61)
			return;
		g_t230C4FB1 = s1_43;
		word32 a0_55;
		int32 a5_59;
		word32 s4_62;
		word32 s2_68;
		word32 s3_69;
		word32 s0_447;
		word32 s1_448;
		word32 a2_449;
		word32 a3_450;
		word32 a4_451;
		word32 s5_452;
		at_get_parameters(ra_28, s1_43, fp + -596, 0x01, fp + -600, 588009393, dwLoc01BC, dwLoc01B8, dwLoc018C, dwLoc0170, dwLoc016C, dwLoc0148, dwLoc0128, dwLoc0108, dwLocE8, dwLocC8, out s0_447, out s1_448, out a0_55, out a2_449, out a3_450, out a4_451, out a5_59, out s2_68, out s3_69, out s4_62, out s5_452);
		if (a0_55 != 0x00 || a5_59 <= 0x00)
			return;
		word32 a1_453;
		word32 a2_454;
		word32 a3_455;
		word32 a4_456;
		word32 a5_457;
		if (strcmp(dwLoc017C, s4_62 + -1020, out a1_453, out a2_454, out a3_455, out a4_456, out a5_457) == 0x00)
			g_dw4200F6E4 = 0x00;
		else
		{
			word32 a5_109 = 0x01;
			word32 a1_458;
			word32 a2_459;
			word32 a3_460;
			word32 a4_461;
			word32 a5_462;
			if (strcmp(dwLoc017C, s3_69 + -0x041C, out a1_458, out a2_459, out a3_460, out a4_461, out a5_462) != 0x00)
			{
				word32 a1_463;
				word32 a2_464;
				word32 a3_465;
				word32 a4_466;
				word32 a5_467;
				if (strcmp(dwLoc017C, s2_68 + -80, out a1_463, out a2_464, out a3_465, out a4_466, out a5_467) != 0x00)
					return;
				a5_109 = 0x02;
			}
			g_dw4200F6E4 = a5_109;
		}
		at_callback_do(fp + -316);
	}
	else
	{
		Eq_2 a2_132;
		Eq_2 a3_133;
		ptr32 mstatus_138;
		Eq_2 s1_141;
		Eq_2 s3_145;
		Eq_2 a2_169;
		Eq_2 a3_170;
		Eq_2 a4_171;
		ptr32 mstatus_175;
		word32 s0_177;
		Eq_2 s1_178;
		Eq_2 s3_182;
		word32 a1_431;
		word32 a0_430;
		word32 s1_429;
		word32 a2_432;
		word32 a3_433;
		word32 s0_428;
		word32 s10_426;
		word32 s11_427;
		word32 s9_425;
		word32 s7_423;
		word32 s8_424;
		word32 s6_422;
		word32 s4_420;
		word32 s5_421;
		word32 a5_418;
		word32 s2_419;
		word32 a0_416;
		word32 a1_417;
		word32 s10_414;
		word32 s11_415;
		word32 s8_412;
		word32 s9_413;
		word32 s7_411;
		word32 s5_409;
		word32 s6_410;
		word32 s2_407;
		word32 s4_408;
		word32 a5_406;
		word32 a1_404;
		word32 a4_405;
		word32 a0_403;
		word32 s0_402;
		word32 a4_434;
		word32 a5_435;
		word32 s2_436;
		word32 s3_437;
		word32 s4_438;
		word32 s5_439;
		word32 s6_440;
		word32 s7_441;
		word32 s8_442;
		word32 s9_443;
		word32 s10_444;
		word32 s11_445;
		word32 mstatus_446;
		at_dump_noend(at_dump_noend(at_dump_noend(ra_28, s1_43, 0x230C6900, a2_24, 63, a4_46, 0x230B4000, mstatus, dwLoc025C, 588009392, dwLoc024C, dwLoc0248, dwLoc0204, dwLoc0200, dwLoc01FC, 0x00FFFD00, dwLoc01B8, dwLoc01B4, dwLoc0188, dwLoc0178, dwLoc0148, out s0_402, out s1_141, out a0_403, out a1_404, out a2_132, out a3_133, out a4_405, out a5_406, out s2_407, out s3_145, out s4_408, out s5_409, out s6_410, out s7_411, out s8_412, out s9_413, out s10_414, out s11_415, out mstatus_138), s1_141, 588009096, a2_132, a3_133, fp + -32, s3_145, mstatus_138, dwLoc025C, 588009392, dwLoc024C, dwLoc0248, dwLoc0204, dwLoc0200, dwLoc01FC, 0x00FFFD00, dwLoc01B8, dwLoc01B4, dwLoc0188, dwLoc0178, dwLoc0148, out s0_177, out s1_178, out a0_416, out a1_417, out a2_169, out a3_170, out a4_171, out a5_418, out s2_419, out s3_182, out s4_420, out s5_421, out s6_422, out s7_423, out s8_424, out s9_425, out s10_426, out s11_427, out mstatus_175), s1_178, s0_177 + -0x0700, a2_169, a3_170, a4_171, s3_182, mstatus_175, dwLoc025C, 588009392, dwLoc024C, dwLoc0248, dwLoc0204, dwLoc0200, dwLoc01FC, 0x00FFFD00, dwLoc01B8, dwLoc01B4, dwLoc0188, dwLoc0178, dwLoc0148, out s0_428, out s1_429, out a0_430, out a1_431, out a2_432, out a3_433, out a4_434, out a5_435, out s2_436, out s3_437, out s4_438, out s5_439, out s6_440, out s7_441, out s8_442, out s9_443, out s10_444, out s11_445, out mstatus_446);
	}
}

// 2307E876: void set_ip_handler(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28)
void set_ip_handler(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28)
{
	byte bLoc0114_136 = (byte) dwLoc0114;
	word32 s4_207;
	word32 s5_208;
	word32 s2_205;
	word32 s3_206;
	word32 a5_203;
	word32 a7_204;
	word32 a3_201;
	word32 a4_202;
	word32 a1_199;
	word32 a2_200;
	word32 s1_197;
	word32 a0_198;
	word32 s6_209;
	word32 s7_210;
	word32 s8_211;
	word32 s9_212;
	word32 s10_213;
	word32 s11_214;
	word32 t4_215;
	Eq_2 ra_23 = printf(ra, &g_t230C4ED4, a3, dwLoc0168, dwLoc0148, dwLoc0100, dwLocFC, dwLocD8, dwLocB4, out s1_197, out a0_198, out a1_199, out a2_200, out a3_201, out a4_202, out a5_203, out a7_204, out s2_205, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211, out s9_212, out s10_213, out s11_214, out t4_215);
	int32 a3_61 = (word32) bLoc0114_136;
	if (a3_61 != 63)
	{
		if (a3_61 != 61)
			return;
		word32 a0_71;
		int32 a4_74;
		word32 s0_216;
		word32 s1_217;
		word32 a2_218;
		word32 a3_219;
		word32 a5_220;
		word32 s2_221;
		word32 s3_222;
		word32 s4_223;
		word32 s5_224;
		at_get_parameters(ra_23, dwLoc0114, fp + -360, 0x05, fp + -364, 0x03, dwLocCC, dwLocC8, dwLoc9C, dwLoc80, dwLoc7C, dwLoc58, dwLoc38, dwLoc18, dwArg08, dwArg28, out s0_216, out s1_217, out a0_71, out a2_218, out a3_219, out a4_74, out a5_220, out s2_221, out s3_222, out s4_223, out s5_224);
		if (a0_71 != 0x00 || a4_74 <= 0x00)
			return;
	}
	at_callback_do(fp + -300);
}

// 2307E924: Register word32 at_get_ssid_psk(Register (ptr32 byte) a1, Register (ptr32 Eq_461485) a5, Register out Eq_461486 a3Out)
// Called from:
//      ap_cfg_handler
//      join_ap_handler
word32 at_get_ssid_psk(byte * a1, union Eq_461485 * a5, union Eq_461486 & a3Out)
{
	int32 a4_24;
	for (a4_24 = 0x00; a4_24 <= 97; ++a4_24)
	{
		Eq_461486 a3_14 = (word32) *a5;
		if (a3_14 == 92)
		{
			a3_14 = (word32) *((char *) a5 + 1);
			*a1 = (byte) a3_14;
			++a4_24;
			a5 = (union Eq_461485 *) ((char *) a5 + 2);
			goto l2307E94E;
		}
		if (a3_14 == 0x0022)
		{
			a5 = (union Eq_461485 *) ((char *) a5 + 1);
			++a4_24;
		}
		else if (a3_14 == 44)
		{
			a5 = (union Eq_461485 *) ((char *) a5 + 1);
			++a4_24;
			a1 = a2;
		}
		else
		{
			if (a3_14 == 0x0D)
			{
				a3Out = a3_14;
				return 0x00;
			}
			*a1 = (byte) a3_14;
			a5 = (union Eq_461485 *) ((char *) a5 + 1);
l2307E94E:
			++a1;
		}
	}
	a3Out = a3_14;
	return 0x04;
}

// 2307E980: void ap_cfg_handler(Register Eq_2 ra, Register Eq_2 a3)
void ap_cfg_handler(Eq_2 ra, Eq_2 a3)
{
	struct Eq_461539 * a5_43;
	word32 s8_199;
	word32 s7_198;
	word32 s6_197;
	word32 s5_196;
	word32 s4_195;
	word32 s3_194;
	word32 s2_193;
	word32 a7_192;
	word32 a5_191;
	word32 a4_190;
	word32 a3_189;
	word32 a2_188;
	word32 a1_187;
	word32 a0_186;
	word32 s1_185;
	word32 s9_200;
	word32 s10_201;
	word32 s11_202;
	word32 t4_203;
	word32 t1_204;
	word32 a0_205;
	word32 a1_206;
	word32 a2_207;
	word32 a3_208;
	word32 a4_209;
	Eq_2 ra_44 = memset(printf(ra, &g_t230C4CA0, a3, dwLoc0208, dwLoc01E8, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s1_185, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203), fp + -528, 0x00, 0x0200, out t1_204, out a0_205, out a1_206, out a2_207, out a3_208, out a4_209, out a5_43);
	Eq_461608 s0_47 = a5_43->t0000;
	int32 a4_49 = (word32) a5_43->t0000;
	if (a4_49 != 63)
	{
		if (a4_49 != 61)
			return;
		a5_43->t0001 = s0_47;
		word32 a3_210;
		if (at_get_ssid_psk(fp + -528, &a5_43->t0001, out a3_210) != 0x00)
			return;
		at_set_ap(ra_44, fp + -272, 0x00);
	}
	else
		at_ap_sta_get(ra_44, 63);
}

