pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307E9EC: void join_ap_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus)
void join_ap_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus)
{
	Eq_2 s3_26;
	struct Eq_461652 * a5_43;
	word32 s1_403;
	word32 a0_404;
	word32 a1_405;
	word32 a2_406;
	word32 a3_407;
	word32 a4_408;
	word32 a5_409;
	word32 a7_410;
	word32 s2_411;
	word32 s4_412;
	word32 s5_413;
	word32 s6_414;
	word32 s7_415;
	word32 s8_416;
	word32 s9_417;
	word32 s10_418;
	word32 s11_419;
	word32 t4_420;
	word32 t1_421;
	word32 a0_422;
	word32 a1_423;
	word32 a2_424;
	word32 a3_425;
	word32 a4_426;
	Eq_2 ra_44 = memset(printf(ra, &g_t230C4CA0, a3, dwLoc0208, dwLoc01E8, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s1_403, out a0_404, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a7_410, out s2_411, out s3_26, out s4_412, out s5_413, out s6_414, out s7_415, out s8_416, out s9_417, out s10_418, out s11_419, out t4_420), fp + -528, 0x00, 0x0200, out t1_421, out a0_422, out a1_423, out a2_424, out a3_425, out a4_426, out a5_43);
	Eq_2 s0_47 = a5_43->t0000;
	int32 a4_49 = (word32) a5_43->t0000;
	if (a4_49 != 63)
	{
		if (a4_49 == 61)
		{
			a5_43->t0001 = s0_47;
			Eq_2 a3_57;
			if (at_get_ssid_psk(fp + -528, &a5_43->t0001, out a3_57) == 0x00)
			{
				Eq_2 a3_75;
				Eq_2 s1_79;
				word32 a0_447;
				word32 a1_448;
				word32 a2_449;
				word32 a4_450;
				word32 a5_451;
				word32 a7_452;
				word32 s2_453;
				word32 s3_454;
				word32 s4_455;
				word32 s5_456;
				word32 s6_457;
				word32 s7_458;
				word32 s8_459;
				word32 s9_460;
				word32 s10_461;
				word32 s11_462;
				word32 t4_463;
				Eq_2 ra_78 = printf(ra_44, &g_t230C4F2C, a3_57, dwLoc0208, dwLoc01E8, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s1_79, out a0_447, out a1_448, out a2_449, out a3_75, out a4_450, out a5_451, out a7_452, out s2_453, out s3_454, out s4_455, out s5_456, out s6_457, out s7_458, out s8_459, out s9_460, out s10_461, out s11_462, out t4_463);
				Eq_2 a2_96;
				Eq_2 a3_97;
				Eq_2 a4_98;
				Eq_2 s3_104;
				if (at_join_ap(ra_78, fp + -528, a3_75, out a2_96, out a3_97, out a4_98, out s3_104) != 0x00)
				{
					Eq_2 a2_122;
					Eq_2 a3_123;
					Eq_2 a4_124;
					ptr32 mstatus_128;
					Eq_2 s1_131;
					Eq_2 s3_135;
					word32 s0_464;
					word32 a0_465;
					word32 a1_466;
					word32 a5_467;
					word32 s2_468;
					word32 s4_469;
					word32 s5_470;
					word32 s6_471;
					word32 s7_472;
					word32 s8_473;
					word32 s9_474;
					word32 s10_475;
					word32 s11_476;
					Eq_2 ra_129 = at_dump_noend(ra_78, s1_79, 0x230C6900, a2_96, a3_97, a4_98, s3_104, mstatus, dwLoc020C, dwLoc0200, dwLoc01FC, dwLoc01F8, dwLoc01B4, dwLoc01B0, dwLoc01AC, dwLoc0188, dwLoc0168, dwLoc0164, dwLoc0138, dwLoc0128, dwLocF8, out s0_464, out s1_131, out a0_465, out a1_466, out a2_122, out a3_123, out a4_124, out a5_467, out s2_468, out s3_135, out s4_469, out s5_470, out s6_471, out s7_472, out s8_473, out s9_474, out s10_475, out s11_476, out mstatus_128);
					at_get_errorcode();
					Eq_2 a2_155;
					Eq_2 a3_156;
					Eq_2 a4_157;
					ptr32 mstatus_161;
					word32 s0_163;
					Eq_2 s1_164;
					Eq_2 s3_168;
					word32 a0_477;
					word32 a1_478;
					word32 a5_479;
					word32 s2_480;
					word32 s4_481;
					word32 s5_482;
					word32 s6_483;
					word32 s7_484;
					word32 s8_485;
					word32 s9_486;
					word32 s10_487;
					word32 s11_488;
					word32 s0_489;
					word32 s1_490;
					word32 a0_491;
					word32 a1_492;
					word32 a2_493;
					word32 a3_494;
					word32 a4_495;
					word32 a5_496;
					word32 s2_497;
					word32 s3_498;
					word32 s4_499;
					word32 s5_500;
					word32 s6_501;
					word32 s7_502;
					word32 s8_503;
					word32 s9_504;
					word32 s10_505;
					word32 s11_506;
					word32 mstatus_507;
					at_dump_noend(at_dump_noend(ra_129, s1_131, 588009304, a2_122, a3_123, a4_124, s3_135, mstatus_128, dwLoc020C, dwLoc0200, dwLoc01FC, dwLoc01F8, dwLoc01B4, dwLoc01B0, dwLoc01AC, dwLoc0188, dwLoc0168, dwLoc0164, dwLoc0138, dwLoc0128, dwLocF8, out s0_163, out s1_164, out a0_477, out a1_478, out a2_155, out a3_156, out a4_157, out a5_479, out s2_480, out s3_168, out s4_481, out s5_482, out s6_483, out s7_484, out s8_485, out s9_486, out s10_487, out s11_488, out mstatus_161), s1_164, s0_163 + -0x0700, a2_155, a3_156, a4_157, s3_168, mstatus_161, dwLoc020C, dwLoc0200, dwLoc01FC, dwLoc01F8, dwLoc01B4, dwLoc01B0, dwLoc01AC, dwLoc0188, dwLoc0168, dwLoc0164, dwLoc0138, dwLoc0128, dwLocF8, out s0_489, out s1_490, out a0_491, out a1_492, out a2_493, out a3_494, out a4_495, out a5_496, out s2_497, out s3_498, out s4_499, out s5_500, out s6_501, out s7_502, out s8_503, out s9_504, out s10_505, out s11_506, out mstatus_507);
				}
			}
		}
		else
		{
			Eq_2 s3_229;
			Eq_2 a3_250;
			word32 s1_427;
			word32 a0_428;
			word32 a2_429;
			word32 a3_430;
			word32 a4_431;
			word32 a5_432;
			word32 s2_433;
			word32 s4_434;
			word32 s1_435;
			word32 a0_436;
			word32 a2_437;
			word32 a4_438;
			word32 a5_439;
			word32 s2_440;
			word32 s3_441;
			word32 s4_442;
			word32 a2_443;
			word32 a3_444;
			word32 a4_445;
			word32 s3_446;
			at_join_ap(at_key_value_get(at_key_value_get(ra_44, s0_47, 587897332, fp + -528, s3_26, mstatus, dwLoc0208, dwLoc01D8, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc0174, dwLoc0168, dwLoc0128, out s1_427, out a0_428, out a2_429, out a3_430, out a4_431, out a5_432, out s2_433, out s3_229, out s4_434), s0_47, 0x230A9A00, fp + -272, s3_229, mstatus, dwLoc0208, dwLoc01D8, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc0174, dwLoc0168, dwLoc0128, out s1_435, out a0_436, out a2_437, out a3_250, out a4_438, out a5_439, out s2_440, out s3_441, out s4_442), fp + -528, a3_250, out a2_443, out a3_444, out a4_445, out s3_446);
		}
	}
	else
		at_get_apinfo();
}

// 2307EAB6: Register Eq_2 at_response(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_460339) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out Eq_460343 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      at_parse
Eq_2 at_response(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, struct Eq_460339 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, union Eq_460343 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	if (a0 == 0x1B)
	{
		s0Out = s0;
		s1Out = s1;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		ptr32 mstatus_153;
		Eq_2 a4_149;
		Eq_2 a3_148;
		Eq_2 a2_147;
		Eq_2 s1_156;
		Eq_2 ra_154;
		Eq_2 s3_160;
		word32 s0_155;
		ptr32 mstatus_187;
		Eq_2 a4_183;
		Eq_2 a3_182;
		Eq_2 a2_181;
		Eq_2 s1_190;
		Eq_2 ra_188;
		Eq_2 a0_209;
		Eq_2 s3_194;
		if (a0 == 0x00)
		{
			word32 s11_548;
			word32 s10_547;
			word32 s9_546;
			word32 s8_545;
			word32 s7_544;
			word32 s6_543;
			word32 s5_542;
			word32 s4_541;
			word32 a0_537;
			word32 s0_536;
			word32 a1_538;
			word32 a5_539;
			word32 s2_540;
			ra_188 = at_dump_noend(ra, s1, 0x230C6900, a2, a3, a4, s3, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_536, out s1_190, out a0_537, out a1_538, out a2_181, out a3_182, out a4_183, out a5_539, out s2_540, out s3_194, out s4_541, out s5_542, out s6_543, out s7_544, out s8_545, out s9_546, out s10_547, out s11_548, out mstatus_187);
			a0_209.u0 = 0x230B3304;
		}
		else
		{
			if (a0 != 0x02)
			{
				Eq_2 a3_12 = 588011024;
				word32 a5_13;
				for (a5_13 = 0x00; a5_13 != 0x18; ++a5_13)
				{
					Eq_2 a1_18 = (word32) *a3_12;
					if (a1_18 == a0)
					{
						ptr32 mstatus_111;
						Eq_2 a4_107;
						Eq_2 a3_106;
						Eq_2 s1_114;
						Eq_2 ra_112;
						Eq_2 a0_101;
						Eq_2 s3_118;
						dwArg64 = a1_18;
						if (a0 == 0x17)
						{
							word32 s0_595;
							word32 a0_596;
							word32 a1_597;
							word32 a2_598;
							word32 a5_599;
							word32 s2_600;
							word32 s4_601;
							word32 s5_602;
							word32 s6_603;
							word32 s7_604;
							word32 s8_605;
							word32 s9_606;
							word32 s10_607;
							word32 s11_608;
							ra_112 = at_dump_noend(ra, s1, 0x230C6900, 0x18, a3_12, 588011024, s3, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_595, out s1_114, out a0_596, out a1_597, out a2_598, out a3_106, out a4_107, out a5_599, out s2_600, out s3_118, out s4_601, out s5_602, out s6_603, out s7_604, out s8_605, out s9_606, out s10_607, out s11_608, out mstatus_111);
							a0_101.u0 = 588015992;
						}
						else
						{
							word32 s0_581;
							word32 a0_582;
							word32 a1_583;
							word32 a2_584;
							word32 a5_585;
							word32 s2_586;
							word32 s4_587;
							word32 s5_588;
							word32 s6_589;
							word32 s7_590;
							word32 s8_591;
							word32 s9_592;
							word32 s10_593;
							word32 s11_594;
							ra_112 = at_dump_noend(ra, s1, 0x230C6900, 0x18, a3_12, 588011024, s3, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_581, out s1_114, out a0_582, out a1_583, out a2_584, out a3_106, out a4_107, out a5_585, out s2_586, out s3_118, out s4_587, out s5_588, out s6_589, out s7_590, out s8_591, out s9_592, out s10_593, out s11_594, out mstatus_111);
							a0_101.u0 = 588010984;
						}
						word32 a0_609;
						word32 a1_610;
						word32 a5_611;
						word32 s2_612;
						word32 s4_613;
						word32 s5_614;
						word32 s6_615;
						word32 s7_616;
						word32 s8_617;
						word32 s9_618;
						word32 s10_619;
						word32 s11_620;
						ra_154 = at_dump_noend(ra_112, s1_114, a0_101, dwArg44, a3_106, a4_107, s3_118, mstatus_111, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_155, out s1_156, out a0_609, out a1_610, out a2_147, out a3_148, out a4_149, out a5_611, out s2_612, out s3_160, out s4_613, out s5_614, out s6_615, out s7_616, out s8_617, out s9_618, out s10_619, out s11_620, out mstatus_153);
						goto l2307EADC;
					}
					a3_12 = (word32) a3_12 + 8;
				}
				if (a0 == 0x01)
				{
					s0Out = s0;
					s1Out = s1;
					a4Out.u0 = 588011024;
					s2Out = s2;
					s3Out = s3;
					s5Out = s5;
					s6Out = s6;
					s7Out = s7;
					s8Out = dwLoc1C;
					s9Out = s9;
					s10Out = s10;
					mstatusOut = mstatus;
					return ra;
				}
				else
				{
					Eq_2 a4_41;
					Eq_2 s1_44;
					ptr32 s10_45;
					ptr32 s2_47;
					Eq_2 s3_48;
					struct Eq_460339 * s5_50;
					ptr32 s6_51;
					ptr32 s7_52;
					Eq_2 s8_53;
					Eq_460343 s9_54;
					word32 a0_621;
					word32 a1_622;
					word32 a2_623;
					word32 a3_624;
					word32 a5_625;
					word32 a7_626;
					word32 s4_627;
					word32 s11_628;
					word32 t4_629;
					Eq_2 ra_43 = printf(ra, &g_t230C55F4, a3_12, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_44, out a0_621, out a1_622, out a2_623, out a3_624, out a4_41, out a5_625, out a7_626, out s2_47, out s3_48, out s4_627, out s5_50, out s6_51, out s7_52, out s8_53, out s9_54, out s10_45, out s11_628, out t4_629);
					s0Out = s0;
					s1Out = s1_44;
					a4Out = a4_41;
					s2Out = s2_47;
					s3Out = s3_48;
					s5Out = s5_50;
					s6Out = s6_51;
					s7Out = s7_52;
					s8Out = s8_53;
					s9Out = s9_54;
					s10Out = s10_45;
					mstatusOut = mstatus;
					return ra_43;
				}
			}
			word32 s9_566;
			word32 s10_567;
			word32 s11_568;
			word32 s8_565;
			word32 s7_564;
			word32 s6_563;
			word32 s5_562;
			word32 s4_561;
			word32 s2_560;
			word32 a5_559;
			word32 a1_558;
			word32 a0_557;
			word32 s0_556;
			ra_188 = at_dump_noend(ra, s1, 0x230C6900, a2, a3, a4, s3, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_556, out s1_190, out a0_557, out a1_558, out a2_181, out a3_182, out a4_183, out a5_559, out s2_560, out s3_194, out s4_561, out s5_562, out s6_563, out s7_564, out s8_565, out s9_566, out s10_567, out s11_568, out mstatus_187);
			a0_209.u0 = 0x230C55E0;
		}
		word32 a5_571;
		word32 a0_569;
		word32 a1_570;
		word32 s2_572;
		word32 s4_573;
		word32 s5_574;
		word32 s6_575;
		word32 s7_576;
		word32 s8_577;
		word32 s9_578;
		word32 s10_579;
		word32 s11_580;
		ra_154 = at_dump_noend(ra_188, s1_190, a0_209, a2_181, a3_182, a4_183, s3_194, mstatus_187, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_155, out s1_156, out a0_569, out a1_570, out a2_147, out a3_148, out a4_149, out a5_571, out s2_572, out s3_160, out s4_573, out s5_574, out s6_575, out s7_576, out s8_577, out s9_578, out s10_579, out s11_580, out mstatus_153);
l2307EADC:
		Eq_2 a0_283 = s0_155 + -0x0700;
		Eq_2 a4_300;
		ptr32 mstatus_304;
		ptr32 s0_306;
		Eq_2 s1_307;
		ptr32 s10_308;
		ptr32 s2_310;
		Eq_2 s3_311;
		struct Eq_460339 * s5_313;
		ptr32 s6_314;
		ptr32 s7_315;
		Eq_2 s8_316;
		Eq_460343 s9_317;
		word32 s11_555;
		word32 s4_554;
		word32 a5_553;
		word32 a3_552;
		word32 a2_551;
		word32 a1_550;
		word32 a0_549;
		Eq_2 ra_305 = at_dump_noend(ra_154, s1_156, a0_283, a2_147, a3_148, a4_149, s3_160, mstatus_153, dwArg04, dwArg10, dwArg14, dwArg18, dwArg5C, dwArg60, dwArg64, dwArg88, dwArgA8, dwArgAC, dwArgD8, dwArgE8, dwArg0118, out s0_306, out s1_307, out a0_549, out a1_550, out a2_551, out a3_552, out a4_300, out a5_553, out s2_310, out s3_311, out s4_554, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_308, out s11_555, out mstatus_304);
		s0Out = s0_306;
		s1Out = s1_307;
		a4Out = a4_300;
		s2Out = s2_310;
		s3Out = s3_311;
		s5Out = s5_313;
		s6Out = s6_314;
		s7Out = s7_315;
		s8Out = s8_316;
		s9Out = s9_317;
		s10Out = s10_308;
		mstatusOut = mstatus_304;
		return ra_305;
	}
}

// 2307EB86: void at_reset(Register Eq_2 ra)
// Called from:
//      reset_handler
void at_reset(Eq_2 ra)
{
	<anonymous> * a5_5 = g_ptr42027944;
	if (a5_5 == null)
		return;
	a5_5();
}

// 2307EBA8: void at_version(Register Eq_2 ra, Register Eq_2 a3)
// Called from:
//      version_handler
void at_version(Eq_2 ra, Eq_2 a3)
{
	word32 a3_16;
	word32 s1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	word32 a4_102;
	word32 a5_103;
	word32 a7_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	word32 s6_109;
	word32 s7_110;
	word32 s8_111;
	word32 s9_112;
	word32 s10_113;
	word32 s11_114;
	word32 t4_115;
	Eq_2 ra_19 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_98, out a0_99, out a1_100, out a2_101, out a3_16, out a4_102, out a5_103, out a7_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115);
	<anonymous> * a5_37 = g_ptr42027944;
	if (a5_37 != null)
		a5_37();
}

// 2307EBE8: void at_restore(Register Eq_2 ra, Register Eq_2 a3)
// Called from:
//      restore_handler
void at_restore(Eq_2 ra, Eq_2 a3)
{
	word32 a3_16;
	word32 s1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	word32 a4_102;
	word32 a5_103;
	word32 a7_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	word32 s6_109;
	word32 s7_110;
	word32 s8_111;
	word32 s9_112;
	word32 s10_113;
	word32 s11_114;
	word32 t4_115;
	Eq_2 ra_19 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_98, out a0_99, out a1_100, out a2_101, out a3_16, out a4_102, out a5_103, out a7_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115);
	<anonymous> * a5_37 = g_ptr42027944;
	if (a5_37 != null)
		a5_37();
}

// 2307EC28: void at_uart_config_get(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus)
// Called from:
//      uart_config_handler
void at_uart_config_get(Eq_2 ra, Eq_2 a3, ptr32 mstatus)
{
	word32 a3_20;
	word32 s1_24;
	word32 a2_227;
	word32 a1_226;
	word32 a0_225;
	word32 a4_228;
	word32 a5_229;
	word32 a7_230;
	word32 s2_231;
	word32 s3_232;
	word32 s4_233;
	word32 s5_234;
	word32 s6_235;
	word32 s7_236;
	word32 s8_237;
	word32 s9_238;
	word32 s10_239;
	word32 s11_240;
	word32 t4_241;
	Eq_2 ra_23 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_24, out a0_225, out a1_226, out a2_227, out a3_20, out a4_228, out a5_229, out a7_230, out s2_231, out s3_232, out s4_233, out s5_234, out s6_235, out s7_236, out s8_237, out s9_238, out s10_239, out s11_240, out t4_241);
	<anonymous> * a5_41 = g_ptr42027944;
	if (a5_41 != null)
	{
		struct Eq_462541 * sp_46;
		word32 a0_48;
		Eq_2 ra_50;
		Eq_2 a2_53;
		word32 a6_57;
		Eq_2 a3_58;
		Eq_2 a4_59;
		Eq_2 s3_64;
		word32 t1_188;
		word32 t5_189;
		word32 t6_190;
		word32 tp_191;
		a5_41();
		if (a0_48 == 0x00)
		{
			Eq_2 a2_77;
			Eq_2 a3_78;
			Eq_2 a4_79;
			ptr32 mstatus_83;
			Eq_2 s1_86;
			Eq_2 s3_90;
			word32 s0_242;
			word32 a0_243;
			word32 a1_244;
			word32 a5_245;
			word32 s2_246;
			word32 s4_247;
			word32 s5_248;
			word32 s6_249;
			word32 s7_250;
			word32 s8_251;
			word32 s9_252;
			word32 s10_253;
			word32 s11_254;
			Eq_2 ra_84 = at_dump_noend(ra_50, 0x230C7000, 0x230C6900, a2_53, a3_58, a4_59, s3_64, mstatus, sp_46->t0004, sp_46->t0010, sp_46->t0014, sp_46->t0018, sp_46->t005C, sp_46->t0060, sp_46->t0064, sp_46->t0088, sp_46->t00A8, sp_46->t00AC, sp_46->t00D8, sp_46->t00E8, sp_46->t0118, out s0_242, out s1_86, out a0_243, out a1_244, out a2_77, out a3_78, out a4_79, out a5_245, out s2_246, out s3_90, out s4_247, out s5_248, out s6_249, out s7_250, out s8_251, out s9_252, out s10_253, out s11_254, out mstatus_83);
			0x00 = sp_46->dw01F4;
			Eq_2 a2_112;
			Eq_2 a3_113;
			Eq_2 a4_114;
			ptr32 mstatus_118;
			Eq_2 s1_121;
			Eq_2 s3_125;
			word32 s0_255;
			word32 a0_256;
			word32 a1_257;
			word32 a5_258;
			word32 s2_259;
			word32 s4_260;
			word32 s5_261;
			word32 s6_262;
			word32 s7_263;
			word32 s8_264;
			word32 s9_265;
			word32 s10_266;
			word32 s11_267;
			word32 s0_268;
			word32 s1_269;
			word32 a0_270;
			word32 a1_271;
			word32 a2_272;
			word32 a3_273;
			word32 a4_274;
			word32 a5_275;
			word32 s2_276;
			word32 s3_277;
			word32 s4_278;
			word32 s5_279;
			word32 s6_280;
			word32 s7_281;
			word32 s8_282;
			word32 s9_283;
			word32 s10_284;
			word32 s11_285;
			word32 mstatus_286;
			at_dump_noend(at_dump_noend(ra_84, s1_86, 0x230C58CC, a2_77, a3_78, a4_79, s3_90, mstatus_83, sp_46->t0004, sp_46->t0010, sp_46->t0014, sp_46->t0018, sp_46->t005C, sp_46->t0060, sp_46->t0064, sp_46->t0088, sp_46->t00A8, sp_46->t00AC, sp_46->t00D8, sp_46->t00E8, sp_46->t0118, out s0_255, out s1_121, out a0_256, out a1_257, out a2_112, out a3_113, out a4_114, out a5_258, out s2_259, out s3_125, out s4_260, out s5_261, out s6_262, out s7_263, out s8_264, out s9_265, out s10_266, out s11_267, out mstatus_118), s1_121, (word32) s1_121 - 0x0700, a2_112, a3_113, a4_114, s3_125, mstatus_118, sp_46->t0004, sp_46->t0010, sp_46->t0014, sp_46->t0018, sp_46->t005C, sp_46->t0060, sp_46->t0064, sp_46->t0088, sp_46->t00A8, sp_46->t00AC, sp_46->t00D8, sp_46->t00E8, sp_46->t0118, out s0_268, out s1_269, out a0_270, out a1_271, out a2_272, out a3_273, out a4_274, out a5_275, out s2_276, out s3_277, out s4_278, out s5_279, out s6_280, out s7_281, out s8_282, out s9_283, out s10_284, out s11_285, out mstatus_286);
		}
	}
}

// 2307ECA8: void at_uart_config(Register Eq_2 ra, Register Eq_2 a3)
// Called from:
//      uart_config_handler
void at_uart_config(Eq_2 ra, Eq_2 a3)
{
	word32 a3_31;
	word32 a4_32;
	word32 s1_35;
	word32 a2_145;
	word32 a1_144;
	word32 a0_143;
	word32 a5_146;
	word32 a7_147;
	word32 s2_148;
	word32 s3_149;
	word32 s4_150;
	word32 s5_151;
	word32 s6_152;
	word32 s7_153;
	word32 s8_154;
	word32 s9_155;
	word32 s10_156;
	word32 s11_157;
	word32 t4_158;
	Eq_2 ra_34 = printf(ra, &g_t230C4ED4, a3, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_35, out a0_143, out a1_144, out a2_145, out a3_31, out a4_32, out a5_146, out a7_147, out s2_148, out s3_149, out s4_150, out s5_151, out s6_152, out s7_153, out s8_154, out s9_155, out s10_156, out s11_157, out t4_158);
	0x00 = dwLoc5C;
	<anonymous> * a5_56 = g_ptr42027944;
	if (a5_56 != null)
		a5_56();
}

// 2307ED18: void at_deep_sleep_mode(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3)
// Called from:
//      deep_sleep_handler
void at_deep_sleep_mode(Eq_2 ra, word32 a1, Eq_2 a3)
{
	word32 a3_24;
	word32 s1_28;
	word32 a2_119;
	word32 a1_118;
	word32 a0_117;
	word32 a4_120;
	word32 a5_121;
	word32 a7_122;
	word32 s2_123;
	word32 s3_124;
	word32 s4_125;
	word32 s5_126;
	word32 s6_127;
	word32 s7_128;
	word32 s8_129;
	word32 s9_130;
	word32 s10_131;
	word32 s11_132;
	word32 t4_133;
	Eq_2 ra_27 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_28, out a0_117, out a1_118, out a2_119, out a3_24, out a4_120, out a5_121, out a7_122, out s2_123, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129, out s9_130, out s10_131, out s11_132, out t4_133);
	<anonymous> * a5_45 = g_ptr42027944;
	if (a5_45 != null)
		a5_45();
}

