pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307ED70: void at_wifi_mode(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3)
// Called from:
//      wifi_mode_handler
void at_wifi_mode(Eq_2 ra, word32 a0, Eq_2 a3)
{
	word32 a3_20;
	word32 a0_110;
	word32 s1_109;
	word32 a1_111;
	word32 a2_112;
	word32 a4_113;
	word32 a5_114;
	word32 a7_115;
	word32 s2_116;
	word32 s3_117;
	word32 s4_118;
	word32 s5_119;
	word32 s6_120;
	word32 s7_121;
	word32 s8_122;
	word32 s9_123;
	word32 s10_124;
	word32 s11_125;
	word32 t4_126;
	Eq_2 ra_23 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_109, out a0_110, out a1_111, out a2_112, out a3_20, out a4_113, out a5_114, out a7_115, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120, out s7_121, out s8_122, out s9_123, out s10_124, out s11_125, out t4_126);
	<anonymous> * a5_41 = g_ptr42027944;
	if (a5_41 != null)
		a5_41();
}

// 2307EDBC: void at_wifi_mode_get(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus)
// Called from:
//      wifi_mode_handler
void at_wifi_mode_get(Eq_2 ra, Eq_2 a3, ptr32 mstatus)
{
	word32 a3_20;
	word32 s1_24;
	word32 a2_224;
	word32 a1_223;
	word32 a0_222;
	word32 a4_225;
	word32 a5_226;
	word32 a7_227;
	word32 s2_228;
	word32 s3_229;
	word32 s4_230;
	word32 s5_231;
	word32 s6_232;
	word32 s7_233;
	word32 s8_234;
	word32 s9_235;
	word32 s10_236;
	word32 s11_237;
	word32 t4_238;
	Eq_2 ra_23 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_24, out a0_222, out a1_223, out a2_224, out a3_20, out a4_225, out a5_226, out a7_227, out s2_228, out s3_229, out s4_230, out s5_231, out s6_232, out s7_233, out s8_234, out s9_235, out s10_236, out s11_237, out t4_238);
	<anonymous> * a5_41 = g_ptr42027944;
	if (a5_41 != null)
	{
		struct Eq_463016 * sp_46;
		word32 a0_48;
		Eq_2 ra_50;
		Eq_2 a2_53;
		Eq_2 a3_54;
		Eq_2 a4_56;
		Eq_2 s3_61;
		word32 a6_184;
		word32 t1_185;
		word32 t5_186;
		word32 t6_187;
		word32 tp_188;
		a5_41();
		if (a0_48 == 0x00)
		{
			Eq_2 a3_77;
			Eq_2 a4_78;
			ptr32 mstatus_82;
			Eq_2 s1_85;
			Eq_2 s3_89;
			Eq_2 a2_108;
			Eq_2 a3_109;
			Eq_2 a4_110;
			ptr32 mstatus_114;
			Eq_2 s1_117;
			Eq_2 s3_121;
			word32 s0_239;
			word32 a0_240;
			word32 a1_241;
			word32 a2_242;
			word32 a5_243;
			word32 s2_244;
			word32 s4_245;
			word32 s5_246;
			word32 s6_247;
			word32 s7_248;
			word32 s8_249;
			word32 s9_250;
			word32 s10_251;
			word32 s11_252;
			word32 s0_253;
			word32 a0_254;
			word32 a1_255;
			word32 a5_256;
			word32 s2_257;
			word32 s4_258;
			word32 s5_259;
			word32 s6_260;
			word32 s7_261;
			word32 s8_262;
			word32 s9_263;
			word32 s10_264;
			word32 s11_265;
			word32 s0_266;
			word32 s1_267;
			word32 a0_268;
			word32 a1_269;
			word32 a2_270;
			word32 a3_271;
			word32 a4_272;
			word32 a5_273;
			word32 s2_274;
			word32 s3_275;
			word32 s4_276;
			word32 s5_277;
			word32 s6_278;
			word32 s7_279;
			word32 s8_280;
			word32 s9_281;
			word32 s10_282;
			word32 s11_283;
			word32 mstatus_284;
			at_dump_noend(at_dump_noend(at_dump_noend(ra_50, 0x230C7000, 0x230C6900, a2_53, a3_54, a4_56, s3_61, mstatus, sp_46->t0004, sp_46->t0010, sp_46->t0014, sp_46->t0018, sp_46->t005C, sp_46->t0060, sp_46->t0064, sp_46->t0088, sp_46->t00A8, sp_46->t00AC, sp_46->t00D8, sp_46->t00E8, sp_46->t0118, out s0_239, out s1_85, out a0_240, out a1_241, out a2_242, out a3_77, out a4_78, out a5_243, out s2_244, out s3_89, out s4_245, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out mstatus_82), s1_85, 588011752, sp_46->t0064, a3_77, a4_78, s3_89, mstatus_82, sp_46->t0004, sp_46->t0010, sp_46->t0014, sp_46->t0018, sp_46->t005C, sp_46->t0060, sp_46->t0064, sp_46->t0088, sp_46->t00A8, sp_46->t00AC, sp_46->t00D8, sp_46->t00E8, sp_46->t0118, out s0_253, out s1_117, out a0_254, out a1_255, out a2_108, out a3_109, out a4_110, out a5_256, out s2_257, out s3_121, out s4_258, out s5_259, out s6_260, out s7_261, out s8_262, out s9_263, out s10_264, out s11_265, out mstatus_114), s1_117, (word32) s1_117 - 0x0700, a2_108, a3_109, a4_110, s3_121, mstatus_114, sp_46->t0004, sp_46->t0010, sp_46->t0014, sp_46->t0018, sp_46->t005C, sp_46->t0060, sp_46->t0064, sp_46->t0088, sp_46->t00A8, sp_46->t00AC, sp_46->t00D8, sp_46->t00E8, sp_46->t0118, out s0_266, out s1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_272, out a5_273, out s2_274, out s3_275, out s4_276, out s5_277, out s6_278, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283, out mstatus_284);
		}
	}
}

// 2307EE34: void at_get_apinfo()
// Called from:
//      join_ap_handler
void at_get_apinfo()
{
	<anonymous> * t1_5 = g_ptr42027944;
	if (t1_5 == null)
		return;
	t1_5();
}

// 2307EE4C: Register Eq_2 at_join_ap(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_461776 a4Out, Register out ptr32 s3Out)
// Called from:
//      join_ap_handler
Eq_2 at_join_ap(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 & a2Out, ptr32 & a3Out, union Eq_461776 & a4Out, ptr32 & s3Out)
{
	Eq_2 a0_110;
	Eq_2 s1_28;
	word32 a0_208;
	word32 a1_209;
	word32 a2_210;
	word32 a3_211;
	word32 a4_212;
	word32 a5_213;
	word32 a7_214;
	word32 s2_215;
	word32 s4_216;
	word32 s5_217;
	word32 s6_218;
	word32 s7_219;
	word32 s8_220;
	word32 s9_221;
	word32 s10_222;
	word32 s11_223;
	word32 t4_224;
	ptr32 s3_123;
	Eq_2 ra_27 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_28, out a0_208, out a1_209, out a2_210, out a3_211, out a4_212, out a5_213, out a7_214, out s2_215, out s3_123, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220, out s9_221, out s10_222, out s11_223, out t4_224);
	word32 a4_225;
	word32 a5_226;
	strcpy(fp + -292, a0, out a4_225, out a5_226);
	word32 a4_227;
	word32 a5_228;
	strcpy(fp + -259, s1_28, out a4_227, out a5_228);
	struct Eq_463346 * a5_58;
	word32 a1_229;
	word32 a4_230;
	ptr32 a2_116;
	ptr32 a3_117;
	Eq_2 a0_55 = strlen(a0, out a1_229, out a2_116, out a3_117, out a4_230, out a5_58);
	a5_58->t013C = a0_55;
	Eq_461776 a4_100 = 32;
	if (a0_55 > 32)
	{
		a0_110.u0 = 0x11;
		goto l2307EEEE;
	}
	word32 a0_68;
	word32 a0_81;
	word32 t1_231;
	word32 a1_232;
	word32 a2_233;
	word32 a3_234;
	word32 a4_235;
	word32 a5_236;
	word32 t1_237;
	word32 a1_238;
	word32 a4_239;
	word32 a5_240;
	Eq_2 ra_87 = memset(memset(ra_27, (char *) a5_58 + 0x0118, 0x00, 33, out t1_231, out a0_68, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236), a0_68 + 472, 0x00, 65, out t1_237, out a0_81, out a1_238, out a2_116, out a3_117, out a4_239, out a5_240);
	word32 a4_241;
	word32 a5_242;
	strcpy(a0_81 + 0x0118, a0, out a4_241, out a5_242);
	word32 a5_243;
	strcpy(a0_81 + 752, s1_28, out a4_100, out a5_243);
	<anonymous> * a5_103 = g_ptr42027944;
	if (a5_103 != null)
	{
		word32 t1_132;
		a5_103();
		if (a0_110 == 0x00)
		{
l2307EEEE:
			a2Out = a2_116;
			a3Out = a3_117;
			a4Out = a4_100;
			s3Out = s3_123;
			return a0_110;
		}
	}
	a0_110.u0 = 0x02;
	goto l2307EEEE;
}

