pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307EF02: Register word32 at_disconnect(Register Eq_2 ra, Register Eq_2 a3, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 code) a5Out)
// Called from:
//      disconnect_handler
word32 at_disconnect(Eq_2 ra, Eq_2 a3, ptr32 & a3Out, ptr32 & a4Out, <anonymous> & a5Out)
{
	word32 s1_101;
	word32 a0_102;
	word32 a1_103;
	word32 a5_104;
	word32 a7_105;
	word32 s2_106;
	word32 s3_107;
	word32 s4_108;
	word32 s5_109;
	word32 s6_110;
	word32 s7_111;
	word32 s8_112;
	word32 s9_113;
	word32 s10_114;
	word32 s11_115;
	word32 t4_116;
	word32 a2_15;
	ptr32 a3_16;
	ptr32 a4_17;
	Eq_2 ra_19 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_101, out a0_102, out a1_103, out a2_15, out a3_16, out a4_17, out a5_104, out a7_105, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s7_111, out s8_112, out s9_113, out s10_114, out s11_115, out t4_116);
	<anonymous> * a5_37 = g_ptr42027944;
	if (a5_37 != null)
		a5_37();
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_37;
	return a2_15;
}

// 2307EF44: void at_set_ap(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3)
// Called from:
//      ap_cfg_handler
void at_set_ap(Eq_2 ra, Eq_2 a1, Eq_2 a3)
{
	Eq_2 s1_33;
	word32 s2_36;
	word32 a3_208;
	word32 a2_207;
	word32 a1_206;
	word32 a0_205;
	word32 a4_209;
	word32 a5_210;
	word32 a7_211;
	word32 s3_212;
	word32 s4_213;
	word32 s5_214;
	word32 s6_215;
	word32 s7_216;
	word32 s8_217;
	word32 s9_218;
	word32 s10_219;
	word32 s11_220;
	word32 t4_221;
	word32 t1_222;
	word32 a0_223;
	word32 a1_224;
	word32 a2_225;
	word32 a3_226;
	word32 a4_227;
	word32 a5_228;
	word32 t1_229;
	word32 a0_230;
	word32 a1_231;
	word32 a2_232;
	word32 a3_233;
	word32 a4_234;
	word32 a5_235;
	Eq_2 ra_67 = memset(memset(printf(ra, &g_t230C4ED4, a3, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_33, out a0_205, out a1_206, out a2_207, out a3_208, out a4_209, out a5_210, out a7_211, out s2_36, out s3_212, out s4_213, out s5_214, out s6_215, out s7_216, out s8_217, out s9_218, out s10_219, out s11_220, out t4_221), fp + -292, 0x00, 64, out t1_222, out a0_223, out a1_224, out a2_225, out a3_226, out a4_227, out a5_228), fp + -228, 0x00, 64, out t1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235);
	word32 a1_236;
	word32 a2_237;
	word32 a3_238;
	word32 a4_239;
	word32 a5_240;
	word32 a1_241;
	word32 a2_242;
	word32 a3_243;
	word32 a4_244;
	word32 a5_245;
	word32 a6_246;
	word32 a7_247;
	memcpy(fp + -292, s1_33, strlen(s1_33, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240), out a1_241, out a2_242, out a3_243, out a4_244, out a5_245, out a6_246, out a7_247);
	word32 a3_108;
	word32 a1_248;
	word32 a2_249;
	word32 a3_250;
	word32 a4_251;
	word32 a5_252;
	word32 a1_253;
	word32 a2_254;
	word32 a4_255;
	word32 a5_256;
	word32 a6_257;
	word32 a7_258;
	memcpy(fp + -228, a1, strlen(a1, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252), out a1_253, out a2_254, out a3_108, out a4_255, out a5_256, out a6_257, out a7_258);
	<anonymous> * a5_121 = g_ptr42027944;
	if (a5_121 != null)
		a5_121();
}

// 2307EFE4: void at_ap_sta_get(Register Eq_2 ra, Register Eq_2 a3)
// Called from:
//      ap_cfg_handler
void at_ap_sta_get(Eq_2 ra, Eq_2 a3)
{
	word32 a3_16;
	word32 s1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	word32 a4_102;
	word32 a5_103;
	word32 a7_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	word32 s6_109;
	word32 s7_110;
	word32 s8_111;
	word32 s9_112;
	word32 s10_113;
	word32 s11_114;
	word32 t4_115;
	Eq_2 ra_19 = printf(ra, &g_t230C4ED4, a3, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_98, out a0_99, out a1_100, out a2_101, out a3_16, out a4_102, out a5_103, out a7_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115);
	<anonymous> * a5_37 = g_ptr42027944;
	if (a5_37 != null)
		a5_37();
}

// 2307F026: Register word32 at_http_request(Register Eq_2 ra, Register Eq_2 a3, Register out ptr32 a2Out, Register out (ptr32 code) a5Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      http_req
//      base_station_info
word32 at_http_request(Eq_2 ra, Eq_2 a3, ptr32 & a2Out, <anonymous> & a5Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	word32 s1_35;
	Eq_2 s2_38;
	word32 a0_165;
	word32 a1_166;
	word32 a2_167;
	word32 a3_168;
	word32 a4_169;
	word32 a5_170;
	word32 a7_171;
	word32 s3_172;
	word32 s4_173;
	word32 s8_174;
	word32 s10_175;
	word32 t4_176;
	ptr32 s11_140;
	ptr32 s5_143;
	ptr32 s6_144;
	ptr32 s7_145;
	ptr32 s9_147;
	Eq_2 ra_34 = printf(ra, &g_t230C4ED4, a3, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_35, out a0_165, out a1_166, out a2_167, out a3_168, out a4_169, out a5_170, out a7_171, out s2_38, out s3_172, out s4_173, out s5_143, out s6_144, out s7_145, out s8_174, out s9_147, out s10_175, out s11_140, out t4_176);
	word32 a4_51;
	word32 a3_56;
	word32 a1_177;
	word32 a2_178;
	word32 a5_179;
	word32 a6_180;
	word32 a7_181;
	memcpy(fp + -292, s2_38, 0x0080, out a1_177, out a2_178, out a3_56, out a4_51, out a5_179, out a6_180, out a7_181);
	ptr32 a2_133 = dwLoc9C;
	<anonymous> * a5_136 = g_ptr42027944;
	word32 a0_131 = 0x06;
	if (a5_136 != null)
		a5_136();
	a2Out = a2_133;
	a5Out = a5_136;
	s5Out = s5_143;
	s6Out = s6_144;
	s7Out = s7_145;
	s9Out = s9_147;
	s11Out = s11_140;
	return a0_131;
}

// 2307F0A4: void get_text_para(Register (ptr32 (ptr32 Eq_463772)) a0, Register Eq_2 a1, Register ui32 a2)
void get_text_para(struct Eq_463772 ** a0, Eq_2 a1, ui32 a2)
{
	struct Eq_463772 * a3_27 = *a0;
	int32 a4_120 = 0x00;
	while (true)
	{
		struct Eq_463772 * s1_106;
		if (a4_120 >= (a2 & 511))
			break;
		int32 a5_32;
		int32 a1_29 = (word32) a3_27->b0000;
		s1_106 = a3_27 + 1;
		if (a1_29 == 44)
		{
			a5_32 = 0x0400;
			goto l2307F124;
		}
		if (a1_29 == 0x0D)
		{
			if ((word32) a3_27[1] == 0x0A)
				s1_106 = a3_27 + 2;
l2307F104:
			a5_32 = 0x00FFF800;
l2307F124:
			if ((a5_32 & a2) == 0x00)
				goto l2307F0DC;
			if (a4_120 < (a2 & 511))
			{
				(fp + -16 + a4_120)->b0F00 = 0x00;
				word32 a6_218;
				word32 a7_219;
				word32 a1_213;
				word32 a4_216;
				word32 a5_217;
				word32 a2_214;
				word32 a3_215;
				memcpy(a1, fp + -272, a4_120 + 1, out a1_213, out a2_214, out a3_215, out a4_216, out a5_217, out a6_218, out a7_219);
			}
			goto l2307F142;
		}
		if (a1_29 == 0x0A)
			goto l2307F104;
		if (a1_29 != 0x0022)
		{
			(fp + -16 + a4_120)->b0F00 = (byte) a1_29;
			++a4_120;
		}
		a3_27 = s1_106;
	}
	s1_106 = a3_27;
l2307F0DC:
l2307F142:
	*a0 = (struct Eq_463772 **) s1_106;
}

// 2307F168: void get_tdata_para(Register (ptr32 (ptr32 Eq_463856)) a0, Register Eq_2 a1, Register ui32 a2)
void get_tdata_para(struct Eq_463856 ** a0, Eq_2 a1, ui32 a2)
{
	struct Eq_463856 * a3_25 = *a0;
	int32 a4_20 = 0x00;
	while (true)
	{
		struct Eq_463856 * s1_28;
		if ((a2 & 511) == a4_20)
			break;
		word32 a1_27 = (word32) a3_25->b0000;
		s1_28 = a3_25 + 1;
		if (a1_27 == 0x0D)
		{
			if ((word32) a3_25[1] == 0x0A)
				s1_28 = a3_25 + 2;
l2307F1BC:
			if ((a2 & 0x00FFF800) == 0x00)
				goto l2307F198;
			if (a4_20 != 0x00 && a4_20 < (a2 & 511))
			{
				fp->aFFFFFEF0 + 0x0100 + a4_20 + 0x0F00 = (ptr32) 0x00;
				word32 a7_172;
				word32 a4_169;
				word32 a6_171;
				word32 a5_170;
				word32 a1_166;
				word32 a3_168;
				word32 a2_167;
				memcpy(a1, fp->aFFFFFEF0, a4_20 + 1, out a1_166, out a2_167, out a3_168, out a4_169, out a5_170, out a6_171, out a7_172);
			}
			goto l2307F1DE;
		}
		if (a1_27 == 0x0A)
			goto l2307F1BC;
		fp->aFFFFFEF0[a4_20] = (byte) a1_27;
		++a4_20;
		a3_25 = s1_28;
	}
	s1_28 = a3_25;
l2307F198:
l2307F1DE:
	*a0 = (struct Eq_463856 **) s1_28;
}

// 2307F216: void get_di_para(Register (ptr32 Eq_463930) s0, Register ui32 a2)
void get_di_para(struct Eq_463930 * s0, ui32 a2)
{
	struct Eq_463930 ** a0_14 = s0->t0000;
	int32 a4_17;
	for (a4_17 = 0x00; a4_17 != 11; ++a4_17)
	{
		int32 a5_56;
		int32 a3_26 = (word32) s0->t0000;
		if (a3_26 == 44)
		{
			++s0;
			a5_56 = 0x0400;
			goto l2307F258;
		}
		if (a3_26 == 0x0D)
		{
			if ((word32) s0[1] == 0x0A)
				s0 += 2;
			else
				++s0;
			goto l2307F2B2;
		}
		if (a3_26 == 0x0A || a3_26 == 58)
		{
			++s0;
l2307F2B2:
			a5_56 = 0x00FFF800;
l2307F258:
			if ((a5_56 & a2) == 0x00 || (a4_17 == 0x00 || a4_17 == 11))
				goto l2307F2E8;
			fp->aFFFFFEE0 + 0x0100 + a4_17 + 0x0F00 = (word32) 0x00;
			word32 a1_86;
			word32 a2_258;
			word32 a4_260;
			word32 a5_261;
			word32 a3_259;
			*atoi(fp->aFFFFFEE0, out a1_86, out a2_258, out a3_259, out a4_260, out a5_261) = a1_86;
			goto l2307F278;
		}
		if ((a3_26 + -48 & 0x00FF) > 0x09)
			break;
		fp->aFFFFFEE0[a4_17] = (byte) a3_26;
		++s0;
	}
l2307F2E8:
l2307F278:
	*a0_14 = (struct Eq_463930 **) s0;
}

// 2307F2F0: void get_ip_para(Register Eq_2 ra, Register (ptr32 (ptr32 Eq_464023)) a0, Register Eq_2 a1)
void get_ip_para(Eq_2 ra, struct Eq_464023 ** a0, Eq_2 a1)
{
	struct Eq_464023 * s6_124 = *a0;
	Eq_464027 s1_102 = 0x00;
	word32 a4_505;
	word32 a1_502;
	word32 a3_504;
	word32 a2_503;
	word32 t1_500;
	word32 a0_501;
	word32 a5_506;
	Eq_2 ra_110 = memset(ra, (word32) fp - 0x0144, 0x00, 0x04, out t1_500, out a0_501, out a1_502, out a2_503, out a3_504, out a4_505, out a5_506);
	int32 s5_101 = 0x00;
	do
	{
		int32 a4_60 = (word32) s6_124->b0000;
		int32 a5_133 = 44;
		struct Eq_464023 * s0_108 = s6_124;
		if (a4_60 == 44)
		{
			s0_108 = s6_124 + 1;
			goto l2307F36C;
		}
		if (a4_60 == 0x0D)
		{
			a5_133 = 0x0A;
			if ((word32) s6_124[1] == 0x0A)
				s0_108 = s6_124 + 2;
			else
				s0_108 = s6_124 + 1;
			goto l2307F3C4;
		}
		if (a4_60 == 0x0A)
		{
			s0_108 = s6_124 + 1;
l2307F36C:
			if ((dwLoc7C & a5_133) == 0x00 || s1_102 > ~0x02)
				goto l2307F428;
			word32 a1_507;
			word32 a3_509;
			word32 a2_508;
			word32 a5_511;
			word32 a4_510;
			Eq_2 a0_156 = atoi((word32) fp - 0x0144, out a1_507, out a2_508, out a3_509, out a4_510, out a5_511);
			if (a0_156 > 0x00FF)
				goto l2307F428;
			((word32) fp - 64 + s5_101)->b0F00 = (byte) a0_156;
			if (s5_101 != 0x03)
				goto l2307F428;
			word32 t1_512;
			word32 a0_513;
			word32 a2_515;
			word32 a4_517;
			word32 a1_514;
			word32 a3_516;
			word32 a5_518;
			memset(ra_110, a1, 0x00, 0x04, out t1_512, out a0_513, out a1_514, out a2_515, out a3_516, out a4_517, out a5_518);
			word32 a5_523;
			word32 a7_525;
			word32 a4_522;
			word32 a6_524;
			word32 a1_519;
			word32 a3_521;
			word32 a2_520;
			memcpy(a1, (word32) fp - 320, 0x04, out a1_519, out a2_520, out a3_521, out a4_522, out a5_523, out a6_524, out a7_525);
			goto l2307F42A;
		}
		if (a4_60 == 0x0022)
			s0_108 = s6_124 + 1;
		else if (a4_60 == 46)
		{
			s1_102.u0 = 0x01;
			if (s1_102 <= ~0x02)
			{
				word32 a1_533;
				word32 a2_534;
				word32 a3_535;
				word32 a4_536;
				word32 a5_537;
				Eq_2 a0_81 = atoi((word32) fp - 0x0144, out a1_533, out a2_534, out a3_535, out a4_536, out a5_537);
				if (a0_81 <= 0x00FF)
				{
					((word32) fp - 64 + s5_101)->b0F00 = (byte) a0_81;
					++s5_101;
					s1_102.u0 = 0x00;
				}
			}
			s0_108 = s6_124 + 1;
			word32 t1_526;
			word32 a0_527;
			word32 a1_528;
			word32 a2_529;
			word32 a3_530;
			word32 a4_531;
			word32 a5_532;
			ra_110 = memset(ra_110, (word32) fp - 0x0144, 0x00, 0x04, out t1_526, out a0_527, out a1_528, out a2_529, out a3_530, out a4_531, out a5_532);
			if (s1_102 != 0x00)
				break;
		}
		else
		{
			if ((a4_60 + -48 & 0x00FF) > 0x09 || s1_102 > 0x02)
				break;
			(word32) s1_102.u0 + ((word32) fp - 64) + 3836 = (ptr32) (byte) a4_60;
			s0_108 = s6_124 + 1;
			s1_102 = (word32) s1_102.u0 + 1;
		}
		++s6_124;
	} while (s5_101 != 0x04);
l2307F428:
l2307F42A:
	*a0 = (struct Eq_464023 **) s0_108;
}

// 2307F496: Register word32 hex_to_num(Register word32 a0)
// Called from:
//      get_hex_para
word32 hex_to_num(word32 a0)
{
	if ((a0 + -48 & 0x00FF) <= 0x09)
		return a0 + -48;
	if ((a0 + -65 & 0x00FF) <= 0x05)
		return a0 + -55;
	word32 a0_13 = ~0x00;
	if ((a0 + -97 & 0x00FF) <= 0x05)
		a0_13 = a0 + -87;
	return a0_13;
}

// 2307F4D2: void get_hex_para(Register Eq_2 ra, Register (ptr32 Eq_464264) s0, Register Eq_2 a1, Register ui32 a2)
void get_hex_para(Eq_2 ra, struct Eq_464264 * s0, Eq_2 a1, ui32 a2)
{
	struct Eq_464264 ** a0_30 = s0->t0000;
	int32 a3_103 = 0x00;
	int32 s3_38 = 0x00;
	while (s3_38 < (a2 & 511))
	{
		int32 a5_117;
		int32 a4_52 = (word32) s0->t0000;
		if (a4_52 == 44)
		{
			++s0;
l2307F546:
			a5_117 = 0x0400;
			goto l2307F56A;
		}
		if (a4_52 == 0x0D)
		{
			if ((word32) s0[1] != 0x0A)
				++s0;
			else
				s0 += 2;
			goto l2307F566;
		}
		if (a4_52 == 0x0A)
		{
			++s0;
l2307F566:
			a5_117 = 0x00FFF800;
l2307F56A:
			if ((a5_117 & a2) == 0x00 || a3_103 != 0x02)
				goto l2307F538;
			(s3_38 + (fp + -64))->b0F00 = (byte) ((hex_to_num((word32) bLoc0144) << 4) + hex_to_num((word32) bLoc0143));
			word32 a3_478;
			word32 t1_474;
			word32 a2_477;
			word32 a0_475;
			word32 a5_480;
			word32 a4_479;
			word32 a1_476;
			memset(ra, a1, 0x00, a2 & 511, out t1_474, out a0_475, out a1_476, out a2_477, out a3_478, out a4_479, out a5_480);
			word32 a1_481;
			word32 a6_486;
			word32 a5_485;
			word32 a4_484;
			word32 a3_483;
			word32 a2_482;
			word32 a7_487;
			memcpy(a1, fp + -320, s3_38 + 1, out a1_481, out a2_482, out a3_483, out a4_484, out a5_485, out a6_486, out a7_487);
			++s0;
			goto l2307F5AC;
		}
		if (a4_52 == 58)
			goto l2307F546;
		if (a4_52 != 0x0022)
		{
			if (a3_103 > 0x01)
			{
				if (a3_103 != 0x02)
					break;
				(fp + -64 + s3_38)->b0F00 = (byte) (hex_to_num((word32) bLoc0143) + (hex_to_num((word32) bLoc0144) << 0x04));
				++s3_38;
				a3_103 = 0x00;
				continue;
			}
			else
			{
				if ((a4_52 + -48 & 0x00FF) > 0x09 && ((a4_52 & -33) + -65 & 0x00FF) > 0x05)
					break;
				(fp + -64 + a3_103)->b0EFC = (byte) a4_52;
				++s0;
				++a3_103;
				continue;
			}
		}
		++s0;
	}
l2307F538:
l2307F5AC:
	*a0_30 = (struct Eq_464264 **) s0;
}

