pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307F672: void get_hi_para(Register word32 ra, Register (ptr32 (ptr32 Eq_464432)) a0, Register ui32 a2)
void get_hi_para(word32 ra, struct Eq_464432 ** a0, ui32 a2)
{
	struct Eq_464432 ** s3_121 = a0;
	struct Eq_464432 * a0_16 = *a0;
	int32 a4_18 = 0x00;
	do
	{
		int32 a5_72;
		int32 a3_28 = (word32) a0_16->b0000;
		struct Eq_464432 * s0_116 = a0_16;
		if (a3_28 == 44)
		{
			s0_116 = a0_16 + 1;
			a5_72 = 0x0400;
			goto l2307F6BA;
		}
		if (a3_28 == 0x0D)
		{
			if ((word32) a0_16[1] == 0x0A)
				s0_116 = a0_16 + 2;
			else
				s0_116 = a0_16 + 1;
			goto l2307F718;
		}
		if (a3_28 == 0x0A)
		{
			s0_116 = a0_16 + 1;
l2307F718:
			a5_72 = 0x00FFF800;
l2307F6BA:
			if ((a5_72 & a2) == 0x00 || (a4_18 == 0x00 || a4_18 > 0x0A))
				goto l2307F73E;
			(a4_18 + (fp + -32))->b0F00 = 0x00;
			word32 s1_365;
			word32 s2_366;
			s0_116 = sscanf(ra, fp + -288, &g_b230C590C, dwLoc010C, out s1_365, out s2_366, out s3_121);
			goto l2307F6DE;
		}
		if (a3_28 == 0x0022)
			s0_116 = a0_16 + 1;
		else
		{
			if ((a3_28 + -48 & 0x00FF) > 0x09 && ((a3_28 & -33) + -65 & 0x00FF) > 0x05)
				break;
			(fp + -32 + a4_18)->b0F00 = (byte) a3_28;
			s0_116 = a0_16 + 1;
			++a4_18;
		}
		++a0_16;
	} while (a4_18 != 11);
l2307F73E:
l2307F6DE:
	*s3_121 = (struct Eq_464432 **) s0_116;
}

// 2307F774: Register Eq_4455 at_get_newline(Register Eq_4455 a0, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      at_get_parameters
Eq_4455 at_get_newline(Eq_4455 a0, ptr32 & a4Out, union Eq_2 & a5Out)
{
	word32 a5_5 = (word32) *a0;
	ptr32 a4_14 = 0x0A;
	if (a5_5 != 0x0A)
	{
		a4_14 = 0x0D;
		if (a5_5 != 0x0D)
		{
			a4Out = 0x0D;
			a5Out.u0 = <invalid>;
			return 0x03;
		}
	}
	a4Out = a4_14;
	a5Out.u0 = <invalid>;
	return 0x00;
}

// 2307F78E: Register Eq_2 at_get_parameters(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_4453 a2, Register (ptr32 word32) a3, Register Eq_4455 a5, Stack ptr32 dwArgA4, Stack Eq_2 dwArgA8, Stack word32 dwArgD4, Stack word32 dwArgF0, Stack ptr32 dwArgF4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out (ptr32 word32) a3Out, Register out ptr32 a4Out, Register out Eq_4455 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_4453 s5Out)
// Called from:
//      __usr_at_cmd_demo
//      wifi_supports
//      attention_handler
//      wifi_mode_handler
//      http_req
//      domain_name_resolution
//      base_station_info
//      deep_sleep_handler
//      setautoconnect_handler
//      scan_handler_opt
//      scan_handler
//      uart_config_handler
//      reset_handler
//      echo_on_handler
//      restore_handler
//      version_handler
//      help_handler
//      ble_sync_mode
//      set_ip_handler
//      create_tcp_udp_handler
//      close_network_handler
//      send_data_handler
//      ap_server_handler
//      client_ssl_config_path
//      client_ssl_set_sni
//      client_ssl_set_alpn
Eq_2 at_get_parameters(Eq_2 ra, Eq_2 a0, byte * a1, Eq_4453 a2, word32 * a3, Eq_4455 a5, ptr32 dwArgA4, Eq_2 dwArgA8, word32 dwArgD4, word32 dwArgF0, ptr32 dwArgF4, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, word32 & a3Out, ptr32 & a4Out, union Eq_4455 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_4453 & s5Out)
{
	ptr32 a0_128;
	Eq_4455 a0_24 = *a0;
	if (a1 != null)
	{
		s5 = a2;
		if (a2 != 0x00)
		{
			s2 = 0x00;
			s1 = 0x00;
			s3 = 588011764;
			if (a2 <= 0x00)
			{
				*a0 = a5;
				*a3 = 0x00;
				a0_128 = 0x00;
			}
			else
			{
				a5 = (word32) *a1;
				if (a5 <= 0x05)
				{
					<anonymous> * a5_46 = *((char *) g_a230C58F4 + a5 * 0x04);
					ptr32 s4_51;
					Eq_2 ra_52;
					Eq_2 s0_53;
					ptr32 s1_54;
					ptr32 s2_55;
					ptr32 s3_56;
					Eq_4453 s5_57;
					ptr32 a0_60;
					Eq_2 a2_62;
					word32 * a3_63;
					Eq_4455 a5_64;
					ptr32 a4_69;
					a5_46();
					s0Out = s0_53;
					s1Out = s1_54;
					a0Out = a0_60;
					a2Out = a2_62;
					a3Out = a3_63;
					a4Out = a4_69;
					a5Out = a5_64;
					s2Out = s2_55;
					s3Out = s3_56;
					s4Out = s4_51;
					s5Out = s5_57;
					return ra_52;
				}
				a0_128 = 0x04;
			}
l2307F7DA:
			0x00 = (int8) dwArg0198;
			s0Out = dwArg0158;
			s1Out = s1;
			a0Out = a0_128;
			a2Out = dwArg0138;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArgF4;
			s5Out = s5;
			return ra;
		}
	}
	a0_128 = at_get_newline(a0_24, out a4, out a5);
	goto l2307F7DA;
}

// 2307F842: Register Eq_2 at_queue_init(Register Eq_2 ra, Register word32 a0, Register int32 a1, Register Eq_450439 a2)
// Called from:
//      at_cmd_init
Eq_2 at_queue_init(Eq_2 ra, word32 a0, int32 a1, Eq_450439 a2)
{
	if (a0 == 0x00 || a2 == 0x00)
		return ra;
	word32 a5_107;
	word32 a4_106;
	word32 a3_105;
	word32 a2_104;
	word32 a1_103;
	word32 a0_102;
	word32 t1_101;
	Eq_2 ra_34 = memset(ra, 1107411700, 0x00, 0x14, out t1_101, out a0_102, out a1_103, out a2_104, out a3_105, out a4_106, out a5_107);
	g_t4200F6E8 = a2;
	g_dw4201C2F4 = a0;
	g_dw4201C2F8 = a1;
	return ra_34;
}

// 2307F894: Register Eq_2 at_queue_get(Register Eq_2 ra, Register (ptr32 Eq_460480) a0, Register (ptr32 Eq_460223) a4, Register out ptr32 s0Out, Register out (ptr32 Eq_460480) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_460223) a4Out, Register out Eq_450439 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_460491) s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_460493) s7Out, Register out ptr32 s8Out, Register out Eq_460495 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      at_parse
Eq_2 at_queue_get(Eq_2 ra, struct Eq_460480 * a0, struct Eq_460223 * a4, ptr32 & s0Out, struct Eq_460480 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, struct Eq_460223 & a4Out, union Eq_450439 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_460491 & s5Out, ptr32 & s6Out, struct Eq_460493 & s7Out, ptr32 & s8Out, union Eq_460495 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_450439 a5_107;
	ptr32 a0_106;
	struct Eq_460223 * a5_12 = g_ptr4201C2FC;
	struct Eq_460480 * s1_14 = a0;
	if (a5_12 <= null)
	{
		a5_107 = g_t4200F6E8;
		if (a5_107 == 0x00)
		{
l2307F8BA:
			a0_106 = 0x02;
			goto l2307F8BC;
		}
		struct Eq_464676 * sp_20;
		struct Eq_460223 * a0_25;
		word32 a7_126;
		word32 t3_125;
		word32 t0_137;
		word32 t4_138;
		a5_107();
		if (a0_25 <= null)
			goto l2307F8BA;
		a4 -= a5_107;
		a5_12 = null;
		if (a4 < a0_25)
		{
			word32 t4_305;
			word32 a2_302;
			word32 a3_303;
			word32 a7_304;
			word32 a0_300;
			word32 a1_301;
			ra = printf(ra, &g_t230C5910, a3, sp_20->t0008, sp_20->t0028, sp_20->t0070, sp_20->t0074, sp_20->t0098, sp_20->t00BC, out s1_14, out a0_300, out a1_301, out a2_302, out a3_303, out a4, out a5_12, out a7_304, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_305);
		}
		else
		{
			do
			{
				*((word32) a3 + 0x0011) = a4->dw0000;
				word32 a4_46 = a4 + a3;
				Mem47[a4_46 + 0x00:byte] = SLICE(CONVERT(Mem41[sp_20 + a5_12:byte], byte, word32), byte, 0);
				word32 s0_49 = *((word32) a3 + 4);
				if (a4_46 >= a3)
					a4_46.u0 = 0x00;
				*((word32) a4_46 + 16) = s0_49;
				a4 = (word32) a4_46 + 1;
				a4[8] = (struct Eq_460223) *((word32) a4_46 + 8);
				++a5_12;
			} while (a0_25 != a5_12);
		}
	}
	a3 = a4 + 1;
	*((word32) a3 + 0x0C) = a5_12->dw0000;
	word32 a5_101 = CONVERT(Mem92[a5_12 + a4:byte], byte, word32);
	s1_14->b0000 = (byte) (byte) a5_101;
	word32 s0_100 = a4[4];
	if (a5_101 >= a4)
		a5_101 = null;
	a5_101[0x0C] = (struct Eq_460223) s0_100;
	a5_107 = (char *) a5_101 - 1;
	*((word32) a5_107 + 8) = a5_101[8];
	a0_106 = 0x00;
l2307F8BC:
	s0Out = dwArgE4;
	s1Out = s1_14;
	a0Out = a0_106;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_107;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

