pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307F946: Register Eq_2 at_queue_peek(Register Eq_2 ra, Register (ptr32 Eq_460997) a0, Register (ptr32 Eq_460223) a4, Register out (ptr32 Eq_460997) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_460223) a4Out, Register out Eq_450439 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out (ptr32 Eq_461006) s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_461008) s7Out, Register out ptr32 s8Out, Register out Eq_461010 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      at_parse
Eq_2 at_queue_peek(Eq_2 ra, struct Eq_460997 * a0, struct Eq_460223 * a4, struct Eq_460997 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, struct Eq_460223 & a4Out, union Eq_450439 & a5Out, ptr32 & s2Out, ptr32 & s4Out, struct Eq_461006 & s5Out, ptr32 & s6Out, struct Eq_461008 & s7Out, ptr32 & s8Out, union Eq_461010 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_450439 a5_140;
	ptr32 a0_127;
	struct Eq_460223 * a5_12 = g_ptr4201C2FC;
	struct Eq_460997 * s1_14 = a0;
	if (a5_12 <= null)
	{
		a5_140 = g_t4200F6E8;
		if (a5_140 == 0x00)
		{
l2307F96C:
			a0_127 = 0x02;
l2307F96E:
			s1Out = s1_14;
			a0Out = a0_127;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_140;
			s2Out = s2;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			return ra;
		}
		struct Eq_464813 * sp_20;
		struct Eq_460223 * a0_25;
		word32 s3_118;
		word32 a7_114;
		word32 t3_113;
		word32 t0_125;
		word32 t4_126;
		a5_140();
		if (a0_25 <= null)
			goto l2307F96C;
		a4 -= a5_140;
		a5_12 = null;
		if (a4 < a0_25)
		{
			word32 t4_270;
			word32 a7_268;
			word32 s3_269;
			word32 a1_266;
			word32 a2_267;
			word32 a0_265;
			ra = printf(ra, &g_t230C5910, a3, sp_20->t0008, sp_20->t0028, sp_20->t0070, sp_20->t0074, sp_20->t0098, sp_20->t00BC, out s1_14, out a0_265, out a1_266, out a2_267, out a3, out a4, out a5_12, out a7_268, out s2, out s3_269, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_270);
		}
		else
		{
			do
			{
				*((word32) a3 + 0x0011) = a4->dw0000;
				word32 a4_46 = a4 + a3;
				Mem47[a4_46 + 0x00:byte] = SLICE(CONVERT(Mem41[sp_20 + a5_12:byte], byte, word32), byte, 0);
				word32 s0_49 = *((word32) a3 + 4);
				if (a4_46 >= a3)
					a4_46.u0 = 0x00;
				*((word32) a4_46 + 16) = s0_49;
				a4 = (word32) a4_46 + 1;
				a4[8] = (struct Eq_460223) *((word32) a4_46 + 8);
				++a5_12;
			} while (a0_25 != a5_12);
		}
	}
	a5_140 = CONVERT(Mem86[a5_12 + a4:byte], byte, word32);
	s1_14->b0000 = (byte) (byte) a5_140;
	a0_127 = 0x00;
	goto l2307F96E;
}

// 2307F9E0: void create_tcp_udp_handler(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08)
void create_tcp_udp_handler(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08)
{
	word32 a7_555;
	word32 s2_556;
	word32 a5_554;
	word32 s5_559;
	word32 s3_557;
	word32 s4_558;
	word32 s7_561;
	word32 s8_562;
	word32 s6_560;
	word32 a2_551;
	word32 a3_552;
	word32 a4_553;
	word32 s1_548;
	word32 a0_549;
	word32 a1_550;
	word32 s9_563;
	word32 s10_564;
	word32 s11_565;
	word32 t4_566;
	word32 t1_567;
	word32 a0_568;
	word32 a1_569;
	word32 a2_570;
	word32 a3_571;
	word32 a4_572;
	word32 a5_573;
	Eq_2 ra_48 = memset(printf(ra, &g_t230C5A64, a3, dwLoc0188, dwLoc0168, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_548, out a0_549, out a1_550, out a2_551, out a3_552, out a4_553, out a5_554, out a7_555, out s2_556, out s3_557, out s4_558, out s5_559, out s6_560, out s7_561, out s8_562, out s9_563, out s10_564, out s11_565, out t4_566), fp + -300, 0x00, 0x011C, out t1_567, out a0_568, out a1_569, out a2_570, out a3_571, out a4_572, out a5_573);
	Eq_2 s0_70 = *(union Eq_2 *) 0x00FFFC04;
	int32 a4_90 = (word32) *(union Eq_2 *) 0x00FFFC04;
	if (a4_90 == 63)
	{
l2307FA84:
		at_callback_do(fp + -300);
		return;
	}
	if (a4_90 != 61)
		return;
	*(union Eq_2 *) 0x00FFFC05 = s0_70;
	word32 a0_99;
	int32 a4_102;
	Eq_2 s0_105;
	Eq_2 s1_111;
	word32 a2_574;
	word32 a3_575;
	word32 a5_576;
	word32 s2_577;
	word32 s3_578;
	word32 s4_579;
	word32 s5_580;
	Eq_2 ra_117 = at_get_parameters(ra_48, s0_70, fp + -396, 0x02, fp + -400, 0x00FFFC05, dwLocEC, 0x00FFFC04, dwLocBC, dwLocA0, dwLoc9C, dwLoc78, dwLoc58, dwLoc38, dwLoc18, dwArg08, out s0_105, out s1_111, out a0_99, out a2_574, out a3_575, out a4_102, out a5_576, out s2_577, out s3_578, out s4_579, out s5_580);
	if (a0_99 != 0x00 || a4_102 > 0x04)
		return;
	byte * a1_158;
	word32 a1_581;
	word32 a2_582;
	word32 a3_583;
	word32 a4_584;
	Eq_4455 a5_129;
	if (strcmp(s1_111, 588012160, out a1_581, out a2_582, out a3_583, out a4_584, out a5_129) != 0x00)
	{
		word32 a1_585;
		word32 a2_586;
		word32 a3_587;
		word32 a4_588;
		if (strcmp(s1_111, 588012164, out a1_585, out a2_586, out a3_587, out a4_588, out a5_129) != 0x00)
		{
			word32 a1_698;
			word32 a2_699;
			word32 a3_700;
			word32 a4_701;
			if (strcmp(s1_111, 588012468, out a1_698, out a2_699, out a3_700, out a4_701, out a5_129) != 0x00)
				return;
			a1_158 = fp + -336;
l2307FAD4:
			word32 a0_176;
			word32 s0_702;
			word32 s1_703;
			word32 a2_704;
			word32 a3_705;
			word32 a4_706;
			word32 a5_707;
			word32 s2_708;
			word32 s3_709;
			word32 s4_710;
			word32 s5_711;
			Eq_2 ra_194 = at_get_parameters(ra_117, s0_105, a1_158, 0x03, fp + -400, a5_129, dwLocEC, 0x00FFFC04, dwLocBC, dwLocA0, dwLoc9C, dwLoc78, dwLoc58, dwLoc38, dwLoc18, dwArg08, out s0_702, out s1_703, out a0_176, out a2_704, out a3_705, out a4_706, out a5_707, out s2_708, out s3_709, out s4_710, out s5_711);
			if (a0_176 != 0x00)
				return;
			Eq_2 a3_203;
			Eq_2 a3_228;
			Eq_2 a3_253;
			Eq_2 a3_278;
			Eq_2 a3_303;
			word32 s1_589;
			word32 a0_590;
			word32 a1_591;
			word32 a2_592;
			word32 a4_593;
			word32 a5_594;
			word32 a7_595;
			word32 s2_596;
			word32 s3_597;
			word32 s4_598;
			word32 s5_599;
			word32 s6_600;
			word32 s7_601;
			word32 s8_602;
			word32 s9_603;
			word32 s10_604;
			word32 s11_605;
			word32 t4_606;
			word32 s1_607;
			word32 a0_608;
			word32 a1_609;
			word32 a2_610;
			word32 a4_611;
			word32 a5_612;
			word32 a7_613;
			word32 s2_614;
			word32 s3_615;
			word32 s4_616;
			word32 s5_617;
			word32 s6_618;
			word32 s7_619;
			word32 s8_620;
			word32 s9_621;
			word32 s10_622;
			word32 s11_623;
			word32 t4_624;
			word32 s1_625;
			word32 a0_626;
			word32 a1_627;
			word32 a2_628;
			word32 a4_629;
			word32 a5_630;
			word32 a7_631;
			word32 s2_632;
			word32 s3_633;
			word32 s4_634;
			word32 s5_635;
			word32 s6_636;
			word32 s7_637;
			word32 s8_638;
			word32 s9_639;
			word32 s10_640;
			word32 s11_641;
			word32 t4_642;
			word32 s1_643;
			word32 a0_644;
			word32 a1_645;
			word32 a2_646;
			word32 a4_647;
			word32 a5_648;
			word32 a7_649;
			word32 s2_650;
			word32 s3_651;
			word32 s4_652;
			word32 s5_653;
			word32 s6_654;
			word32 s7_655;
			word32 s8_656;
			word32 s9_657;
			word32 s10_658;
			word32 s11_659;
			word32 t4_660;
			word32 s1_661;
			word32 a0_662;
			word32 a1_663;
			word32 a2_664;
			word32 a4_665;
			word32 a5_666;
			word32 a7_667;
			word32 s2_668;
			word32 s3_669;
			word32 s4_670;
			word32 s5_671;
			word32 s6_672;
			word32 s7_673;
			word32 s8_674;
			word32 s9_675;
			word32 s10_676;
			word32 s11_677;
			word32 t4_678;
			word32 s1_679;
			word32 a0_680;
			word32 a1_681;
			word32 a2_682;
			word32 a3_683;
			word32 a4_684;
			word32 a5_685;
			word32 a7_686;
			word32 s2_687;
			word32 s3_688;
			word32 s4_689;
			word32 s5_690;
			word32 s6_691;
			word32 s7_692;
			word32 s8_693;
			word32 s9_694;
			word32 s10_695;
			word32 s11_696;
			word32 t4_697;
			printf(printf(printf(printf(printf(printf(ra_194, &g_t230C5A88, dwLoc1C, dwLoc0188, fp + -28, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_589, out a0_590, out a1_591, out a2_592, out a3_203, out a4_593, out a5_594, out a7_595, out s2_596, out s3_597, out s4_598, out s5_599, out s6_600, out s7_601, out s8_602, out s9_603, out s10_604, out s11_605, out t4_606), &g_t230C5AB8, a3_203, dwLoc0188, fp + -28, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_607, out a0_608, out a1_609, out a2_610, out a3_228, out a4_611, out a5_612, out a7_613, out s2_614, out s3_615, out s4_616, out s5_617, out s6_618, out s7_619, out s8_620, out s9_621, out s10_622, out s11_623, out t4_624), &g_t230C5AE8, a3_228, dwLoc0188, fp + -28, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_625, out a0_626, out a1_627, out a2_628, out a3_253, out a4_629, out a5_630, out a7_631, out s2_632, out s3_633, out s4_634, out s5_635, out s6_636, out s7_637, out s8_638, out s9_639, out s10_640, out s11_641, out t4_642), &g_t230C5B1C, a3_253, dwLoc0188, fp + -28, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_643, out a0_644, out a1_645, out a2_646, out a3_278, out a4_647, out a5_648, out a7_649, out s2_650, out s3_651, out s4_652, out s5_653, out s6_654, out s7_655, out s8_656, out s9_657, out s10_658, out s11_659, out t4_660), &g_t230C5B4C, a3_278, dwLoc0188, fp + -28, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_661, out a0_662, out a1_663, out a2_664, out a3_303, out a4_665, out a5_666, out a7_667, out s2_668, out s3_669, out s4_670, out s5_671, out s6_672, out s7_673, out s8_674, out s9_675, out s10_676, out s11_677, out t4_678), &g_t230C5B80, a3_303, dwLoc0188, fp + -28, dwLoc0120, dwLoc011C, dwLocF8, dwLocD4, out s1_679, out a0_680, out a1_681, out a2_682, out a3_683, out a4_684, out a5_685, out a7_686, out s2_687, out s3_688, out s4_689, out s5_690, out s6_691, out s7_692, out s8_693, out s9_694, out s10_695, out s11_696, out t4_697);
			goto l2307FA84;
		}
	}
	a1_158 = fp + -372;
	goto l2307FAD4;
}

// 2307FB66: void close_network_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58)
void close_network_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58)
{
	word32 a5_209;
	word32 a4_208;
	word32 a3_207;
	word32 a2_206;
	word32 a1_205;
	word32 a0_204;
	word32 s1_203;
	word32 a7_210;
	word32 s2_211;
	word32 s3_212;
	word32 s4_213;
	word32 s5_214;
	word32 s6_215;
	word32 s7_216;
	word32 s8_217;
	word32 s9_218;
	word32 s10_219;
	word32 s11_220;
	word32 t4_221;
	word32 t1_222;
	word32 a0_223;
	word32 a1_224;
	word32 a2_225;
	word32 a3_226;
	word32 a4_227;
	word32 a5_228;
	Eq_2 ra_46 = memset(printf(ra, &g_t230C5A64, a3, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_203, out a0_204, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out a7_210, out s2_211, out s3_212, out s4_213, out s5_214, out s6_215, out s7_216, out s8_217, out s9_218, out s10_219, out s11_220, out t4_221), fp + -300, 0x00, 0x011C, out t1_222, out a0_223, out a1_224, out a2_225, out a3_226, out a4_227, out a5_228);
	Eq_2 s0_58 = *(union Eq_2 *) 0x00FFFC04;
	if ((word32) *(union Eq_2 *) 0x00FFFC04 != 61)
		return;
	*(union Eq_2 *) 0x00FFFC05 = s0_58;
	word32 a0_67;
	int32 a5_71;
	Eq_2 a3_84;
	word32 s0_229;
	word32 s1_230;
	word32 a2_231;
	word32 a4_232;
	word32 s2_233;
	word32 s3_234;
	word32 s4_235;
	word32 s5_236;
	Eq_2 ra_85 = at_get_parameters(ra_46, s0_58, fp + -312, 0x01, fp + -316, 0x00FFFC05, dwLoc9C, dwLoc98, dwLoc6C, dwLoc50, dwLoc4C, dwLoc28, s0, dwArg18, dwArg38, dwArg58, out s0_229, out s1_230, out a0_67, out a2_231, out a3_84, out a4_232, out a5_71, out s2_233, out s3_234, out s4_235, out s5_236);
	if (a0_67 != 0x00 || a5_71 <= 0x00)
		return;
	word32 s1_237;
	word32 a0_238;
	word32 a1_239;
	word32 a2_240;
	word32 a3_241;
	word32 a4_242;
	word32 a5_243;
	word32 a7_244;
	word32 s2_245;
	word32 s3_246;
	word32 s4_247;
	word32 s5_248;
	word32 s6_249;
	word32 s7_250;
	word32 s8_251;
	word32 s9_252;
	word32 s10_253;
	word32 s11_254;
	word32 t4_255;
	printf(ra_85, &g_t230C5A34, a3_84, 0x00FFFC04, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_237, out a0_238, out a1_239, out a2_240, out a3_241, out a4_242, out a5_243, out a7_244, out s2_245, out s3_246, out s4_247, out s5_248, out s6_249, out s7_250, out s8_251, out s9_252, out s10_253, out s11_254, out t4_255);
	at_callback_do(fp + -300);
}

// 2307FBF6: void send_data_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38)
void send_data_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg38)
{
	word24 nLoc0137_237 = SLICE(dwLoc0138, word24, 8);
	struct Eq_465562 * a5_78;
	word32 s1_360;
	word32 a4_358;
	word32 a5_359;
	word32 a1_355;
	word32 a2_356;
	word32 a3_357;
	word32 t4_352;
	word32 t1_353;
	word32 a0_354;
	word32 s11_351;
	word32 s10_350;
	word32 s9_349;
	word32 s8_348;
	word32 s7_347;
	word32 s6_346;
	word32 s5_345;
	word32 s2_342;
	word32 s3_343;
	word32 s4_344;
	word32 a7_341;
	word32 a4_339;
	word32 a5_340;
	word32 a2_337;
	word32 a3_338;
	word32 a0_335;
	word32 a1_336;
	word32 s1_334;
	word32 a0_361;
	word32 a1_362;
	word32 a2_363;
	word32 a3_364;
	word32 a4_365;
	word32 a7_366;
	word32 s2_367;
	word32 s3_368;
	word32 s4_369;
	word32 s5_370;
	word32 s6_371;
	word32 s7_372;
	word32 s8_373;
	word32 s9_374;
	word32 s10_375;
	word32 s11_376;
	word32 t4_377;
	Eq_2 ra_85 = printf(memset(printf(ra, &g_t230C5BB8, a3, dwLoc0158, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_334, out a0_335, out a1_336, out a2_337, out a3_338, out a4_339, out a5_340, out a7_341, out s2_342, out s3_343, out s4_344, out s5_345, out s6_346, out s7_347, out s8_348, out s9_349, out s10_350, out s11_351, out t4_352), fp + -300, 0x00, 0x011C, out t1_353, out a0_354, out a1_355, out a2_356, out a3_357, out a4_358, out a5_359), &g_t230C5BD4, 0x03, dwLoc0158, SEQ(nLoc0137_237, 0x03), dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_360, out a0_361, out a1_362, out a2_363, out a3_364, out a4_365, out a5_78, out a7_366, out s2_367, out s3_368, out s4_369, out s5_370, out s6_371, out s7_372, out s8_373, out s9_374, out s10_375, out s11_376, out t4_377);
	Eq_2 s0_99 = a5_78->t0000;
	if ((word32) a5_78->t0000 != 61)
		return;
	a5_78->t0001 = s0_99;
	word32 a0_108;
	union Eq_2 * a4_111;
	Eq_2 s1_120;
	struct Eq_465690 * a3_125;
	word32 s0_378;
	word32 a2_379;
	word32 a5_380;
	word32 s2_381;
	word32 s3_382;
	word32 s4_383;
	word32 s5_384;
	Eq_2 ra_126 = at_get_parameters(ra_85, s0_99, fp + -348, 0x04, fp + -352, &a5_78->t0001, dwLocBC, dwLocB8, dwLoc8C, dwLoc70, dwLoc6C, dwLoc48, dwLoc28, s0, dwArg18, dwArg38, out s0_378, out s1_120, out a0_108, out a2_379, out a3_125, out a4_111, out a5_380, out s2_381, out s3_382, out s4_383, out s5_384);
	if (a0_108 != 0x00)
		return;
	0x00 = (int8) dwLoc9C;
	if (a4_111 <= (union Eq_2 *) 0x01)
		return;
	Eq_2 s0_129 = *a4_111;
	if (a4_111 != null)
	{
		word32 a1_385;
		word32 a2_386;
		word32 a3_387;
		word32 a4_388;
		word32 a5_389;
		word32 a6_390;
		word32 a7_391;
		memcpy(s1_120, 0x4202795C, 0x0100, out a1_385, out a2_386, out a3_387, out a4_388, out a5_389, out a6_390, out a7_391);
		at_callback_do(fp + -300);
	}
	else
	{
		if (a3_125 <= (struct Eq_465690 *) 0x04)
		{
			ra_126 = dwLoc9C;
			if (true)
			{
				*(union Eq_2 *) 0x01 = s0_129;
				a3_125->t0008 = s0_129;
				*(union Eq_2 *) 0x10 = s0_129;
				*((word32) s0_129 + 272) = (word16) dwLoc18;
				word32 a1_399;
				word32 a2_400;
				word32 a3_401;
				word32 a4_402;
				word32 a5_403;
				word32 a6_404;
				word32 a7_405;
				memcpy(0x4202795C, s1_120, 0x0100, out a1_399, out a2_400, out a3_401, out a4_402, out a5_403, out a6_404, out a7_405);
				return;
			}
		}
		word32 t1_392;
		word32 a0_393;
		word32 a1_394;
		word32 a2_395;
		word32 a3_396;
		word32 a4_397;
		word32 a5_398;
		memset(ra_126, 0x4202794C, 0x00, 0x0518, out t1_392, out a0_393, out a1_394, out a2_395, out a3_396, out a4_397, out a5_398);
	}
}

// 2307FD36: void ap_server_handler(Register Eq_2 ra, Register Eq_2 s0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38)
void ap_server_handler(Eq_2 ra, Eq_2 s0, Eq_2 dwArg18, Eq_2 dwArg38)
{
	Eq_2 a0_19 = *(union Eq_2 *) 0x00FFFC04;
	Eq_2 dwLoc0138_173 = SEQ(nLoc0137, 0x03);
	if ((word32) *(union Eq_2 *) 0x00FFFC04 != 61)
		return;
	*(union Eq_2 *) 0x00FFFC05 = a0_19;
	word32 a0_36;
	int32 a4_39;
	int32 s0_42;
	Eq_2 a3_53;
	word32 s2_246;
	word32 s3_247;
	word32 s5_249;
	word32 s4_248;
	word32 s1_243;
	word32 a2_244;
	word32 a5_245;
	at_get_parameters(ra, a0_19, fp + -348, 0x04, fp + -352, 0x00FFFC05, dwLocBC, dwLocB8, dwLoc8C, dwLoc70, dwLoc6C, dwLoc48, dwLoc28, s0, dwArg18, dwArg38, out s0_42, out s1_243, out a0_36, out a2_244, out a3_53, out a4_39, out a5_245, out s2_246, out s3_247, out s4_248, out s5_249);
	if (a0_36 != 0x00)
		return;
	0x00 = dwLoc9C;
	if (a4_39 <= 0x00)
		return;
	if (a4_39 != 0x02)
	{
		if (a4_39 == s0_42)
		{
l2307FDAE:
			goto l2307FDB0;
		}
		if (a4_39 != 0x01)
		{
l2307FDB0:
			up32 a3_80;
			word32 s1_250;
			word32 a0_251;
			word32 a1_252;
			word32 a2_253;
			word32 a4_254;
			word32 a5_255;
			word32 a7_256;
			word32 s2_257;
			word32 s3_258;
			word32 s4_259;
			word32 s5_260;
			word32 s6_261;
			word32 s7_262;
			word32 s8_263;
			word32 s9_264;
			word32 s10_265;
			word32 s11_266;
			word32 t4_267;
			printf(0x00FFFC04, &g_t230C5970, a3_53, dwLoc0158, dwLoc0138_173, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_250, out a0_251, out a1_252, out a2_253, out a3_80, out a4_254, out a5_255, out a7_256, out s2_257, out s3_258, out s4_259, out s5_260, out s6_261, out s7_262, out s8_263, out s9_264, out s10_265, out s11_266, out t4_267);
			if (a3_80 < 0x10000000)
				at_callback_do(fp + -300);
			return;
		}
	}
	goto l2307FDAE;
}

