pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 2307FDEC: void client_ssl_config_path(Register Eq_2 ra, Register Eq_2 s1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28)
void client_ssl_config_path(Eq_2 ra, Eq_2 s1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	Eq_2 a5_22;
	word32 a2_731;
	word32 t1_728;
	word32 a0_729;
	word32 a1_730;
	Eq_2 ra_23 = memset(ra, fp + -300, 0x00, 0x011C, out t1_728, out a0_729, out a1_730, out a2_731, out a3_20, out a4_21, out a5_22);
	Eq_2 a0_28;
	Eq_2 a3_31;
	Eq_2 a4_32;
	Eq_2 a5_33;
	Eq_2 s1_36;
	word32 s8_738;
	word32 s2_735;
	word32 s3_736;
	word32 s4_737;
	word32 a6_734;
	word32 a2_733;
	word32 a1_732;
	pvPortMalloc(ra_23, s1, 64, a3_20, a4_21, a5_22, mstatus, dwLoc0130, dwLoc012C, dwLocE4, dwLoc38, dwArg08, out s1_36, out a0_28, out a1_732, out a2_733, out a3_31, out a4_32, out a5_33, out a6_734, out s2_735, out s3_736, out s4_737, out s8_738);
	Eq_2 a3_48;
	Eq_2 a4_49;
	Eq_2 a5_50;
	Eq_2 s1_53;
	word32 s4_745;
	word32 s8_746;
	word32 a6_742;
	word32 s2_743;
	word32 s3_744;
	word32 a0_739;
	word32 a1_740;
	word32 a2_741;
	pvPortMalloc(ra_23, s1_36, 64, a3_31, a4_32, a5_33, mstatus, dwLoc0130, dwLoc012C, dwLocE4, dwLoc38, dwArg08, out s1_53, out a0_739, out a1_740, out a2_741, out a3_48, out a4_49, out a5_50, out a6_742, out s2_743, out s3_744, out s4_745, out s8_746);
	word32 a3_65;
	Eq_2 s2_71;
	word32 a6_750;
	word32 a4_749;
	word32 s4_752;
	word32 s8_753;
	word32 s3_751;
	word32 s1_747;
	word32 a1_748;
	Eq_2 a0_359;
	Eq_2 a5_356;
	Eq_2 a2_353;
	pvPortMalloc(ra_23, s1_53, 64, a3_48, a4_49, a5_50, mstatus, dwLoc0130, dwLoc012C, dwLocE4, dwLoc38, dwArg08, out s1_747, out a0_359, out a1_748, out a2_353, out a3_65, out a4_749, out a5_356, out a6_750, out s2_71, out s3_751, out s4_752, out s8_753);
	if (a0_359 != 0x00)
	{
		if (a3_65 != 0x00 && a0_359 != 0x00)
		{
			byte * a5_93 = *s2_71;
			if ((word32) *a5_93 != 61)
				return;
			*s2_71 = a5_93 + 1;
			Eq_2 s1_126;
			word32 s2_772;
			word32 s3_773;
			word32 s4_774;
			word32 s0_770;
			word32 a3_771;
			word32 s5_775;
			Eq_2 a4_117;
			Eq_2 a0_114;
			Eq_2 a5_118;
			Eq_2 a2_116;
			Eq_2 ra_132 = at_get_parameters(ra_23, s2_71, fp + -360, 0x05, fp + -364, a5_93 + 1, dwLocCC, a0_28, dwLoc9C, dwLoc80, dwLoc7C, dwLoc58, dwLoc38, dwLoc18, dwArg08, dwArg28, out s0_770, out s1_126, out a0_114, out a2_116, out a3_771, out a4_117, out a5_118, out s2_772, out s3_773, out s4_774, out s5_775);
			if (a0_114 != 0x00 || a4_117 <= 0x01)
				return;
			Eq_2 a3_139;
			if (a5_118 == 0x01)
			{
				a5_118.u0 = 0x04;
				if (a4_117 <= 0x04)
					goto l2307FEE0;
				word32 s0_873;
				word32 s1_874;
				word32 a0_875;
				word32 a1_876;
				word32 a5_877;
				word32 a6_878;
				word32 s4_879;
				word32 t3_880;
				vPortFree(a0_114, a2_116, 0x04, mstatus, dwLoc18, dwArg28, out s0_873, out s1_874, out a0_875, out a1_876, out a2_116, out a3_139, out a4_117, out a5_877, out a6_878, out s4_879, out t3_880);
				goto l2307FF6C;
			}
			if (a5_118 <= 0x01)
			{
				if (a5_118 != 0x00)
					goto l2307FEE0;
				Eq_2 a2_181;
				Eq_2 a5_184;
				Eq_2 a0_187;
				word32 a1_789;
				word32 s1_788;
				word32 s0_787;
				word32 a6_792;
				word32 a4_791;
				word32 a3_790;
				word32 s4_793;
				word32 t3_794;
				vPortFree(a0_114, a2_116, a5_118, mstatus, dwLoc18, dwArg28, out s0_787, out s1_788, out a0_187, out a1_789, out a2_181, out a3_790, out a4_791, out a5_184, out a6_792, out s4_793, out t3_794);
				Eq_2 a2_194;
				Eq_2 a5_197;
				Eq_2 a0_200;
				word32 s0_795;
				word32 s1_796;
				word32 a4_799;
				word32 a6_800;
				word32 s4_801;
				word32 t3_802;
				word32 a1_797;
				word32 a3_798;
				vPortFree(a0_187, a2_181, a5_184, mstatus, dwLoc18, dwArg28, out s0_795, out s1_796, out a0_200, out a1_797, out a2_194, out a3_798, out a4_799, out a5_197, out a6_800, out s4_801, out t3_802);
				word32 s0_803;
				word32 s1_804;
				word32 a0_805;
				word32 a1_806;
				word32 a5_807;
				word32 a6_808;
				word32 s4_809;
				word32 t3_810;
				vPortFree(a0_200, a2_194, a5_197, mstatus, dwLoc18, dwArg28, out s0_803, out s1_804, out a0_805, out a1_806, out a2_116, out a3_139, out a4_117, out a5_807, out a6_808, out s4_809, out t3_810);
l2307FF6C:
				goto l2307FF0A;
			}
			a3_139.u0 = 0x02;
			if (a5_118 != 0x02)
			{
				if (a5_118 == s1_126)
				{
					a5_118.u0 = 0x04;
					if (a4_117 > 0x04)
						goto l2307FF0A;
				}
			}
			else if (a4_117 != a5_118)
			{
				Eq_2 a2_152;
				Eq_2 a5_155;
				Eq_2 a0_158;
				word32 s0_857;
				word32 s1_858;
				word32 a1_859;
				word32 a3_860;
				word32 a4_861;
				word32 a6_862;
				word32 s4_863;
				word32 t3_864;
				vPortFree(a0_114, a2_116, a5_118, mstatus, dwLoc18, dwArg28, out s0_857, out s1_858, out a0_158, out a1_859, out a2_152, out a3_860, out a4_861, out a5_155, out a6_862, out s4_863, out t3_864);
				word32 s0_865;
				word32 s1_866;
				word32 a0_867;
				word32 a1_868;
				word32 a5_869;
				word32 a6_870;
				word32 s4_871;
				word32 t3_872;
				vPortFree(a0_158, a2_152, a5_155, mstatus, dwLoc18, dwArg28, out s0_865, out s1_866, out a0_867, out a1_868, out a2_116, out a3_139, out a4_117, out a5_869, out a6_870, out s4_871, out t3_872);
l2307FF0A:
				if (a3_139 == 0x00)
					a3_139.u0 = 588017084;
				word32 s1_838;
				word32 a0_839;
				word32 a1_840;
				word32 a2_841;
				word32 a3_842;
				word32 a4_843;
				word32 a5_844;
				word32 a7_845;
				word32 s2_846;
				word32 s3_847;
				word32 s4_848;
				word32 s5_849;
				word32 s6_850;
				word32 s7_851;
				word32 s8_852;
				word32 s9_853;
				word32 s10_854;
				word32 s11_855;
				word32 t4_856;
				printf(ra_132, &g_t230C59A4, a3_139, 0x0403, dwLoc0148, dwLoc0100, dwLocFC, 0x00FFFC40, dwLocB4, out s1_838, out a0_839, out a1_840, out a2_841, out a3_842, out a4_843, out a5_844, out a7_845, out s2_846, out s3_847, out s4_848, out s5_849, out s6_850, out s7_851, out s8_852, out s9_853, out s10_854, out s11_855, out t4_856);
				at_callback_do(fp + -300);
				return;
			}
l2307FEE0:
			if (a0_114 != 0x00)
			{
				word32 s0_811;
				word32 s1_812;
				word32 a1_813;
				word32 a3_814;
				word32 a4_815;
				word32 a6_816;
				word32 s4_817;
				word32 t3_818;
				vPortFree(a0_114, a2_116, a5_118, mstatus, dwLoc18, dwArg28, out s0_811, out s1_812, out a0_114, out a1_813, out a2_116, out a3_814, out a4_815, out a5_118, out a6_816, out s4_817, out t3_818);
			}
			if (a0_114 != 0x00)
			{
				word32 s0_819;
				word32 s1_820;
				word32 a1_821;
				word32 a3_822;
				word32 a4_823;
				word32 a6_824;
				word32 s4_825;
				word32 t3_826;
				vPortFree(a0_114, a2_116, a5_118, mstatus, dwLoc18, dwArg28, out s0_819, out s1_820, out a0_114, out a1_821, out a2_116, out a3_822, out a4_823, out a5_118, out a6_824, out s4_825, out t3_826);
			}
			if (a0_114 != 0x00)
			{
				word32 s0_827;
				word32 s1_828;
				word32 a0_829;
				word32 a1_830;
				word32 a2_831;
				word32 a3_832;
				word32 a4_833;
				word32 a5_834;
				word32 a6_835;
				word32 s4_836;
				word32 t3_837;
				vPortFree(a0_114, a2_116, a5_118, mstatus, dwLoc18, dwArg28, out s0_827, out s1_828, out a0_829, out a1_830, out a2_831, out a3_832, out a4_833, out a5_834, out a6_835, out s4_836, out t3_837);
			}
			return;
		}
		word32 s0_754;
		word32 s1_755;
		word32 a1_756;
		word32 a3_757;
		word32 a4_758;
		word32 a6_759;
		word32 s4_760;
		word32 t3_761;
		vPortFree(a0_359, a2_353, a5_356, mstatus, dwLoc18, dwArg28, out s0_754, out s1_755, out a0_359, out a1_756, out a2_353, out a3_757, out a4_758, out a5_356, out a6_759, out s4_760, out t3_761);
	}
	if (a0_359 != 0x00)
	{
		word32 s0_762;
		word32 s4_768;
		word32 t3_769;
		word32 s1_763;
		word32 a1_764;
		word32 a3_765;
		word32 a4_766;
		word32 a6_767;
		vPortFree(a0_359, a2_353, a5_356, mstatus, dwLoc18, dwArg28, out s0_762, out s1_763, out a0_359, out a1_764, out a2_353, out a3_765, out a4_766, out a5_356, out a6_767, out s4_768, out t3_769);
	}
	if (a0_359 != 0x00)
	{
		word32 s1_777;
		word32 a0_778;
		word32 s0_776;
		word32 a4_782;
		word32 a3_781;
		word32 a2_780;
		word32 a1_779;
		word32 s4_785;
		word32 a6_784;
		word32 a5_783;
		word32 t3_786;
		vPortFree(a0_359, a2_353, a5_356, mstatus, dwLoc18, dwArg28, out s0_776, out s1_777, out a0_778, out a1_779, out a2_780, out a3_781, out a4_782, out a5_783, out a6_784, out s4_785, out t3_786);
	}
}

// 2307FF88: void client_ssl_set_sni(Register Eq_2 ra, Register Eq_2 s0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38)
void client_ssl_set_sni(Eq_2 ra, Eq_2 s0, Eq_2 dwArg18, Eq_2 dwArg38)
{
	word32 t1_187;
	word32 a0_188;
	word32 a1_189;
	word32 a2_190;
	word32 a3_191;
	word32 a4_192;
	word32 a5_193;
	Eq_2 ra_21 = memset(ra, fp + -300, 0x00, 0x011C, out t1_187, out a0_188, out a1_189, out a2_190, out a3_191, out a4_192, out a5_193);
	Eq_2 s1_33 = *(union Eq_2 *) 0x00FFFD00;
	Eq_2 dwLoc0138_146 = SEQ(nLoc0137, 0x00);
	if ((word32) *(union Eq_2 *) 0x00FFFD00 == 61)
	{
		*(union Eq_2 *) 0x00FFFD01 = s1_33;
		word32 a0_46;
		Eq_2 s0_52;
		int32 a3_63;
		word32 s1_194;
		word32 a2_195;
		word32 a4_196;
		word32 a5_197;
		word32 s2_198;
		word32 s3_199;
		word32 s4_200;
		word32 s5_201;
		Eq_2 ra_64 = at_get_parameters(ra_21, s1_33, fp + -0x0144, 0x02, fp + -328, 0x00FFFD01, dwLocBC, dwLocB8, dwLoc8C, dwLoc70, dwLoc6C, dwLoc48, dwLoc28, s0, dwArg18, dwArg38, out s0_52, out s1_194, out a0_46, out a2_195, out a3_63, out a4_196, out a5_197, out s2_198, out s3_199, out s4_200, out s5_201);
		if (a0_46 == 0x00 && a3_63 > 0x01)
		{
			word32 a1_202;
			word32 a2_203;
			word32 a3_204;
			word32 a4_205;
			word32 a5_206;
			word32 s1_207;
			word32 a0_208;
			word32 a1_209;
			word32 a2_210;
			word32 a3_211;
			word32 a4_212;
			word32 a5_213;
			word32 a7_214;
			word32 s2_215;
			word32 s3_216;
			word32 s4_217;
			word32 s5_218;
			word32 s6_219;
			word32 s7_220;
			word32 s8_221;
			word32 s9_222;
			word32 s10_223;
			word32 s11_224;
			word32 t4_225;
			printf(ra_64, &g_t230C5A1C, strlen(s0_52, out a1_202, out a2_203, out a3_204, out a4_205, out a5_206), dwLoc0158, dwLoc0138_146, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_207, out a0_208, out a1_209, out a2_210, out a3_211, out a4_212, out a5_213, out a7_214, out s2_215, out s3_216, out s4_217, out s5_218, out s6_219, out s7_220, out s8_221, out s9_222, out s10_223, out s11_224, out t4_225);
			at_callback_do(fp + -300);
		}
	}
}

// 2308002C: void client_ssl_set_alpn(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38)
void client_ssl_set_alpn(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38)
{
	word32 a1_631;
	word32 a2_632;
	word32 t1_629;
	word32 a0_630;
	word32 a3_633;
	word32 a4_634;
	word32 a5_635;
	Eq_2 ra_25 = memset(ra, fp + -316, 0x00, 0x011C, out t1_629, out a0_630, out a1_631, out a2_632, out a3_633, out a4_634, out a5_635);
	Eq_2 s1_35 = *(union Eq_2 *) 0x00FFFC04;
	if ((word32) *(union Eq_2 *) 0x00FFFC04 != 61)
		return;
	*(union Eq_2 *) 0x00FFFC05 = s1_35;
	Eq_2 a0_45;
	int32 a4_48;
	word32 s0_636;
	word32 a3_639;
	word32 s1_637;
	word32 a2_638;
	word32 a5_640;
	word32 s2_641;
	word32 s3_642;
	word32 s4_643;
	word32 s5_644;
	Eq_2 ra_220 = at_get_parameters(ra_25, s1_35, fp + -328, 0x01, fp + -332, 0x00FFFC05, dwLocBC, dwLocB8, dwLoc8C, dwLoc70, dwLoc6C, dwLoc48, dwLoc28, s0, dwArg18, dwArg38, out s0_636, out s1_637, out a0_45, out a2_638, out a3_639, out a4_48, out a5_640, out s2_641, out s3_642, out s4_643, out s5_644);
	byte * a5_101 = (byte *) 0x04;
	if (a0_45 != 0x00 || a4_48 <= 0x00)
		return;
	Eq_2 a3_67 = 0x0D;
	word32 a4_68 = (word32) *(union Eq_2 *) 0x04;
	if (a4_68 != 0x0D)
	{
		a3_67.u0 = 0x0A;
		word32 s0_107 = 0x00;
		if (a4_68 != 0x0A)
		{
			while (true)
			{
				int32 a4_103 = (word32) *a5_101;
				if (a4_103 == 0x0D || a4_103 == 0x0A)
					break;
				if (a4_103 == 44)
					++s0_107;
				++a5_101;
			}
			*a5_101 = 0x00;
			Eq_2 a3_121;
			Eq_2 a4_122;
			Eq_2 a5_123;
			ptr32 a0_138;
			Eq_2 a1_139;
			word32 a6_671;
			word32 s4_674;
			word32 a1_664;
			word32 s1_666;
			word32 a2_667;
			word32 a2_665;
			word32 a4_669;
			word32 a5_670;
			word32 a3_668;
			word32 s2_672;
			word32 s3_673;
			word32 s8_675;
			Eq_2 s0_145 = pvPortMalloc(ra_220, *a0_45, (word32) strlen(a0_45, out a1_664, out a2_665, out a3_121, out a4_122, out a5_123) + 1 + (s0_107 + 0x02 << 2), a3_121, a4_122, a5_123, mstatus, dwLoc0120, dwLoc011C, fp + -308, dwLoc28, dwArg18, out s1_666, out a0_138, out a1_139, out a2_667, out a3_668, out a4_669, out a5_670, out a6_671, out s2_672, out s3_673, out s4_674, out s8_675);
			if (a0_138 == 0x00)
				return;
			(word32) s0_145 + a0_138 + 0x0FFC = 0x00;
			Eq_2 a1_166;
			word32 a5_172;
			word32 a4_683;
			word32 a6_684;
			word32 a7_685;
			word32 a2_681;
			word32 a3_682;
			word32 a5_679;
			word32 a3_677;
			word32 a2_676;
			word32 a4_678;
			word32 a1_680;
			memcpy(dwLocFC, a1_166, (word32) strlen(a1_139, out a1_166, out a2_676, out a3_677, out a4_678, out a5_679) + 1, out a1_680, out a2_681, out a3_682, out a4_683, out a5_172, out a6_684, out a7_685);
			*dwLocFC = a5_172;
			struct Eq_466846 * a0_185 = (word32) dwLocFC + 1;
			Eq_2 a3_186 = 44;
			ui32 a5_188 = 0x01;
			while (true)
			{
				int32 a4_191[] = (word32) a0_185->bFFFFFFFF;
				if (a4_191 == null)
					break;
				if (a4_191 == (int32 (*)[]) 44)
				{
					a0_185[0x0FFF] = (struct Eq_466846) 0x00;
					a0_185->dw0000 = (word32) (a4_191 + (a5_188 << 0x02) / 4);
					++a5_188;
				}
				++a0_185;
			}
			ui32 s0_192 = 0x00;
			word32 s3_193 = 0x230C6000;
			while (a4_191[s0_192] != 0x00)
			{
				byte * s2_269;
				word32 s1_710;
				word32 a0_711;
				word32 a1_712;
				word32 a2_713;
				word32 a5_714;
				word32 a7_715;
				word32 s4_716;
				word32 s5_717;
				word32 s6_718;
				word32 s7_719;
				word32 s8_720;
				word32 s9_721;
				word32 s10_722;
				word32 s11_723;
				word32 t4_724;
				ra_220 = printf(ra_220, s3_193 + -0x0624, a3_186, dwLoc0158, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_710, out a0_711, out a1_712, out a2_713, out a3_186, out a4_191, out a5_714, out a7_715, out s2_269, out s3_193, out s4_716, out s5_717, out s6_718, out s7_719, out s8_720, out s9_721, out s10_722, out s11_723, out t4_724);
				if ((word32) *s2_269 == 0x00)
				{
					Eq_2 a0_283;
					Eq_2 a5_284;
					Eq_2 a2_287;
					word32 s1_725;
					word32 a1_726;
					word32 a3_727;
					word32 a4_728;
					word32 a7_729;
					word32 s2_730;
					word32 s3_731;
					word32 s4_732;
					word32 s5_733;
					word32 s6_734;
					word32 s7_735;
					word32 s8_736;
					word32 s9_737;
					word32 s10_738;
					word32 s11_739;
					word32 t4_740;
					printf(ra_220, &g_t230C59EC, a3_186, dwLoc0158, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_725, out a0_283, out a1_726, out a2_287, out a3_727, out a4_728, out a5_284, out a7_729, out s2_730, out s3_731, out s4_732, out s5_733, out s6_734, out s7_735, out s8_736, out s9_737, out s10_738, out s11_739, out t4_740);
					word32 s0_741;
					word32 s1_742;
					word32 a0_743;
					word32 a1_744;
					word32 a2_745;
					word32 a3_746;
					word32 a4_747;
					word32 a5_748;
					word32 a6_749;
					word32 s4_750;
					word32 t3_751;
					vPortFree(a0_283, a2_287, a5_284, mstatus, s0, dwArg38, out s0_741, out s1_742, out a0_743, out a1_744, out a2_745, out a3_746, out a4_747, out a5_748, out a6_749, out s4_750, out t3_751);
					return;
				}
				++s0_192;
			}
			word32 s1_691;
			word32 a5_690;
			word32 a4_689;
			word32 a0_692;
			word32 a1_693;
			word32 a2_694;
			word32 a5_697;
			word32 a3_695;
			word32 a4_696;
			word32 s2_699;
			word32 a7_698;
			word32 s3_700;
			word32 s4_701;
			word32 s5_702;
			word32 s6_703;
			word32 a1_686;
			word32 a2_687;
			word32 a3_688;
			word32 s7_704;
			word32 s8_705;
			word32 s9_706;
			word32 s10_707;
			word32 s11_708;
			word32 t4_709;
			printf(ra_220, &g_t230C5A04, strlen(dwArg14, out a1_686, out a2_687, out a3_688, out a4_689, out a5_690), dwLoc0158, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_691, out a0_692, out a1_693, out a2_694, out a3_695, out a4_696, out a5_697, out a7_698, out s2_699, out s3_700, out s4_701, out s5_702, out s6_703, out s7_704, out s8_705, out s9_706, out s10_707, out s11_708, out t4_709);
l230800F0:
			at_callback_do(fp + -316);
			return;
		}
	}
	word32 s8_659;
	word32 a0_646;
	word32 s1_645;
	word32 a2_648;
	word32 a3_649;
	word32 a1_647;
	word32 s2_653;
	word32 a4_650;
	word32 a5_651;
	word32 a7_652;
	word32 s3_654;
	word32 s4_655;
	word32 s6_657;
	word32 s7_658;
	word32 s5_656;
	word32 s9_660;
	word32 s10_661;
	word32 t4_663;
	word32 s11_662;
	printf(ra_220, &g_t230C59C8, a3_67, dwLoc0158, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s1_645, out a0_646, out a1_647, out a2_648, out a3_649, out a4_650, out a5_651, out a7_652, out s2_653, out s3_654, out s4_655, out s5_656, out s6_657, out s7_658, out s8_659, out s9_660, out s10_661, out s11_662, out t4_663);
	goto l230800F0;
}

// 230801C0: void at_scan(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      scan_handler
void at_scan(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1)
{
	if (a0 == 0x00)
	{
		if (a1 != 0x00)
			return;
		goto l230801E8;
	}
	if (a1 == 0x00)
		return;
	s1 = a0;
	word32 a1_170;
	word32 a4_173;
	word32 a5_174;
	word32 a2_171;
	word32 a3_172;
	if (strcmp(a0, 588005304, out a1_170, out a2_171, out a3_172, out a4_173, out a5_174) == 0x00)
	{
		word32 a1_180;
		word32 a4_183;
		word32 a5_184;
		word32 a2_181;
		word32 a3_182;
		if (strcmp(a1, 0x230C9664, out a1_180, out a2_181, out a3_182, out a4_183, out a5_184) == 0x00)
			goto l23080250;
	}
	word32 a1_175;
	word32 a4_178;
	word32 a5_179;
	word32 a2_176;
	word32 a3_177;
	if (strcmp(a0, 588010700, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179) != 0x00)
		return;
	word32 a1_185;
	word32 a2_186;
	word32 a3_187;
	word32 a4_188;
	word32 a5_189;
	if (strcmp(a1, 0x230C9664, out a1_185, out a2_186, out a3_187, out a4_188, out a5_189) != 0x00)
		return;
l230801E8:
	<anonymous> * a5_75 = g_ptr42027944;
	if (a5_75 != null)
	{
		word32 a5_93;
		word32 a3_95;
		word32 a4_96;
		word32 t2_97;
		word32 t0_98;
		word32 t1_99;
		a5_75();
	}
}

