pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0007.c
// 23080254: void tcp_sent_callback(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_467145) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8)
void tcp_sent_callback(Eq_2 ra, Eq_2 s1, struct Eq_467145 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8)
{
	if (a0 <= (struct Eq_467145 *) 0x04)
	{
		word32 a5_362;
		vTaskEnterCritical(a4, mstatus, out a5_362);
		Eq_2 s3_39 = (word32) a0->b4201C3A0;
		if (s3_39 != 0x03)
		{
			word32 a4_364;
			word32 a5_365;
			word32 s1_366;
			word32 a0_367;
			word32 a1_368;
			word32 a2_369;
			word32 a3_370;
			word32 a4_371;
			word32 a5_372;
			word32 a7_373;
			word32 s2_374;
			word32 s3_375;
			word32 s4_376;
			word32 s5_377;
			word32 s6_378;
			word32 s7_379;
			word32 s8_380;
			word32 s9_381;
			word32 s10_382;
			word32 s11_383;
			word32 t4_384;
			printf(ra, &g_t230C5E4C, vTaskExitCritical(a3, mstatus, out a4_364, out a5_365), s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_366, out a0_367, out a1_368, out a2_369, out a3_370, out a4_371, out a5_372, out a7_373, out s2_374, out s3_375, out s4_376, out s5_377, out s6_378, out s7_379, out s8_380, out s9_381, out s10_382, out s11_383, out t4_384);
		}
		else
		{
			Eq_2 a4_44;
			word32 a5_363;
			Eq_2 a3_43 = vTaskExitCritical(a3, mstatus, out a4_44, out a5_363);
			if ((word32) a0->b4201C380 == s3_39)
			{
				g_t4200F6EC.u0 = 0x00;
				Eq_2 a2_176;
				Eq_2 a3_177;
				Eq_2 a4_178;
				ptr32 mstatus_182;
				Eq_2 s1_185;
				Eq_2 s3_189;
				Eq_2 a2_208;
				Eq_2 a3_209;
				Eq_2 a4_210;
				ptr32 mstatus_214;
				Eq_2 s1_217;
				Eq_2 s3_221;
				word32 s0_399;
				word32 a0_400;
				word32 a1_401;
				word32 a5_402;
				word32 s2_403;
				word32 s4_404;
				word32 s5_405;
				word32 s6_406;
				word32 s7_407;
				word32 s8_408;
				word32 s9_409;
				word32 s10_410;
				word32 s11_411;
				word32 s0_412;
				word32 a0_413;
				word32 a1_414;
				word32 a5_415;
				word32 s2_416;
				word32 s4_417;
				word32 s5_418;
				word32 s6_419;
				word32 s7_420;
				word32 s8_421;
				word32 s9_422;
				word32 s10_423;
				word32 s11_424;
				word32 s0_425;
				word32 s1_426;
				word32 a0_427;
				word32 a1_428;
				word32 a2_429;
				word32 a3_430;
				word32 a4_431;
				word32 a5_432;
				word32 s2_433;
				word32 s3_434;
				word32 s4_435;
				word32 s5_436;
				word32 s6_437;
				word32 s7_438;
				word32 s8_439;
				word32 s9_440;
				word32 s10_441;
				word32 s11_442;
				word32 mstatus_443;
				at_dump_noend(at_dump_noend(at_dump_noend(ra, 0x230C7000, 0x230C6900, a2, a3_43, a4_44, s3_39, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_399, out s1_185, out a0_400, out a1_401, out a2_176, out a3_177, out a4_178, out a5_402, out s2_403, out s3_189, out s4_404, out s5_405, out s6_406, out s7_407, out s8_408, out s9_409, out s10_410, out s11_411, out mstatus_182), s1_185, 588013172, a2_176, a3_177, a4_178, s3_189, mstatus_182, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_412, out s1_217, out a0_413, out a1_414, out a2_208, out a3_209, out a4_210, out a5_415, out s2_416, out s3_221, out s4_417, out s5_418, out s6_419, out s7_420, out s8_421, out s9_422, out s10_423, out s11_424, out mstatus_214), s1_217, (word32) s1_217 - 0x0700, a2_208, a3_209, a4_210, s3_221, mstatus_214, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_425, out s1_426, out a0_427, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432, out s2_433, out s3_434, out s4_435, out s5_436, out s6_437, out s7_438, out s8_439, out s9_440, out s10_441, out s11_442, out mstatus_443);
			}
			else
			{
				word32 * a2_56;
				Eq_2 a3_57;
				Eq_2 a4_58;
				word32 s2_64;
				Eq_2 s3_65;
				word32 s1_385;
				word32 a0_386;
				word32 a1_387;
				word32 a5_388;
				word32 a7_389;
				word32 s4_390;
				word32 s5_391;
				word32 s6_392;
				word32 s7_393;
				word32 s8_394;
				word32 s9_395;
				word32 s10_396;
				word32 s11_397;
				word32 t4_398;
				Eq_2 ra_60 = printf(ra, &g_t230C5E88, a3_43, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_385, out a0_386, out a1_387, out a2_56, out a3_57, out a4_58, out a5_388, out a7_389, out s2_64, out s3_65, out s4_390, out s5_391, out s6_392, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398);
				Eq_2 a2_75 = a2_56 - s2_64;
				*a2_75 = *a2_56;
				if (a2_75 <= 0x00)
				{
					Eq_2 a2_82;
					Eq_2 a3_83;
					Eq_2 a4_84;
					ptr32 mstatus_88;
					Eq_2 s1_91;
					Eq_2 s3_95;
					Eq_2 a2_114;
					Eq_2 a3_115;
					Eq_2 a4_116;
					ptr32 mstatus_120;
					Eq_2 s1_123;
					word32 s2_126;
					Eq_2 s3_127;
					word32 s0_444;
					word32 a0_445;
					word32 a1_446;
					word32 a5_447;
					word32 s2_448;
					word32 s4_449;
					word32 s5_450;
					word32 s6_451;
					word32 s7_452;
					word32 s8_453;
					word32 s9_454;
					word32 s10_455;
					word32 s11_456;
					word32 s0_457;
					word32 a0_458;
					word32 a1_459;
					word32 a5_460;
					word32 s4_461;
					word32 s5_462;
					word32 s6_463;
					word32 s7_464;
					word32 s8_465;
					word32 s9_466;
					word32 s10_467;
					word32 s11_468;
					word32 s0_469;
					word32 s1_470;
					word32 a0_471;
					word32 a1_472;
					word32 a2_473;
					word32 a3_474;
					word32 a4_475;
					word32 a5_476;
					word32 s2_477;
					word32 s3_478;
					word32 s4_479;
					word32 s5_480;
					word32 s6_481;
					word32 s7_482;
					word32 s8_483;
					word32 s9_484;
					word32 s10_485;
					word32 s11_486;
					word32 mstatus_487;
					at_dump_noend(at_dump_noend(at_dump_noend(ra_60, 0x00, 0x230C6900, a2_75, a3_57, a4_58, s3_65, mstatus, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_444, out s1_91, out a0_445, out a1_446, out a2_82, out a3_83, out a4_84, out a5_447, out s2_448, out s3_95, out s4_449, out s5_450, out s6_451, out s7_452, out s8_453, out s9_454, out s10_455, out s11_456, out mstatus_88), s1_91, 588013172, a2_82, a3_83, a4_84, s3_95, mstatus_88, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_457, out s1_123, out a0_458, out a1_459, out a2_114, out a3_115, out a4_116, out a5_460, out s2_126, out s3_127, out s4_461, out s5_462, out s6_463, out s7_464, out s8_465, out s9_466, out s10_467, out s11_468, out mstatus_120), s1_123, s2_126 + -0x0700, a2_114, a3_115, a4_116, s3_127, mstatus_120, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg3C, dwArg40, dwArg44, s1, dwArg88, dwArg8C, dwArgB8, dwArgC8, dwArgF8, out s0_469, out s1_470, out a0_471, out a1_472, out a2_473, out a3_474, out a4_475, out a5_476, out s2_477, out s3_478, out s4_479, out s5_480, out s6_481, out s7_482, out s8_483, out s9_484, out s10_485, out s11_486, out mstatus_487);
				}
			}
		}
	}
	else
		__assert_func(ra, 0x230C5C1C, s2, s6, s7, s8, s9);
}

